{
  "already_exist": false,
  "name": "Baba Gurditta",
  "slug": "baba-gurdita",
  "category": "Guru Family",
  "birth": "1613-11-05",
  "death": "1638-03-15",
  "birthPlace": "Daroli Bhai, Ferozepur District, Punjab, India",
  "image": "N/A",
  "excerpt": "Baba Gurditta (1613–1638) was the eldest son of Guru Hargobind, the sixth Sikh Guru, and a pivotal figure in Sikh lineage expansion. He founded Kiratpur Sahib, served as head of the Udasi sect, participated in key battles, and was the father of Guru Har Rai, the seventh Sikh Guru. Known for his spiritual depth, martial prowess, and resemblance to Guru Nanak, he exemplified the Sikh ideals of miri-piri (temporal and spiritual authority).",
  "designation": "Eldest Son of Guru Hargobind; Father of Guru Har Rai; Founder of Kiratpur Sahib; Head of Udasi Sect; Warrior-Saint",
  "quickStats": [
    {
      "label": "Age at Death",
      "value": "25 years"
    },
    {
      "label": "Spouse",
      "value": "Mata Nihal Kaur (also known as Ananti or Netti)"
    },
    {
      "label": "Children",
      "value": "2 (Guru Har Rai, Dhir Mall)"
    },
    {
      "label": "Key Role",
      "value": "Expanded Sikh missionary activities and urban settlements during a period of Mughal-Sikh tensions"
    },
    {
      "label": "Gurdwaras Associated",
      "value": "Gurdwara Baba Gurditta in Kiratpur Sahib; Gurdwara Daroli Bhai (birthplace)"
    }
  ],
  "quickFacts": [
    {
      "label": "Resemblance",
      "value": "Resembled Guru Nanak in appearance and demeanor from youth"
    },
    {
      "label": "Marriage",
      "value": "Married at age 8; wedding gifted a horse worth 100,000 rupees by Guru Hargobind"
    },
    {
      "label": "Battle Incident",
      "value": "Killed childhood friend Asman Khan in battle, mourning the loss deeply"
    },
    {
      "label": "Udasi Leadership",
      "value": "Appointed successor to Baba Sri Chand as Udasi leader, establishing four preaching centers (dhūāṅs)"
    },
    {
      "label": "Death Legend",
      "value": "Death linked to a legendary miracle involving reviving a cow, followed by remorse"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-01",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Baba Gurditta was born in 1613 (or possibly 1608 per some historical accounts) in the forested village of Daroli Bhai in the Malwa region of Punjab to Guru Hargobind and Mata Damodari (SikhiWiki infobox notes Mata Ganga, but textual sources confirm Damodari as the mother of Guru Hargobind's elder sons). His birth was celebrated with the distribution of sacred prasad, as recorded in contemporary accounts. From a young age, he received training in religious lore, Sikh scriptures, and martial arts under his father's guidance, reflecting the era's emphasis on a balanced spiritual and warrior ethos. He resembled Guru Nanak in appearance, earning his name \"Gurditta\" (Gur + ditta, meaning \"form given by the Guru\"). At around age 6 (1619), he was engaged to Ananti (Netti), daughter of Bhai Rama of Batala, with the marriage solemnized on 17 April 1621 in a grand ceremony attended by Sikh congregations from regions like Darauli, Mandiali, Goindval, and Khadur Sahib. Guru Hargobind gifted him a horse valued at 100,000 rupees. Baba Buddha and Bhai Gurdas remained in Amritsar to oversee key Gurdwaras during the event."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "Baba Gurditta played a crucial role in expanding Sikh institutions and missionary work. In 1626–1627, he resided in Kartarpur (Jalandhar district) as per his father's directives, helping organize Sikh communities. He founded the township of Kiratpur Sahib around 1627–1634 (sources vary) near the Shivalik foothills, purchasing land from Raja Tara Chand of Kehlur. This settlement became a major Sikh center, serving as residence for Gurus Hargobind, Har Rai, and Har Krishan. Appointed by Baba Sri Chand (son of Guru Nanak) as successor to head the Udasi sect, he invigorated its activities by establishing four preaching centers (dhūāṅs) to propagate Sikh teachings. He also participated in defensive Sikh operations, commanding forces alongside Baba Bidhi Chand during sieges."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "N/A (No major doctrinal reforms attributed directly; his efforts focused on institutional expansion, such as founding Kiratpur and strengthening Udasi missionary outreach. He reinforced the Sikh principle of miri-piri by balancing spiritual leadership with martial readiness.)"
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "N/A (Baba Gurditta is not credited with major literary works in Sikh scripture like the Guru Granth Sahib. His legacy is more institutional and legendary than textual. Some hagiographies attribute inspirational verses or couplets to him, but these lack verification and are not canonized.)"
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "In his later years, Baba Gurditta resided primarily in Kiratpur Sahib. He took part in the Battle of Kartarpur in 1635 against Painde Khan and Mughal forces, where he slew Asman Khan (a childhood friend) with an arrow, later weeping over the death and remarking on the tragedy of circumstance forcing fratricide. An incident with a proposed second marriage to Nakhora's daughter was vetoed by Guru Hargobind after protests from Mata Ananti. On 15 March 1638, while hunting, he accidentally killed a cow (mistaking it for a deer) and reluctantly revived it through a miracle at the urging of his party. Admonished by Guru Hargobind for displaying such powers (contrary to Sikh humility), he retreated in remorse to a lonely spot outside Kiratpur and passed away at age 24–25. His funeral involved honors for martyred Nihangs at Killi Sahib Gurdwara."
    }
  ],
  "spiritualLegacy": {
    "description": "Baba Gurditta's legacy embodies the fusion of spiritual devotion and temporal action in early Sikhism. As head of the Udasi sect, he expanded its reach, fostering interfaith dialogue and missionary zeal while remaining rooted in Guru Nanak's teachings. His life highlighted humility, as seen in his remorse over miracles and battles, influencing the Sikh ethos against ostentation.",
    "keyContributions": [
      "Founded Kiratpur Sahib, a enduring Sikh spiritual hub where subsequent Gurus were born and resided.",
      "Revitalized Udasi sect by establishing preaching centers, promoting Sikh philosophy across regions.",
      "Served as a bridge in the Guru lineage, fathering Guru Har Rai and ensuring continuity of Guruship.",
      "Exemplified Sikh warrior-saint ideal through participation in battles while mourning unnecessary violence."
    ]
  },
  "modernRelevance": {
    "description": "In contemporary Sikhism, Baba Gurditta symbolizes lineage preservation and institutional growth amid adversity. Kiratpur Sahib remains a pilgrimage site for immersing ashes, drawing Sikhs globally for reflection on mortality and legacy.",
    "contemporaryImpact": [
      "Gurdwara Baba Gurditta in Kiratpur attracts devotees seeking blessings for family and prosperity, with annual fairs commemorating his life.",
      "His story inspires modern Sikh activism in education and community building, echoing Udasi missionary roots.",
      "Featured in Sikh historical narratives and films (e.g., indirect references in *Veer-Zaara*), promoting cultural awareness of early Guru family dynamics."
    ]
  },
  "achievements": [
    {
      "title": "Founder of Kiratpur Sahib",
      "year": "1627–1634",
      "description": "Established a key Sikh township under Guru Hargobind's guidance, serving as a safe haven and spiritual center.",
      "icon": "🏛️"
    },
    {
      "title": "Head of Udasi Sect",
      "year": "~1630s",
      "description": "Appointed successor to Baba Sri Chand; founded four dhūāṅs to expand Sikh missionary activities.",
      "icon": "🛐"
    },
    {
      "title": "Participant in Battle of Kartarpur",
      "year": "1635",
      "description": "Commanded defenses against Mughal forces; demonstrated martial valor while upholding humanitarian values.",
      "icon": "⚔️"
    },
    {
      "title": "Lineage Expansion",
      "year": "1630–1638",
      "description": "Fathered Guru Har Rai, ensuring the continuation of Sikh Guruship through his descendants.",
      "icon": "👥"
    }
  ],
  "quotes": [
    {
      "original": "N/A",
      "transliteration": "N/A",
      "translation": "N/A",
      "context": "N/A",
      "source": "citationNeeded (Hagiographies mention oral teachings on humility, but unverified.)"
    },
    {
      "original": "ਧੰਨ ਧੰਨ ਬਾਬਾ ਗੁਰਦਿੱਤਾ ਦੀਨ ਦੁਨੀ ਦਾ ਟਿਕਾ ਜੋ ਵਰ ਮੰਗਿਆ ਸੋ ਵਰ ਦਿੱਤਾ ॥ (Dhan Dhan Baba Gurditta Ji Dhīn Dunī Dā Tikā Ji Jo Var Mangiā So Var Dittā)",
      "transliteration": "Dhan dhan Baba Gurditta din dunī dā tikā jo var maṅgiā so var ditta.",
      "translation": "“Blessed is Baba Gurditta, he is the touchstone of spirituality; they who ask for boons from you are always granted what they wish.”",
      "context": "A traditional Sikh mantra praising his miraculous and benevolent nature, chanted at associated Gurdwaras.",
      "source": "SikhiWiki oral traditions [citationNeeded for primary text]."
    }
  ],
  "timeline": [
    {
      "year": 1613,
      "date": "1613-11-05",
      "event": "Birth in Daroli Bhai to Guru Hargobind and Mata Damodari.",
      "type": "Birth"
    },
    {
      "year": 1619,
      "date": "October (Katak)",
      "event": "Engagement to Ananti (Netti) at age 6.",
      "type": "Personal"
    },
    {
      "year": 1621,
      "date": "1621-04-17",
      "event": "Marriage to Mata Nihal Kaur in Batala; grand Sikh celebration.",
      "type": "Personal"
    },
    {
      "year": 1626,
      "date": "-",
      "event": "Resides in Kartarpur (Jalandhar) per father's orders.",
      "type": "Relocation"
    },
    {
      "year": 1627,
      "date": "-",
      "event": "Purchases land and begins founding Kiratpur Sahib with Raja Tara Chand.",
      "type": "Institutional"
    },
    {
      "year": "1630s",
      "date": "-",
      "event": "Appointed head of Udasi sect by Baba Sri Chand; establishes dhūāṅs.",
      "type": "Spiritual"
    },
    {
      "year": 1635,
      "date": "-",
      "event": "Participates in Battle of Kartarpur; kills Asman Khan.",
      "type": "Military"
    },
    {
      "year": 1638,
      "date": "1638-03-15",
      "event": "Performs miracle reviving a cow; admonished by father; passes away in Kiratpur.",
      "type": "Death"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Hargobind",
      "relation": "Father",
      "slug": "guru-hargobind"
    },
    {
      "name": "Mata Damodari",
      "relation": "Mother",
      "slug": "mata-damodari"
    },
    {
      "name": "Mata Nihal Kaur",
      "relation": "Spouse",
      "slug": "mata-nihal-kaur"
    },
    {
      "name": "Guru Har Rai",
      "relation": "Son",
      "slug": "guru-har-rai"
    },
    {
      "name": "Dhir Mall",
      "relation": "Son",
      "slug": "dhir-mall"
    },
    {
      "name": "Baba Sri Chand",
      "relation": "Spiritual Mentor/Successor Role",
      "slug": "baba-sri-chand"
    },
    {
      "name": "Guru Tegh Bahadur",
      "relation": "Brother",
      "slug": "guru-tegh-bahadur"
    }
  ],
  "historicalContext": {
    "period": "Early 17th century (Mughal-Sikh era, post-Guru Arjan's martyrdom).",
    "politicalSituation": "Under Emperor Shah Jahan's reign, escalating Mughal-Sikh conflicts; Guru Hargobind militarized Sikhs with akal takht and armies to defend against persecution.",
    "socialConditions": "Punjab's Malwa and Doaba regions faced tribal raids and imperial taxes; Sikh communities emphasized self-reliance, leading to new settlements like Kiratpur. Interfaith dynamics existed, as seen in Udasi's inclusive missionary work.",
    "significance": "Baba Gurditta's life marked the transition from foundational Sikhism to organized resistance and expansion. His founding of Kiratpur provided a strategic base amid Mughal pressures, while his Udasi leadership bridged Sikh and ascetic traditions, influencing Sikh resilience."
  },
  "references": [
    "Wikipedia: \"Baba Gurditta\" (accessed via API; verified historical summary, cross-checked with primary sources like Bhatt Vahis).",
    "SikhiWiki: \"Baba Gurditta\" (detailed biography; infobox inconsistencies noted—text prioritizes Mata Damodari over Ganga; references include Gurbilas Chhevin Patshahi, 1970).",
    "Chhibbar, Kesar Singh. *Bansavalinama Dasan Patshahian Ka*. Chandigarh, 1972. (On Guru family lineage.)",
    "Randhir Singh, Bhai. *Udasi Sikhān dī Vithia*. Amritsar, 1972. (Udasi sect history.)",
    "Khushwant Singh. *A History of the Sikhs, Vol. I*. Princeton, 1963. (Context on early Gurus.)",
    "Harbans Singh. *The Heritage of the Sikhs*. Delhi, 1983. (Sikh institutional growth.)",
    "Pashaura Singh. (Scholarly note on birth date from Assu full moon, sambat 1665.) citationNeeded for exact publication.",
    "Gurdwara records from Kiratpur Sahib and Daroli Bhai (oral and site-based traditions)."
  ]
}
