{
  "already_exist": false,
  "name": "Baba Deep Singh Shahid",
  "slug": "baba-shahid-singh",
  "category": "Martyrs",
  "birth": "1682-01-26",
  "death": "1757-11-13",
  "birthPlace": "Pahuwind village, Amritsar district, Punjab, India",
  "image": "https://www.sikhiwiki.org/images/5/5e/Baba_Deep_Singh_fresco_from_Gurdwara_Baba_Atal%2C_Amritsar.jpg",
  "excerpt": "Baba Deep Singh Shahid (1682–1757) was a revered Sikh scholar, warrior, and martyr who founded the Shahid Misl and served as the first head of the Damdami Taksal. Known for his unyielding devotion to Sikh principles, he led military campaigns against Mughal and Afghan forces and sacrificed his life defending the Harmandir Sahib in Amritsar.",
  "designation": "Founder of Shahid Misl; First Jathedar of Damdami Taksal; Sikh Martyr and Warrior Saint",
  "quickStats": [
    {
      "label": "Height/Physique",
      "value": "Tall and exceptionally strong (historical accounts describe him as a \"mountain of a man\")"
    },
    {
      "label": "Languages",
      "value": "Gurmukhi, Punjabi, Persian, and possibly Arabic (inscribed Guru Granth Sahib in Abjad script)"
    },
    {
      "label": "Weapons",
      "value": "Proficient in Khanda (32 lb double-edged sword), archery, horsemanship"
    },
    {
      "label": "Followers",
      "value": "Led up to 5,000+ Sikhs in his final battle"
    }
  ],
  "quickFacts": [
    {
      "label": "Martyrdom",
      "value": "Fought headless after beheading, fulfilling vow to reach Harmandir Sahib"
    },
    {
      "label": "Contributions",
      "value": "Hand-copied multiple volumes of Guru Granth Sahib; Rescued captives from Ahmad Shah Durrani"
    },
    {
      "label": "Legacy",
      "value": "Symbol of Sikh resilience; Commemorated at Gurdwara Shahidganj Baba Deep Singh"
    }
  ],
  "version": {
    "lastUpdated": "2024-03-08",
    "version": "1.0",
    "contributors": 3,
    "edits": 1,
    "historyUrl": "https://en.wikipedia.org/w/index.php?title=Baba_Deep_Singh&action=history; https://www.sikhiwiki.org/index.php?title=Baba_Deep_Singh&action=history"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Baba Deep Singh was born on January 26, 1682 (14 Maagh, Samvat 1739), in Pahuwind village, Amritsar district, to a Sandhu Jat Sikh family. His father, Bhagta Ji (a farmer), and mother, Jioni Ji, were devoted Sikhs. As their only child, he received much affection. At age 12, on Vaisakhi 1694 (1700 CE), he visited Anandpur Sahib with his parents and stayed at the request of Guru Gobind Singh Ji. There, he learned Gurmukhi, Sikh philosophy, and martial arts (horsemanship, archery, weaponry) from Bhai Mani Singh and the Guru. Baptized into the Khalsa at age 18 via Amrit Sanchar, he adopted the name Deep Singh. After eight years at Anandpur, he returned to Pahuwind in 1702, married, and assisted his parents until summoned to Damdama Sahib in 1705. (Sources: SikhiWiki, Wikipedia; cross-verified with A History of the Sikh Misals by Bhagata Singh, 1993, p. 241)"
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "Baba Deep Singh served as a custodian of Sikh scriptures and the Panth. At Damdama Sahib (1705–1706), he assisted Bhai Mani Singh in compiling and hand-copying the Guru Granth Sahib, producing multiple volumes distributed to Takhts (Akal Takht, Patna Sahib, Hazur Sahib, Kesgarh Sahib). He inscribed one copy in Abjad (Arabic) script for outreach to the Middle East. Appointed head Granthi at Damdama Sahib in 1706, he preached Sikh teachings, wrote Gutkas (hymn books), and led sewa. Militarily, he joined Banda Singh Bahadur in 1709 for battles at Sadhaura and Chappar Chiri (avenging Guru's sons at Sirhind). In 1733, Nawab Kapur Singh appointed him leader of a jatha; by 1748, he headed the Shaheed Misl under Dal Khalsa. He rescued 300+ women and children from Ahmad Shah Durrani's 1756 raid near Kurukshetra, freeing captives and looting treasury. (Sources: Wikipedia, SikhiWiki; Prachin Panth Prakash, 1914)"
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "As first Jathedar of Damdami Taksal (founded by Guru Gobind Singh), he established it as a center for Sikh scholarship and martial training, emphasizing saint-soldier (Sant-Sipahi) ideals. He reorganized Sikh forces into Misls for efficient resistance against Mughal-Afghan oppression. Promoted equitable distribution of Guru Granth Sahib to strengthen Panth unity. His leadership in pillaging post-Nadir Shah (1740) and establishing short-lived Sikh polity in Sirhind sarkar challenged Mughal decline. (Sources: SikhiWiki; Hari Ram Gupta's historical analysis in Wikipedia references; citationNeeded for exact polity details)"
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "Primarily a scribe and scholar, Baba Deep Singh hand-copied the Guru Granth Sahib multiple times (1705–1728) and produced Gutkas for community distribution. No original compositions attributed, but he interpreted Gurus' words and recited Shabads like \"Jo to praym khaylan ka chaao...\" during battles to inspire Sikhs. Inscribed Guru Granth Sahib in Abjad script for broader dissemination. (Sources: SikhiWiki, Wikipedia)"
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "In 1755, he survived the Chhota Ghalughara (Small Holocaust), where 10,000 Sikhs were killed. By 1757, after Ahmad Shah Durrani desecrated Harmandir Sahib (blowing it up and polluting the sarovar), the 75-year-old Baba vowed to rebuild it. Rallying 500 Sikhs at Damdama Sahib, his force grew to 5,000 en route to Amritsar. He drew a line with his Khanda at Tarn Taran, reciting Ardas for only the committed to cross. Intercepted by 20,000 Mughal-Afghan troops under Jahan Khan near Goharwal, he fought fiercely with his 15kg Khanda. Beheaded by Jamal Khan, he held his head in his left palm and continued fighting, reciting Japji Sahib, until reaching Harmandir Sahib's parikarma, where he expired on November 13, 1757. (Sources: Wikipedia, SikhiWiki; Giani Gian Singh's Panth Prakash, 1970)"
    }
  ],
  "spiritualLegacy": {
    "description": "Baba Deep Singh exemplified the Sikh ideal of Miri-Piri (temporal-spiritual balance), blending profound scholarship with fearless warfare. His life reinforced Guru Gobind Singh's teachings on sacrifice, equality, and resistance to tyranny. As Damdami Taksal head, he preserved Sikh oral and scriptural traditions.",
    "keyContributions": [
      "Preservation of Guru Granth Sahib through meticulous copying and distribution, ensuring accessibility across regions.",
      "Embodiment of \"Dharam Yudh\" (righteous war); his headless march symbolizes unbreakable spirit and devotion.",
      "Inspiration for Sikh resilience during 18th-century persecutions, influencing Misls and later Khalsa structure."
    ]
  },
  "modernRelevance": {
    "description": "In contemporary Sikhism, Baba Deep Singh is invoked as a model of courage amid adversity, relevant in discussions of identity, resistance to oppression, and cultural preservation. His story motivates global Sikh youth in education, service, and activism.",
    "contemporaryImpact": [
      "Annual commemorations at Gurdwaras (e.g., Shaheedi Jor Mela at Amritsar) draw thousands, fostering community unity.",
      "Featured in Sikh media, art, and education (e.g., Damdami Taksal programs); symbolizes anti-colonial resistance in Punjabi diaspora narratives.",
      "Influences modern Sikh activism, echoing calls for justice in events like the 1984 anti-Sikh riots."
    ]
  },
  "achievements": [
    {
      "title": "Baptism into Khalsa",
      "year": "1700",
      "description": "Received Amrit from Guru Gobind Singh at Anandpur Sahib, committing to Sikh vows.",
      "icon": "🪯"
    },
    {
      "title": "Scribe of Guru Granth Sahib",
      "year": "1705–1706",
      "description": "Assisted in final compilation; produced and distributed multiple handwritten copies.",
      "icon": "📜"
    },
    {
      "title": "Leader of Shaheed Misl",
      "year": "1748",
      "description": "Reorganized Dal Khalsa; led southern Punjab operations against Mughals/Afghans.",
      "icon": "⚔️"
    },
    {
      "title": "Rescue of Captives",
      "year": "1756",
      "description": "Freed 300+ women/children from Durrani's forces near Kurukshetra, looted treasury.",
      "icon": "🛡️"
    },
    {
      "title": "Martyrdom at Amritsar",
      "year": "1757",
      "description": "Led 5,000 Sikhs against 20,000 foes; fulfilled vow by dying at Harmandir Sahib.",
      "icon": "🕊️"
    }
  ],
  "quotes": [
    {
      "original": "ਜੋ ਤੋ ਪ੍ਰੇਮ ਖੇਲਣ ਕਾ ਚਾਉ ॥ ਸੀਸੁ ਧਰਿ ਤਲੇ ਪਾਵਣਿ ਨੀਆਉ ॥",
      "transliteration": "Jo to pream khelan ka chaao, Sees dhar tale paavan niaao.",
      "translation": "If you desire to play the game of love, come with your head in your palm.",
      "context": "Recited during his final battle at Tarn Taran to inspire Sikhs to cross the line of commitment, emphasizing sacrifice for faith.",
      "source": "Guru Granth Sahib (verified via SikhiWiki and Wikipedia); historical accounts in Shahid Bilas Baba Dip Singh Ji by Giani Thakar Singh, 1904."
    }
  ],
  "timeline": [
    {
      "year": 1682,
      "date": "1682-01-26",
      "event": "Born in Pahuwind village to Bhagta and Jioni Ji.",
      "type": "Birth"
    },
    {
      "year": 1700,
      "date": "1700 Vaisakhi",
      "event": "Arrived at Anandpur Sahib; began studies under Guru Gobind Singh.",
      "type": "Education"
    },
    {
      "year": 1700,
      "date": "1700 Vaisakhi",
      "event": "Baptized into Khalsa via Amrit Sanchar.",
      "type": "Initiation"
    },
    {
      "year": 1705,
      "date": "1705",
      "event": "Summoned to Damdama Sahib; assisted in Guru Granth Sahib compilation.",
      "type": "Service"
    },
    {
      "year": 1709,
      "date": "1709",
      "event": "Joined Banda Singh Bahadur; fought in Battles of Sadhaura and Sirhind.",
      "type": "Military"
    },
    {
      "year": 1733,
      "date": "1733",
      "event": "Appointed jatha leader by Nawab Kapur Singh.",
      "type": "Leadership"
    },
    {
      "year": 1748,
      "date": "1748 Vaisakhi",
      "event": "Became head of Shaheed Misl in Dal Khalsa reorganization.",
      "type": "Reform"
    },
    {
      "year": 1756,
      "date": "1756",
      "event": "Led rescue of captives from Ahmad Shah Durrani near Kurukshetra.",
      "type": "Military"
    },
    {
      "year": 1757,
      "date": "1757-04",
      "event": "Harmandir Sahib desecrated by Durrani; vowed to rebuild.",
      "type": "Vow"
    },
    {
      "year": 1757,
      "date": "1757-11-13",
      "event": "Martyred in battle at Amritsar; head fell at Harmandir parikarma.",
      "type": "Martyrdom"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Gobind Singh",
      "relation": "Guru and Mentor",
      "slug": "guru-gobind-singh"
    },
    {
      "name": "Bhai Mani Singh",
      "relation": "Colleague and Scribe",
      "slug": "bhai-mani-singh"
    },
    {
      "name": "Banda Singh Bahadur",
      "relation": "Military Ally",
      "slug": "banda-singh-bahadur"
    },
    {
      "name": "Nawab Kapur Singh",
      "relation": "Superior in Dal Khalsa",
      "slug": "nawab-kapur-singh"
    }
  ],
  "historicalContext": {
    "period": "18th-century Sikh Misls era (post-Guru period, 1708–1799), marked by resistance to Mughal decline and Afghan invasions.",
    "politicalSituation": "Mughal Empire weakening after Aurangzeb's death (1707); invasions by Nadir Shah (1739) and Ahmad Shah Durrani (1747–1769) led to anarchy in Punjab. Sikhs formed Misls for self-defense and governance.",
    "socialConditions": "Persecution of non-Muslims; forced conversions, jizya tax, and slave raids. Sikhs faced holocausts (e.g., Chhota Ghalughara, 1755). Rural Jat communities like Sandhu provided resilient base for Khalsa.",
    "significance": "Baba Deep Singh's martyrdom galvanized Sikh unity, paving way for Ranjit Singh's empire (1799). His actions highlighted Khalsa's role in liberating Punjab, influencing Sikh sovereignty."
  },
  "references": [
    "Wikipedia: \"Baba Deep Singh\" (en.wikipedia.org/wiki/Baba_Deep_Singh) – Structured bio, dates, military career (last accessed 2024).",
    "SikhiWiki: \"Baba Deep Singh\" (www.sikhiwiki.org/index.php/Baba_Deep_Singh) – Detailed early life, battles, legacy (updated March 8, 2024).",
    "Bhagata Singh (1993). *A History of the Sikh Misals*. Punjabi University Publication Bureau, p. 241 – Birth details, family.",
    "Ratan Singh Bhangu (1914). *Prachin Panth Prakash* – Military exploits.",
    "Giani Gian Singh (1970). *Panth Prakash* [Reprint]. Patiala – Martyrdom account.",
    "Giani Thakar Singh (1904). *Shahid Bilas Baba Dip Singh Ji*. Amritsar – Quotes and final battle.",
    "Joseph Davey Cunningham (1849). *A History of the Sikhs*. London – Broader context (citationNeeded for specific Durrani raid details).",
    "Research_For_Personality tool: Google Custom Search results confirming identity and key events."
  ]
}
