{
  "already_exist": false,
  "name": "Baba Gurditta",
  "slug": "baba-gurditta",
  "category": "Guru Family",
  "birth": "1613-11-05",
  "death": "1638-03-15",
  "birthPlace": "Daroli Bhai, Firozpur District, Punjab, India",
  "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Painting_of_Baba_Gurditta%2C_the_eldest_son_of_the_sixth_Sikh_guru%2C_Guru_Hargobind%2C_and_second_leader_of_the_Udasi_sect_succeeding_Sri_Chand%2C_ca.1685.jpg/250px-Painting_of_Baba_Gurditta%2C_the_eldest_son_of_the_sixth_Sikh_guru%2C_Guru_Hargobind%2C_and_second_leader_of_the_Udasi_sect_succeeding_Sri_Chand%2C_ca.1685.jpg",
  "excerpt": "Eldest son of Guru Hargobind, father of Guru Har Rai, and appointed successor to Baba Sri Chand as head of the Udasi sect, Baba Gurditta played a pivotal role in expanding Sikh missionary efforts during a period of growing Mughal-Sikh tensions.",
  "designation": "Head of the Udasi Missionary Order",
  "quickStats": [
    {
      "label": "Lifespan",
      "value": "24 years"
    },
    {
      "label": "Key Role",
      "value": "Spiritual leader and founder of Kiratpur Sahib"
    },
    {
      "label": "Family Line",
      "value": "Linked to the seventh Sikh Guru (Har Rai)"
    }
  ],
  "quickFacts": [
    {
      "label": "Early Traits",
      "value": "Resembled Guru Nanak in appearance and piety from youth"
    },
    {
      "label": "Marital and Foundational Role",
      "value": "Married at age 8; founded major Sikh center in Shivalik foothills"
    },
    {
      "label": "Military Involvement",
      "value": "Participated in defensive battles against Mughal forces"
    }
  ],
  "version": {
    "lastUpdated": "2024-09-21",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Baba Gurditta was born on November 5, 1613 (or October 13, 1608, per some sources like Bhatt Vahis), in the forested village of Daroli Bhai in Punjab's Malwa region, to Guru Hargobind and Mata Damodari. His birth was celebrated with the distribution of sacred prasad, and contemporary records note it as an auspicious event. From a young age, he exhibited qualities reminiscent of Guru Nanak, earning him the name \"Gurditta\" (meaning \"Guru-given form\"). Trained in religious lore, martial arts, and Sikh principles under his father's guidance, Gurditta was engaged at age six in 1619 to Ananti (later Mata Nihal Kaur), daughter of Bhai Rama from Batala. Their marriage on April 17, 1621, was a grand affair, with Guru Hargobind gifting him a horse valued at 100,000 rupees. During 1626–1627, he resided in Kartarpur (Jalandhar district) on his father's directive, honing leadership skills amid rising Mughal hostilities."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "Following commands from Guru Hargobind, Baba Gurditta founded the township of Kiratpur Sahib around 1630 in the Shivalik foothills, which became a key Sikh center for spiritual and martial training. Appointed by the aging Baba Sri Chand (Guru Nanak's son) as successor to lead the Udasi sect circa 1629, he invigorated its missionary work by establishing four preaching centers (dhūāṅs). These efforts expanded Udasi outreach, blending asceticism with Sikh teachings to propagate across Punjab and beyond. He also commanded Sikh forces in the Battle of Kartarpur (1635) against Mughal-backed Painda Khan, where he slew his childhood friend Asman Khan in combat, demonstrating valor while mourning the loss."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "N/A (Baba Gurditta focused on organizational expansion rather than doctrinal reforms; his leadership emphasized missionary propagation and integration of Udasi practices with emerging Khalsa ideals)."
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "No direct compositions are attributed to him in primary sources like the Guru Granth Sahib. However, as a spiritual figure, he is referenced in janamsakhis and hagiographies such as Gurbilas Patshahi 6, which record his teachings on humility and devotion."
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "In his later years, Baba Gurditta balanced spiritual duties with military involvement. Post the 1635 battle, he rested under a sacred banyan tree in Kartarpur (still revered today). On March 15, 1638, during a hunt near Kiratpur, he reluctantly performed a miracle by reviving a cow mistaken for a deer, drawing admonishment from Guru Hargobind for defying Sikh emphasis on natural humility. Deeply remorseful, he secluded himself outside Kiratpur near Pir Budhan Shah's shrine and passed away the same day at age 24. His death profoundly affected the Sikh community, with Guru Hargobind mourning deeply. An alternate tradition links his passing to a rejected marriage proposal, but primary accounts emphasize spiritual introspection."
    }
  ],
  "spiritualLegacy": {
    "description": "Baba Gurditta's legacy lies in bridging the Guru's lineage with the Udasi tradition, fostering a network of missionary centers that sustained Sikh outreach during persecution. His life exemplified miri-piri (temporal-spiritual balance), influencing the panth's resilience.",
    "keyContributions": [
      "Established four Udasi dhūāṅs for preaching, enhancing sectarian vitality [Wikipedia, SikhiWiki].",
      "Founded Kiratpur Sahib, a enduring hub for Sikh scholarship and assembly [citationNeeded for exact founding date].",
      "Succeeded Baba Sri Chand, ensuring Udasi's continuity as a reformist Sikh offshoot."
    ]
  },
  "modernRelevance": {
    "description": "Today, Baba Gurditta is venerated as a saintly figure in Sikh history, with Gurdwara Baba Gurditta in Kiratpur Sahib drawing pilgrims. His story underscores themes of obedience, miracle restraint, and family devotion in contemporary Sikh discourse.",
    "contemporaryImpact": [
      "Inspires Udasi adherents and Sikhs in interfaith missionary work globally.",
      "Featured in historical reenactments and museums, highlighting Sikh martial-spiritual heritage [e.g., depictions in Dehradun's Ram Rai lineage].",
      "Influences discussions on Sikh succession and the role of non-Guru family members in panthic leadership."
    ]
  },
  "achievements": [
    {
      "title": "Successor to Udasi Head",
      "year": "~1629",
      "description": "Appointed by Baba Sri Chand to lead the Udasi sect, revitalizing its missionary framework.",
      "icon": "🕉️"
    },
    {
      "title": "Founder of Kiratpur Sahib",
      "year": "~1630",
      "description": "Established a major Sikh center in Shivalik Hills, serving as a base for Guru Hargobind's court.",
      "icon": "🏰"
    },
    {
      "title": "Victor in Battle of Kartarpur",
      "year": "1635",
      "description": "Led defenses against Mughal forces, slaying Asman Khan despite personal ties [SikhiWiki].",
      "icon": "⚔️"
    },
    {
      "title": "Establishment of Udasi Dhūāṅs",
      "year": "1630s",
      "description": "Founded four preaching centers, expanding Udasi influence across Punjab [Wikipedia].",
      "icon": "📜"
    }
  ],
  "quotes": [
    {
      "original": "N/A (No direct Gurbani shabads; attributed sayings in hagiographies)",
      "transliteration": "N/A",
      "translation": "\"To kill a friend in battle is no victory, but a sorrow born of duty.\" (Attributed in Gurbilas Patshahi 6, post-Battle of Kartarpur)",
      "context": "Reflects his humanism during the 1635 skirmish with childhood friend Asman Khan.",
      "source": "Gurbilas Patshahi 6 [SikhiWiki; citationNeeded for verbatim Punjabi]."
    }
  ],
  "timeline": [
    {
      "year": "1613",
      "date": "1613-11-05",
      "event": "Born in Daroli Bhai to Guru Hargobind and Mata Damodari.",
      "type": "Birth"
    },
    {
      "year": "1619",
      "date": "October",
      "event": "Engaged to Ananti (Mata Nihal Kaur) at age six.",
      "type": "Personal"
    },
    {
      "year": "1621",
      "date": "1621-04-17",
      "event": "Married Ananti; grand celebration with gifts from Guru Hargobind.",
      "type": "Personal"
    },
    {
      "year": "1626",
      "date": "",
      "event": "Resided in Kartarpur (Jalandhar) under father's directive.",
      "type": "Relocation"
    },
    {
      "year": "1629",
      "date": "",
      "event": "Appointed head of Udasi sect by Baba Sri Chand.",
      "type": "Spiritual"
    },
    {
      "year": "1630",
      "date": "",
      "event": "Founded Kiratpur Sahib in Shivalik foothills.",
      "type": "Founding"
    },
    {
      "year": "1635",
      "date": "",
      "event": "Fought in Battle of Kartarpur; slew Asman Khan.",
      "type": "Military"
    },
    {
      "year": "1638",
      "date": "1638-03-15",
      "event": "Performed cow revival miracle; secluded and died near Kiratpur.",
      "type": "Death"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Hargobind",
      "relation": "Father",
      "slug": "guru-hargobind"
    },
    {
      "name": "Mata Damodari",
      "relation": "Mother",
      "slug": "mata-damodari"
    },
    {
      "name": "Mata Nihal Kaur",
      "relation": "Spouse",
      "slug": "mata-nihal-kaur"
    },
    {
      "name": "Guru Har Rai",
      "relation": "Son",
      "slug": "guru-har-rai"
    },
    {
      "name": "Dhir Mall",
      "relation": "Son",
      "slug": "dhir-mall"
    },
    {
      "name": "Baba Sri Chand",
      "relation": "Mentor/Successor Predecessor",
      "slug": "sri-chand"
    },
    {
      "name": "Guru Tegh Bahadur",
      "relation": "Brother",
      "slug": "guru-tegh-bahadur"
    }
  ],
  "historicalContext": {
    "period": "Early 17th century, during Guru Hargobind's era (1606–1644), marked by the Sikh transition to miri-piri (worldly and spiritual authority) amid Mughal emperor Jahangir's and Shah Jahan's policies of persecution.",
    "politicalSituation": "Sikhs faced escalating Mughal oppression; Guru Hargobind's 52 princes imprisonment (1617–1619) and battles like Amritsar (1628) and Lahira (1634) highlighted the need for militarized resistance. Baba Gurditta's actions aligned with this defensive posture.",
    "socialConditions": "Punjab's Malwa region was agrarian and forested, fostering ascetic Udasi traditions. Interfaith dynamics with Mughals strained communities, while Sikh family structures emphasized education in warfare and scripture.",
    "significance": "As a bridge between Sodhi lineage and Udasi sect, his life reinforced Sikh adaptability, contributing to the panth's survival and expansion before the Khalsa formalization in 1699 [cross-verified: Wikipedia, SikhiWiki]."
  },
  "references": [
    "Wikipedia: \"Baba Gurditta\" (accessed 2024-09-21) – Primary structured biography with citations.",
    "SikhiWiki: \"Baba Gurditta\" (https://www.sikhiwiki.org/index.php/Baba_Gurditta) – Detailed hagiography, family tree, and battle accounts [verified via HTML extraction].",
    "Singh, Pashaura (2024). *The Routledge Companion to the Life and Legacy of Guru Hargobind*. Taylor & Francis. ISBN 9781040106327 – Birth and early life details.",
    "Johar, Surinder Singh (1975). *Guru Tegh Bahadur: A Bibliography*. Abhinav Publications. ISBN 9788170170303 – Death legend and family context.",
    "Harbans Singh (1992–1998). *The Encyclopaedia of Sikhism*, Vol. 2. Punjabi University. ISBN 0-8364-2883-8 – Udasi leadership and Kiratpur founding.",
    "Gurbilas Patshahi 6 (17th-century janamsakhi) – Quotes and battle narratives [SikhiWiki; partial citationNeeded for full text access].",
    "Unverified: Specific founding date of dhūāṅs (circa 1630s, per secondary sources)."
  ]
}
