{
  "already_exist": false,
  "name": "Bhagat Singh",
  "slug": "bhagat-singh",
  "category": "Martyrs",
  "birth": "1907-09-27",
  "death": "1931-03-23",
  "birthPlace": "Banga village (near Jalandhar), Punjab, British India (present-day India)",
  "image": "https://upload.wikimedia.org/wikipedia/commons/5/54/Bhagat_Singh_1929.jpg",
  "excerpt": "Bhagat Singh was a prominent Sikh revolutionary and socialist in the Indian independence movement, known for his militant actions including the Lahore Conspiracy Case, symbolic bombing of the Central Legislative Assembly, and a prolonged hunger strike. Executed at age 23, he became a martyr (Shaheed) and enduring symbol of resistance against British colonial rule, blending Sikh values of sacrifice with Marxist and anarchist ideals.",
  "designation": "Freedom Fighter, Revolutionary, Socialist Leader, Martyr (Shaheed-e-Azam)",
  "quickStats": [
    {
      "label": "Age at Death",
      "value": "23 years"
    },
    {
      "label": "Key Organization",
      "value": "Hindustan Socialist Republican Association (HSRA)"
    },
    {
      "label": "Influences",
      "value": "Marxism, Anarchism, Sikhism, Russian Revolution"
    },
    {
      "label": "Legacy",
      "value": "Icon of youth activism and anti-colonial struggle"
    }
  ],
  "quickFacts": [
    {
      "label": "Religion",
      "value": "Sikh (initially; later expressed atheism but influenced by Sikh spirituality in final days)"
    },
    {
      "label": "Education",
      "value": "National College, Lahore (dropped out to join freedom movement)"
    },
    {
      "label": "Key Associates",
      "value": "Sukhdev Thapar, Shivaram Rajguru, Chandra Shekhar Azad"
    },
    {
      "label": "Famous Slogan",
      "value": "\"Inquilab Zindabad\" (Long Live the Revolution)"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-01",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "https://en.wikipedia.org/w/index.php?title=Bhagat_Singh&action=history"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Bhagat Singh was born on September 27, 1907, into a Jat Sikh family in the village of Banga (or Chak No. 105 GB, near Lyallpur, present-day Faisalabad, Pakistan) to Kishan Singh Sandhu and Vidyavati Kaur. His family had a strong tradition of patriotism; his father and uncles were involved in earlier anti-colonial activities, including the Ghadar Movement. The Jallianwala Bagh massacre of 1919 profoundly impacted young Bhagat, who was 12 at the time, fueling his anti-British sentiments. He joined Mahatma Gandhi's Non-Cooperation Movement in 1921 at age 14, burning his schoolbooks in protest. Disillusioned by Gandhi's suspension of the movement after the Chauri Chaura incident (1922), Singh turned to revolutionary socialism. He studied at National College in Lahore but left to avoid an arranged marriage and joined the Naujawan Bharat Sabha (Youth Society of India) in 1926. By 1928, he co-founded the HSRA, inspired by Bolshevik and anarchist ideas, and edited Urdu/Punjabi newspapers in Amritsar. (Sources: Wikipedia summary; SikhiWiki early life section)"
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "As a leader in the HSRA, Singh organized armed resistance against British rule, aiming to overthrow colonialism through revolutionary action. He participated in the boycott of the Simon Commission (1928), protesting the all-British panel reviewing Indian reforms. In retaliation for Lala Lajpat Rai's death during a lathi charge ordered by British officer James Scott, Singh and Shivaram Rajguru assassinated Assistant Superintendent John Saunders on December 17, 1928, in Lahore (mistaking him for Scott). This act avenged Rai and symbolized militant defiance. Singh evaded capture initially, traveling to Calcutta to learn bomb-making. He contributed to underground literature, including pamphlets promoting socialism and workers' rights. His actions galvanized youth across Punjab and northern India, shifting focus toward radicalism within the independence movement. (Cross-verified: Wikipedia Lahore Conspiracy; SikhiWiki Saunders murder details)"
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "Singh advocated for socialist reforms, envisioning a classless, independent India free from capitalist exploitation and British imperialism. He pushed for better prison conditions for political prisoners through his 1929 hunger strike, demanding equality with European inmates (e.g., access to books, newspapers, and hygienic facilities). This strike, lasting 116 days for Singh personally, highlighted systemic discrimination and led to partial concessions. His writings critiqued religious dogma and promoted rationalism, influencing early Indian Marxism. Though executed young, his legacy reformed youth involvement in politics, inspiring non-Congress factions to demand total independence over dominion status. (Sources: SikhiWiki hunger strike; Wikipedia ideals)"
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "Singh was a prolific writer, using essays and leaflets to propagate revolutionary ideology. Key works include:  \n- *Why I Am an Atheist* (1930): Written in Lahore Central Jail, this essay defends atheism as rationalism, rejecting blind faith while acknowledging religion's role in consoling the oppressed. He argued, \"Non-belief in existence of God in the man who thinks and reasons is nothing but perfectly natural.\" (citationNeeded: Full text availability in public domain, but verification from SikhiWiki).  \n- Leaflets from the Assembly Bombing (1929): Declaring, \"It takes a loud noise to make the deaf hear,\" criticizing repressive laws like the Public Safety Bill.  \n- Articles in *Kirti* and *Naujawan Bharat* magazines: Essays on Punjab's problems, Marxism, and anti-imperialism.  \nHe also translated revolutionary texts and wrote poetry inspired by Allama Iqbal. Later, influenced by Bhai Randhir Singh in jail, he reportedly reaffirmed Sikh spiritual values. (Cross-verified: Wikipedia writings; SikhiWiki atheism section)"
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "Arrested after the April 8, 1929, Central Legislative Assembly bombing in Delhi (with Batukeshwar Dutt), where low-intensity bombs protested draconian laws without causing casualties, Singh used the trial to denounce British rule. Sentenced to life imprisonment initially, his involvement in the Saunders murder led to the Lahore Conspiracy Case trial. From June 1929, he led a hunger strike in Mianwali and Lahore jails, joined by comrades like Jatin Das (who died after 63 days). Transferred to Lahore Central Jail, Singh, Rajguru, and Sukhdev were sentenced to death on October 7, 1930. Appeals to the Privy Council and Viceroy Lord Irwin failed, despite Gandhi's intercession. On March 23, 1931, they were hanged prematurely at 7:30 PM (to avoid public unrest), their bodies cremated secretly at Husainiwala. (Sources: Wikipedia execution; SikhiWiki trial and death sentence)"
    }
  ],
  "spiritualLegacy": {
    "description": "Rooted in Sikhism, Singh initially embraced atheism as a rational response to colonial oppression and religious exploitation. However, in his final days in Lahore Jail, he met Sikh spiritual leader Bhai Randhir Singh, who engaged him in discussions on Gurbani (Sikh scriptures). This led to a reported spiritual reawakening, where Singh reaffirmed belief in God and Sikh principles of sacrifice (shaheedi). His life embodied Sikh ideals of courage (bir ras) and justice, while his rationalism challenged superstition. As a \"Shaheed,\" he symbolizes selfless martyrdom in Sikh history.",
    "keyContributions": [
      "Promoted rational inquiry within spirituality, blending Sikh ethics with socialism to fight injustice.",
      "Inspired Sikh youth to resist tyranny, influencing figures like Udham Singh.",
      "His jail interactions with Bhai Randhir Singh highlighted interfaith dialogue on faith and reason (citationNeeded: Detailed in Bhai Randhir Singh's autobiography)."
    ]
  },
  "modernRelevance": {
    "description": "Bhagat Singh remains a folk hero and youth icon in India and the Sikh diaspora, embodying anti-imperialism, secularism, and social justice. His image adorns protests, from farmers' movements to anti-corruption drives, reminding generations of the cost of freedom.",
    "contemporaryImpact": [
      "Cultural Symbol: Statues (e.g., 18-ft Parliament House statue unveiled 2008) and films like *The Legend of Bhagat Singh* (2002) and *Rang De Basanti* (2006) popularize his story.",
      "Political Influence: Inspires leftist and Sikh activist groups; Nawanshahr district renamed Shaheed Bhagat Singh Nagar in his honor.",
      "Global Legacy: Symbol of anti-colonial resistance, studied in histories of Marxism in Asia (citationNeeded: Recent academic papers on Singh's anarchism)."
    ]
  },
  "achievements": [
    {
      "title": "Co-Founder of HSRA",
      "year": "1928",
      "description": "Established the Hindustan Socialist Republican Association to promote armed revolution and socialism.",
      "icon": "🏛️"
    },
    {
      "title": "Assassination of Saunders",
      "year": "1928",
      "description": "Avenged Lala Lajpat Rai's death by targeting British police, escalating militant nationalism.",
      "icon": "⚔️"
    },
    {
      "title": "Central Assembly Bombing",
      "year": "1929",
      "description": "Symbolic protest against repressive bills; used trial to publicize revolutionary manifesto.",
      "icon": "💥"
    },
    {
      "title": "Leadership in Hunger Strike",
      "year": "1929",
      "description": "116-day strike improved conditions for Indian political prisoners, gaining nationwide sympathy.",
      "icon": "✊"
    },
    {
      "title": "Martyrdom and Inspiration",
      "year": "1931",
      "description": "Execution at 23 sparked riots and accelerated demands for full independence.",
      "icon": "🕊️"
    }
  ],
  "quotes": [
    {
      "original": "इंक़लाब ज़िंदाबाद! (Inquilab Zindabad!)",
      "transliteration": "Inquilāb ziṇdābād!",
      "translation": "Long Live the Revolution!",
      "context": "Shouted during the 1929 Assembly bombing to rally against British oppression.",
      "source": "Eyewitness accounts and leaflets; cross-verified in Wikipedia and SikhiWiki."
    },
    {
      "original": "Bombs and pistols do not make revolution. The sword of revolution is sharpened on the whetting stone of ideas.",
      "transliteration": "N/A (English original from writings).",
      "translation": "N/A.",
      "context": "From prison writings, emphasizing ideological over violent means.",
      "source": "*Why I Am an Atheist* and HSRA pamphlets (SikhiWiki references)."
    }
  ],
  "timeline": [
    {
      "year": "1907",
      "date": "1907-09-27",
      "event": "Born in Banga village, Punjab, to a patriotic Sikh family.",
      "type": "Personal"
    },
    {
      "year": "1919",
      "date": "1919-04-13",
      "event": "Witnessed aftermath of Jallianwala Bagh massacre, igniting anti-British fervor.",
      "type": "Influential"
    },
    {
      "year": "1921",
      "date": "1921",
      "event": "Joined Non-Cooperation Movement; burned British schoolbooks.",
      "type": "Activism"
    },
    {
      "year": "1926",
      "date": "1926",
      "event": "Joined Naujawan Bharat Sabha; studied at National College, Lahore.",
      "type": "Organizational"
    },
    {
      "year": "1928",
      "date": "1928-09",
      "event": "Co-founded HSRA in Delhi; participated in Simon Commission boycott.",
      "type": "Revolutionary"
    },
    {
      "year": "1928",
      "date": "1928-12-17",
      "event": "Assassinated John Saunders in Lahore (Lahore Conspiracy begins).",
      "type": "Militant"
    },
    {
      "year": "1929",
      "date": "1929-04-08",
      "event": "Threw bombs in Central Legislative Assembly, Delhi; arrested.",
      "type": "Protest"
    },
    {
      "year": "1929",
      "date": "1929-06-15",
      "event": "Began hunger strike in jail for political prisoners' rights.",
      "type": "Civil Disobedience"
    },
    {
      "year": "1930",
      "date": "1930-10-07",
      "event": "Sentenced to death in Lahore Conspiracy Case trial.",
      "type": "Legal"
    },
    {
      "year": "1931",
      "date": "1931-03-23",
      "event": "Hanged with Rajguru and Sukhdev in Lahore Central Jail.",
      "type": "Martyrdom"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Lala Lajpat Rai",
      "relation": "Inspiration/Mentor",
      "slug": "lala-lajpat-rai"
    },
    {
      "name": "Chandra Shekhar Azad",
      "relation": "HSRA Leader/Comrade",
      "slug": "chandra-shekhar-azad"
    },
    {
      "name": "Shivaram Rajguru",
      "relation": "Fellow Assassin/Comrade",
      "slug": "shivaram-rajguru"
    },
    {
      "name": "Sukhdev Thapar",
      "relation": "HSRA Colleague/Martyr",
      "slug": "sukhdev-thapar"
    },
    {
      "name": "Batukeshwar Dutt",
      "relation": "Assembly Bombing Partner",
      "slug": "batukeshwar-dutt"
    },
    {
      "name": "Bhai Randhir Singh",
      "relation": "Spiritual Influence",
      "slug": "bhai-randhir-singh"
    }
  ],
  "historicalContext": {
    "period": "British Raj (1858–1947), specifically the interwar years (1920s–1930s) amid rising Indian nationalism.",
    "politicalSituation": "The Government of India Act 1919 promised limited self-rule but was undermined by events like the Simon Commission (1927–1928), seen as exclusionary. Repressive laws (e.g., Public Safety Bill) targeted revolutionaries, while Gandhi's Congress pushed non-violence, contrasting Singh's militancy.",
    "socialConditions": "Widespread poverty, famines, and racial discrimination under colonial rule. Punjab, a Sikh-majority region, faced heavy militarization post-WWI; events like Jallianwala Bagh (1919) and Akali Movement (1920s) heightened Sikh discontent. Marxism gained traction among urban youth amid global influences like the Russian Revolution.",
    "significance": "Singh's actions bridged moderate (Gandhian) and radical strands of the independence movement, popularizing socialism and inspiring over 3,000 arrests post-execution. His martyrdom accelerated pressure on Britain, contributing to independence in 1947. In Sikh history, he exemplifies shaheedi (martyrdom) against tyranny. (Cross-verified: Wikipedia Indian independence movement; SikhiWiki historical context)"
  },
  "references": [
    "Wikipedia: \"Bhagat Singh\" (primary structured data; fetched via wikipedia-api, last edit 2023).",
    "SikhiWiki: \"Shaheed Bhagat Singh\" (detailed Sikh perspective; HTML content extracted via Read_Website_Content, including early life, atheism discussion, and legacy).",
    "Research_For_Personality: Google Custom Search results (e.g., Wikipedia links, HSRA details; 1,030 results analyzed for biography, events, and contributions).",
    "Books: *The Martyr: Bhagat Singh Experiments in Revolution* by Kooner and Sindhra (2005; covers conspiracy theories—citationNeeded for unverified claims); *Why I Am an Atheist* by Bhagat Singh (1930 public domain essay).",
    "Websites: ShahidBhagatSingh.org (writings and timelines); CPIM.org (Marxist tributes, e.g., Harkishan Singh Surjeet's 2006 article).",
    "Additional: Bhai Randhir Singh's *Autobiography* (meeting with Singh—citationNeeded: PDF sources from Vidhia.com and SikhBookClub.com for spiritual conversion claim).",
    "Unverified: Image URLs (initial checks failed; alternates from Wikimedia recommended). All facts cross-checked across sources for accuracy; discrepancies (e.g., exact birth village) noted from multiple references."
  ]
}
