{
  "already_exist": false,
  "name": "Bhagat Kabir (also known as Kabir Das)",
  "slug": "bhagat-kabir",
  "category": "Scholars",
  "birth": "1440-01-01",
  "death": "1518-01-01",
  "birthPlace": "Varanasi (Kashi), Uttar Pradesh, India",
  "image": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Kabir004.jpg",
  "excerpt": "Bhagat Kabir was a 15th-century Indian mystic poet-saint whose devotional verses, emphasizing monotheism and social equality, are enshrined in the Guru Granth Sahib. Revered across Hinduism, Sikhism, and Sufism, he critiqued ritualism and caste divisions during the Bhakti movement.",
  "designation": "Poet-Saint (Bhagat), Social Reformer",
  "quickStats": [
    {
      "label": "Verses in Guru Granth Sahib",
      "value": "541 Shabads + 237 Slokas"
    },
    {
      "label": "Primary Language",
      "value": "Sadhukkadi (blend of Hindi dialects like Awadhi, Bhojpuri)"
    },
    {
      "label": "Followers",
      "value": "Kabir Panth (estimated millions today)"
    },
    {
      "label": "Influence",
      "value": "Bhakti Movement, Sikh Scripture, Sufi Traditions"
    }
  ],
  "quickFacts": [
    {
      "label": "Occupation",
      "value": "Weaver (Julaha)"
    },
    {
      "label": "Key Themes",
      "value": "Unity of God, Rejection of Idolatry, Anti-Caste Advocacy"
    },
    {
      "label": "Disciples",
      "value": "Includes contemporaries like Ravidas and Pipa"
    },
    {
      "label": "Legacy Sect",
      "value": "Kabir Panth, founded on his teachings of nirguna bhakti (devotion to formless God)"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-01",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Kabir's birth and early years are shrouded in legend and scholarly debate. Commonly dated to around 1440 CE in Varanasi (Kashi), Uttar Pradesh, he was reportedly found as an infant on a lotus flower in Lahartara Pond by a Muslim weaver named Niru and his wife Nima, who adopted and raised him as their own [SikhiWiki; Wikipedia]. Some traditions claim a divine incarnation at Brahmamuhurta on the full moon of Jyeshtha month (Vikram Samvat 1455). Born into a low-caste Julaha (weaver) family, Kabir grew up in the Kabir Chaura locality of Varanasi, a center of Brahmanical orthodoxy in 15th-century India. As a youth, he apprenticed in weaving and became a disciple of the Vaishnava saint Ramananda around the early 1460s, receiving initiation through a clever ruse at the Panchganga Ghat. Kabir's upbringing blended Hindu and Muslim influences, fostering his syncretic worldview. He married Loi (or Mata Loi) and had two children: a son, Kamal, and a daughter, Kamali. Early life was marked by poverty and social marginalization, yet Kabir pursued spiritual inquiry amidst Varanasi's religious fervor [Wikipedia; Research Summary]."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "Kabir's primary contributions were through his poetry and teachings, which bridged religious divides and challenged societal norms. He composed thousands of verses (banis) orally, disseminated by disciples, critiquing hypocrisy in both Hinduism and Islam. As a wandering saint (sant), he gathered followers from diverse castes, including prostitutes and laborers, promoting egalitarian devotion. His inclusion of 778 compositions in the Guru Granth Sahib (compiled 1604 CE) underscores his influence on Sikhism, where he is honored as a Bhagat. Kabir founded the Kabir Panth, a sect emphasizing inner spirituality over rituals. He traveled extensively, preaching in Varanasi, Maghar, and surrounding regions, enduring persecution from orthodox leaders under Sultan Sikandar Lodi (r. 1489–1517). His service extended to social reform, advocating women's rights and interfaith harmony during a time of religious tension [SikhiWiki; Wikipedia]."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "- **Rejection of Ritualism and Idolatry:** Kabir denounced Hindu idol worship, caste hierarchies, and Muslim ritual prayers as \"empty shells,\" urging direct communion with the formless God (Nirguna Brahm).  \n- **Anti-Caste Advocacy:** Born low-caste, he proclaimed spiritual equality, famously stating, \"If by washing your clothes, you are saved, then save your clothes and wash your heart.\"  \n- **Monotheism and Syncretism:** Promoted a universal God beyond Hindu-Muslim binaries, influencing Bhakti saints like Ravidas and Nanak.  \n- **Gender Equality:** Encouraged women's participation in spiritual life, challenging patriarchal norms [Cross-verified: Research Summary; Gurbani quotes in SikhiWiki]."
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "Kabir's works were primarily oral, later compiled by followers. Key collections include:  \n- **Bijak:** The primary scripture of Kabir Panth, containing sakhis (couplets), ramainis (poems), and sabdas (hymns) in Sadhukkadi dialect; focuses on mysticism and critique of orthodoxy.  \n- **Kabir Granthavali:** A compilation of 500+ verses emphasizing devotion.  \n- **Anurag Sagar:** Alleged oceanic discourse on creation and salvation (authenticity debated).  \n- **Verses in Guru Granth Sahib:** 541 shabads across 17 ragas (e.g., Gauri, Prabhati) and 237 slokas, covering themes like maya (illusion), naam (divine name), and death. Examples appear on pages 91–92, 323–330, 1103–1106, etc. [SikhiWiki; Wikipedia]. His language blended Awadhi, Bhojpuri, and Persian, making it accessible to the masses."
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "In his later years, Kabir relocated to Maghar (near Gorakhpur), a town considered cursed in folklore (believed to doom souls to hell). This move symbolized his rejection of superstition—he quipped in verse that if Maghar led to damnation, Varanasi would lead to heaven, and vice versa. Gurbani verses indicate he \"wasted\" his youth in Varanasi's fruitless rituals but found true enlightenment (Gurmat) in Maghar's saintly company. Persecuted by Sikandar Lodi, he faced trials by fire, water, and elephant trampling but emerged unscathed. Kabir passed away in 1518 CE in Maghar, where Hindus and Muslims vied for his funeral rites. A samadhi and mazar coexist at his memorial, reflecting his unifying legacy [SikhiWiki; Research Summary]."
    }
  ],
  "spiritualLegacy": {
    "description": "Kabir's legacy is a profound syncretic spirituality, blending Bhakti, Sufi, and proto-Sikh elements. He taught that God resides within all, accessible through meditation on the Name (Naam Simran) and ethical living, transcending religious boundaries. His emphasis on \"Sahaj\" (natural state) influenced the Sant tradition, promoting passive detachment from worldly ego.",
    "keyContributions": [
      "Universal devotion to the formless Divine, critiquing anthropomorphic worship.",
      "Social egalitarianism, eroding caste barriers and inspiring later reformers like Guru Nanak.",
      "Poetic innovation: Simple, vernacular dohas (couplets) that democratized spiritual wisdom.",
      "Interfaith bridge: Verses adopted in Sikhism (GGS), Hinduism (Kabir Panth), and Sufism [Wikipedia]."
    ]
  },
  "modernRelevance": {
    "description": "In contemporary India and the diaspora, Kabir symbolizes resistance to religious extremism and social inequality. His poetry is recited in kirtans, studied in universities, and adapted in literature/film (e.g., \"Kabir Khada Bazaar Mein\" in Bollywood). The Kabir Panth, with over 9 million adherents, continues his traditions through festivals like Kabir Jayanti.",
    "contemporaryImpact": [
      "Inspiration for social movements: Dalit and feminist activists draw on his anti-caste ethos.",
      "Interfaith dialogue: Promoted in peace initiatives amid Hindu-Muslim tensions.",
      "Literary revival: Translations by Rabindranath Tagore and modern poets keep his dohas alive globally.",
      "Environmental/simplistic living: Echoes in sustainability movements rejecting materialism [Research Summary]."
    ]
  },
  "achievements": [
    {
      "title": "Disciple of Ramananda",
      "year": "~1460s",
      "description": "Initiated into Vaishnava Bhakti, laying foundation for his teachings (citation needed: exact date debated).",
      "icon": "🕉️"
    },
    {
      "title": "Composition of Bijak",
      "year": "Late 1400s",
      "description": "Core text of Kabir Panth, compiling early verses on mysticism.",
      "icon": "📜"
    },
    {
      "title": "Inclusion in Guru Granth Sahib",
      "year": "1604 CE",
      "description": "778 compositions enshrined, affirming eternal Guru status in Sikhism [SikhiWiki].",
      "icon": "📖"
    },
    {
      "title": "Founding of Kabir Panth",
      "year": "Post-1518",
      "description": "Sect established by disciple Dharamdas, perpetuating his nirguna bhakti path.",
      "icon": "🛐"
    },
    {
      "title": "Recognition as National Poet-Saint",
      "year": "Modern",
      "description": "Honored in Indian curriculum; UNESCO-listed cultural heritage influence.",
      "icon": "🇮🇳"
    }
  ],
  "quotes": [
    {
      "original": "कबीरा खड़ा बाज़ार में, मांगे सबकी खैर।  \nना काहू से दोस्ती, ना काहू से बैर।  \n(Kabir stands in the market, seeking welfare of all. Neither friendship with anyone, nor enmity.)",
      "transliteration": "Kabīrā khadā bājāra mẽṁ, māṅgē sabkī khair।  \nNā kāhū sē dōstī, nā kāhū sē bēra।",
      "translation": "Kabir stands in the marketplace, praying for everyone's well-being. He is neither a friend to anyone nor an enemy.",
      "context": "From Kabir Granthavali; emphasizes universal compassion and detachment from bias, critiquing religious divisions.",
      "source": "Kabir Granthavali [Wikipedia; Research Summary]. Similar sentiments in GGS Slok 1 (p. 1364): \"ਪੋਥੀ ਪੜਿ ਪੜਿ ਪੰਡਿਤ ਭਏ ਨਾ ਕੋਇ । ਢਾਈ ਆਖਰ ਪ੍ਰੇਮ ਕੇ ਚੀਨਹਿ ਰੇ ਪੰਡਿਤਾ ॥\" (Reading scriptures doesn't make one a pandit; recognize love in two-and-a-half letters)."
    }
  ],
  "timeline": [
    {
      "year": "1440",
      "date": "N/A",
      "event": "Birth in Varanasi; adopted by Niru and Nima [SikhiWiki].",
      "type": "Birth"
    },
    {
      "year": "1460",
      "date": "N/A",
      "event": "Becomes disciple of Ramananda at Panchganga Ghat.",
      "type": "Spiritual Initiation"
    },
    {
      "year": "1490",
      "date": "N/A",
      "event": "Composes early verses; faces persecution from Sultan Sikandar Lodi.",
      "type": "Persecution & Writing"
    },
    {
      "year": "1500",
      "date": "N/A",
      "event": "Moves to Maghar; attains \"Gurmat\" enlightenment (per Gurbani).",
      "type": "Relocation & Realization"
    },
    {
      "year": "1518",
      "date": "N/A",
      "event": "Death in Maghar; memorials built by Hindus and Muslims.",
      "type": "Death"
    },
    {
      "year": "1604",
      "date": "N/A",
      "event": "Compositions included in Guru Granth Sahib by Guru Arjan Dev.",
      "type": "Legacy"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Ramananda",
      "relation": "Guru (Spiritual Teacher)",
      "slug": "ramananda"
    },
    {
      "name": "Ravidas",
      "relation": "Contemporary Disciple/Fellow Bhagat",
      "slug": "bhagat-ravidas"
    },
    {
      "name": "Guru Nanak",
      "relation": "Influenced By (Shared Teachings)",
      "slug": "guru-nanak"
    },
    {
      "name": "Dharamdas",
      "relation": "Key Disciple & Compiler of Bijak",
      "slug": "dharamdas"
    }
  ],
  "historicalContext": {
    "period": "15th Century (Vijayanagara-Mughal Transition).",
    "politicalSituation": "Northern India under Delhi Sultanate (Lodi Dynasty); Sikandar Lodi's rule (1489–1517) saw orthodox Islamic policies clashing with Bhakti movements. Varanasi was a Hindu stronghold invaded by Timur (1398), fostering syncretic responses.",
    "socialConditions": "Rigid caste system dominated Brahmanical society; Bhakti movement rose as a populist counter to Vedic ritualism. Low-castes like Julahas faced discrimination; interfaith tensions from Sufi-Hindu interactions. Women and untouchables marginalized.",
    "significance": "Kabir's critiques accelerated Bhakti's spread, influencing Sikhism's formation (1469 onward) and proto-reformism. His work addressed urban poverty and religious hypocrisy in a pre-colonial melting pot [Wikipedia; Research Summary]."
  },
  "references": [
    "Wikipedia: \"Kabir\" (en.wikipedia.org/wiki/Kabir) – Primary biographical and poetic details; cross-verified dates and legacy.",
    "SikhiWiki: \"Bhagat Kabir\" (sikhiwiki.org/index.php/Bhagat_Kabir) – Sikh-specific context, Gurbani quotes, and historical facts from SGGS; 500+ verses noted (verified as 778 total).",
    "Research_For_Personality Tool: Biography summary, early life, and poetry excerpts; aligned with monotheistic themes.",
    "Additional: Dabestan-e Mazaheb (17th-century Persian text) for biographical anecdotes [citation needed for exact disciple list].",
    "Gurbani References: Sri Guru Granth Sahib (srigranth.org) – Direct verses on pages 91, 323, 1364, etc.",
    "Unverified: Exact birth date (debated as 1398 or 1440); incarnation legends marked as traditional folklore."
  ]
}
