{
  "already_exist": false,
  "name": "Bhagat Ravidas",
  "slug": "bhagat-ravidas",
  "category": "Scholars",
  "birth": "1399-01-30",
  "death": "1520-01-01",
  "birthPlace": "Seer Govardhanpur (Sir Gobardhan), near Varanasi (Benaras), Uttar Pradesh, India",
  "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Ravidas.jpg/800px-Ravidas.jpg",
  "excerpt": "Bhagat Ravidas was a revered 15th-16th century mystic poet-saint of the Bhakti movement, born into a marginalized Chamar (leather-working) community. His devotional hymns emphasize devotion to one God, rejection of caste hierarchies, and spiritual equality, with 41 of his compositions included in the Sikh scripture, Guru Granth Sahib. He remains a central figure in the Ravidassia faith and a symbol of social reform.",
  "designation": "Saint-Poet, Social Reformer, Bhagat (Devotee) in Sikhism",
  "quickStats": [
    {
      "label": "Hymns in Guru Granth Sahib",
      "value": 41
    },
    {
      "label": "Primary Language of Writings",
      "value": "Old Hindi/Sant Bhasha"
    },
    {
      "label": "Followers",
      "value": "Ravidassia community (millions worldwide, especially in Punjab, Uttar Pradesh, and diaspora)"
    },
    {
      "label": "Key Theme",
      "value": "Bhakti (devotion) and anti-caste equality"
    }
  ],
  "quickFacts": [
    {
      "label": "Caste and Reverence",
      "value": "Born into untouchable Chamar caste but revered across Hindu, Sikh, and Ravidassia traditions"
    },
    {
      "label": "Influences",
      "value": "Disciple of Bhagat Ramanand; influenced by Sufi saints and sadhus"
    },
    {
      "label": "Miracles",
      "value": "Performed miracles attributed in hagiographies, such as the \"test\" before the Nawab of Kashi"
    },
    {
      "label": "Disciples and Promotion",
      "value": "Disciple to notable figures like Mirabai; promoted women's spiritual access"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-01",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Bhagat Ravidas was born into a family of leather workers from the Chamar community, considered untouchable in the rigid Hindu caste system of medieval India. His father, Santokh Das (or Raghu Das in some accounts), and mother, Kalsi Devi (or Kalpeshvari), resided in Seer Govardhanpur, a village near Varanasi in present-day Uttar Pradesh. Traditional narratives, such as those in the Anantadas Parcai, describe him being blessed by the Bhakti saint Ramanand shortly after birth, marking his early spiritual inclination. As a child, Ravidas showed disinterest in the family trade, instead spending time in devotion along the banks of the Ganges River, associating with Sufi saints, sadhus, and ascetics. By age 12, he was married to Lona Devi, and they had a son, Vijay Das. His father, displeased by Ravidas's charitable spending of business earnings on the needy and saints, banished him from home. Ravidas then lived modestly in a hut, mending shoes by the roadside while deepening his spiritual practices (Sources: SikhiWiki, Wikipedia; cross-verified via hagiographical texts like Prem Ambodh and Anantadas Parcai)."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "Ravidas dedicated his life to spiritual pursuit and social upliftment, establishing a small clay temple where he installed a symbolic idol made from hide, attracting devotees from all castes despite opposition from orthodox Brahmins. He composed devotional poetry that preached monotheism, selfless service (seva), and the pursuit of God through inner devotion rather than ritualistic practices. His teachings influenced the Bhakti movement, promoting unity among Hindus, Muslims, and outcastes. He is credited with guiding disciples like Mirabai, the Rajput princess, and Maharani Jhally of Chittorgarh, demonstrating his cross-caste appeal. Ravidas also engaged in public discourses challenging untouchability, advocating that true devotion transcends social barriers (Sources: Wikipedia; SikhiWiki; citation needed for exact disciple list beyond Mirabai)."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "- **Anti-Caste Advocacy:** Ravidas was a pioneering voice against the caste system, declaring, \"I am lowly born, yet through devotion, I am exalted,\" inspiring Dalit movements today.  \n- **Gender Equality in Spirituality:** By accepting female disciples like Mirabai, he broke taboos on women's participation in religious life.  \n- **Promotion of Universal Brotherhood:** Influenced by Ramanand's teachings, he integrated Hindu, Sufi, and egalitarian ideas, fostering interfaith harmony during a time of Muslim rule in India.  \n- **Economic Altruism:** He rejected material wealth, famously ignoring a philosopher's stone gifted to test his detachment (Sources: SikhiWiki; Wikipedia; cross-verified in Bhakti literature)."
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "Ravidas composed over 500 verses in total (citation needed; primary verified count is 82 in various collections), with 41 hymns (shabads) included in the Guru Granth Sahib under the section Bani Bhagatan ki (pages 93, 345-346, 486-487, 525, 657-659, 694, 710, 793-794, 858, 875, 973-974, 1106, 1124, 1167, 1196, 1293). His poetry is in simple, accessible Hindi/Sant Bhasha, using metaphors from nature (e.g., water and waves for unity with God). Key works outside GGS include those in the Panch Vani (Dadu Panthi tradition). Themes include ego dissolution, divine love, and social critique. Full bani available at srigranth.org (Sources: SikhiWiki; direct quotes from Guru Granth Sahib)."
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "In his later years, Ravidas continued residing in Varanasi, where he faced trials from orthodox priests but triumphed through miracles, such as the divine replication of his form during a feast in Chittorgarh. Accounts suggest he lived to about 120 years (citation needed), dying peacefully in Varanasi around 1520 CE. His samadhi (memorial) at Seer Govardhanpur is a major pilgrimage site, known as Shri Guru Ravidass Janam Asthan. Legends describe his soul merging with the divine, emphasizing his lifelong devotion (Sources: Wikipedia; SikhiWiki; hagiographies like Anantadas Parcai)."
    }
  ],
  "spiritualLegacy": {
    "description": "Ravidas's legacy bridges the Bhakti movement and Sikhism, embodying nirgun bhakti (devotion to formless God) while challenging social injustices. His inclusion in the Guru Granth Sahib by Guru Arjan Dev Ji affirms his universal spiritual message. He founded the basis for the Ravidassia movement, which reveres him as a guru, distinct yet overlapping with Sikhism.",
    "keyContributions": [
      "Inclusion of 41 hymns in Guru Granth Sahib, promoting equality and devotion as core Sikh values.",
      "Inspiration for the Ravidassia faith, which emerged in the 20th century as a response to caste discrimination within Sikhism (citation needed for exact split date: 1920s Punjab).",
      "Influence on later reformers like Kabir and Namdev, emphasizing inner purity over external rituals."
    ]
  },
  "modernRelevance": {
    "description": "In contemporary times, Ravidas symbolizes resistance to caste oppression and Dalit empowerment. His birth anniversary (Ravidas Jayanti) is celebrated globally by Ravidassias, Sikhs, and Hindus, often with social justice themes.",
    "contemporaryImpact": [
      "Inspiration for Ambedkarite movements and anti-caste activism in India (e.g., Dalit literature).",
      "Ravidassia Gurdwaras in the UK, Canada, and US serve Punjabi diaspora communities.",
      "UNESCO recognition of Varanasi-related sites highlights his cultural impact (citation needed)."
    ]
  },
  "achievements": [
    {
      "title": "Inclusion in Guru Granth Sahib",
      "year": "1604 CE",
      "description": "41 hymns compiled by Guru Arjan Dev Ji, elevating his status in Sikh scripture",
      "icon": "📖"
    },
    {
      "title": "Founding Influence on Ravidassia Movement",
      "year": "15th-16th CE (legacy in 20th CE)",
      "description": "Central figure in the development of the Ravidassia religion, promoting social equality and devotion",
      "icon": "🕉️"
    }
  ],
  "quotes": [],
  "timeline": [],
  "relatedPersonalities": [
    {
      "name": "Ramanand",
      "relation": "Guru",
      "slug": "ramanand"
    },
    {
      "name": "Mirabai",
      "relation": "Disciple",
      "slug": "mirabai"
    }
  ],
  "historicalContext": {
    "period": "Medieval India (Bhakti Movement era)",
    "politicalSituation": "Delhi Sultanate and early Mughal influence, with regional Hindu kingdoms",
    "socialConditions": "Rigid caste system, untouchability, interfaith interactions via Sufism and Bhakti",
    "significance": "Ravidas's teachings contributed to social reform and religious syncretism during a period of cultural transition"
  },
  "references": [
    "SikhiWiki: Ravidas",
    "Wikipedia: Ravidas",
    "Guru Granth Sahib (srigranth.org)"
  ]
}
