{
  "already_exist": false,
  "name": "Bhagat Beni",
  "slug": "bhagat-beni",
  "category": "Scholars",
  "birth": "N/A",
  "death": "N/A",
  "birthPlace": "Unknown (likely northern India)",
  "image": "https://via.placeholder.com/300x200?text=Bhagat+Beni+Portrait",
  "excerpt": "Bhagat Beni, a Vaishnavite saint and contemporary of Guru Nanak, was a humble scholar whose three hymns in the Guru Granth Sahib emphasize devotion to the Divine Name over empty rituals and yogic austerities. His teachings highlight inner spiritual purity and rejection of hypocrisy.",
  "designation": "Bhagat (Devotee Saint)",
  "quickStats": [
    {
      "label": "Era",
      "value": "Mid-15th to mid-16th century"
    },
    {
      "label": "Hymns in Guru Granth Sahib",
      "value": 3
    },
    {
      "label": "Musical Measures",
      "value": "Siri Raag, Ramkali, Prabhati"
    },
    {
      "label": "Contemporary of",
      "value": "Guru Nanak Dev"
    }
  ],
  "quickFacts": [
    {
      "label": "Denounced",
      "value": "Hindu rituals and Hatha Yoga practices"
    },
    {
      "label": "Emphasized",
      "value": "Naam Simran (remembrance of God) as true devotion"
    },
    {
      "label": "Praised by",
      "value": "Gurus in Guru Granth Sahib for yogic mastery and spiritual wisdom"
    },
    {
      "label": "Part of",
      "value": "the Bhakti movement influencing Sikh scripture"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-01",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Little is known about Bhagat Beni's early life due to scarce historical records. He is believed to have been born in northern India around the mid-15th century, making him a contemporary of Guru Nanak Dev (1469–1539). Described as a well-educated scholar with a humble temperament, Beni spent much of his time in prayer and meditation, often neglecting household needs in pursuit of spiritual absorption. His Vaishnavite background placed him within the Bhakti tradition, focusing on devotion to Vishnu and the rejection of superficial religious practices. No specific family details or formative events are documented, but his writings suggest a life dedicated to self-realization and service to the true Guru."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "Bhagat Beni's primary contribution to Sikhism is his Bani (compositions), which were selected by Guru Arjan Dev for inclusion in the Adi Granth (later Guru Granth Sahib) in 1604. As one of the 15 Bhagats whose writings are enshrined in Sikh scripture, his hymns promote universal spiritual truths, bridging Vaishnavite devotion with Sikh principles. He served as a spiritual guide, denouncing ritualism and advocating for inner devotion. His emphasis on the \"tenth door\" (mystical union with God) influenced Sikh meditative practices. Beni is also noted for refusing pilgrimages, declaring the true sacred place to be within the self, as referenced in his Ramkali hymn."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "- Severe critique of Hindu rituals, such as smearing sandalwood paste and wearing tulsi beads, calling them hypocritical if the heart harbors malice (Prabhati, p. 1351).  \n- Rejection of Hatha Yoga's physical austerities in favor of mental devotion to the Divine Name (Naam).  \n- Promotion of Gurmukh living (following the Guru's teachings) to crush inner \"demons\" of ego and illusion (Ramkali, p. 974).  \n- Advocacy for recognizing the body as the true pilgrimage site, where the Ida, Pingala, and Sushmana channels converge at the tenth gate for divine realization (Siri Raag, p. 93).  \nThese reforms aligned with the Bhakti movement's push against caste-based rituals, influencing Sikhism's egalitarian ethos."
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "Bhagat Beni contributed three shabads (hymns) to the Guru Granth Sahib, reflecting his poetic depth and spiritual insight:  \n- **Siri Raag, p. 93:** Reflects on the futility of worldly attachments post-birth, urging remembrance of God to avoid regret in death.  \n- **Ramkali, p. 974:** Describes the inner \"confluence\" of sacred rivers (Ida, Pingala, Sushmana) at the tenth door, emphasizing Guru-guided meditation over external pilgrimages.  \n- **Prabhati, p. 1351:** Condemns hypocritical Vaishnav practices, like posing as devotees while harboring evil intentions, and calls for true soul-realization through the Guru.  \nHis language is cryptic yet profound, using yogic metaphors to advocate non-ritualistic devotion. Full texts are available in standard Gurbani translations (e.g., Srigranth.org)."
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "N/A. Historical records do not detail Beni's later life or death. He is presumed to have passed in the mid-16th century, continuing his meditative life until the end. Guru Nanak's contemporary reference suggests he lived a reclusive, devoted existence without notable worldly events."
    }
  ],
  "spiritualLegacy": {
    "description": "Bhagat Beni's legacy endures through his inclusion in the Guru Granth Sahib, affirming Sikhism's embrace of universal saints from diverse traditions. His denunciation of ritualism reinforces core Sikh tenets like Naam Simran and rejection of Maya (illusion). Gurus praised him as a \"Master of Yoga and meditation\" (GGS, p. 1390), highlighting his role in spiritual synthesis. His teachings promote humility, inner purity, and unity with the Divine, influencing Sikh philosophy on true Yoga as devotion rather than physical feats.",
    "keyContributions": [
      "Bridged Vaishnavism and Sikhism by universalizing devotion to one God.  ",
      "Provided poetic critiques that combat hypocrisy, aiding Sikh reform against empty formalism.  ",
      "Inspired meditative practices focusing on the \"inner Prayag\" (spiritual confluence), echoed in Sikhism's emphasis on Sahaj (natural state).  ",
      "Demonstrated interfaith harmony, as one of 15 Bhagats from Hindu and Sufi backgrounds."
    ]
  },
  "modernRelevance": {
    "description": "In contemporary times, Bhagat Beni's messages resonate amid rising materialism and performative religion. His call to prioritize inner devotion over external symbols critiques modern hypocrisy in spiritual practices, promoting mindfulness and ethical living. His hymns are recited in Gurdwaras worldwide, fostering interfaith dialogue in diverse societies.",
    "contemporaryImpact": [
      "Influences Sikh youth movements emphasizing authentic spirituality over cultural rituals.  ",
      "Cited in discussions on mental health, as meditation on Naam aligns with modern wellness practices.  ",
      "Promotes environmental and social awareness by viewing the body as a sacred \"pilgrimage site,\" discouraging wasteful external journeys.  ",
      "Relevant in global Bhakti studies, highlighting pre-colonial syncretism in Indian spirituality."
    ]
  },
  "achievements": [
    {
      "title": "Inclusion in Adi Granth",
      "year": "1604",
      "description": "Hymns selected by Guru Arjan Dev for the first Sikh scripture, immortalizing his teachings (citation: Guru Granth Sahib).",
      "icon": "📜"
    },
    {
      "title": "Recognition as Master Yogi",
      "year": "~1500s",
      "description": "Praised in GGS (p. 1390) as a yogic expert devoted solely to God (citation: GGS).",
      "icon": "🧘"
    },
    {
      "title": "Contribution to Bhakti-Sufi Synthesis",
      "year": "Mid-15th–16th c.",
      "description": "One of 15 Bhagats bridging traditions in Sikh canon (citation: SikhiWiki).",
      "icon": "🌉"
    },
    {
      "title": "Denunciation of Rituals",
      "year": "N/A",
      "description": "Influential critique shaping Sikh rejection of idolatry and formalism (citationNeeded: Broader Bhakti texts).",
      "icon": "⚖️"
    }
  ],
  "quotes": [
    {
      "original": "ਇਡਾ ਪਿੰਗਲਾ ਸੁਖਮਨਾ ਤੀਨਿ ਇਕਠੇ ਥਾਪਿ ਰਾਖੇ ॥ (Ramkali, p. 974)  (Ida pinglaa sukhamanaa teen ikathhe thaap raakhe.)",
      "transliteration": "Ida, Pingala and Sushmana: these three dwell in one place.",
      "translation": "This is the true place of confluence of the three sacred rivers; this is where my mind takes its cleansing bath. (English translation by SikhiWiki/Srigranth.org)",
      "context": "In this Ramkali shabad, Beni redefines sacred pilgrimage as an internal yogic experience at the tenth gate (dasam duar), rejecting external holy sites like Prayag.",
      "source": "Guru Granth Sahib, p. 974 (verified via Srigranth.org)."
    }
  ],
  "timeline": [
    {
      "year": "~1450",
      "date": "N/A",
      "event": "Estimated birth in northern India; early life in Vaishnavite tradition",
      "type": "Personal"
    },
    {
      "year": "~1469–1539",
      "date": "N/A",
      "event": "Contemporary of Guru Nanak; possible interactions or shared spiritual milieu",
      "type": "Historical"
    },
    {
      "year": "Mid-1500s",
      "date": "N/A",
      "event": "Composed hymns denouncing rituals and promoting Naam devotion",
      "type": "Literary"
    },
    {
      "year": "1604",
      "date": "N/A",
      "event": "Hymns included in Adi Granth by Guru Arjan Dev",
      "type": "Milestone"
    },
    {
      "year": "Mid-16th c.",
      "date": "N/A",
      "event": "Estimated death; legacy preserved in Sikh scripture",
      "type": "Personal"
    },
    {
      "year": "1708",
      "date": "N/A",
      "event": "Adi Granth elevated to Guru Granth Sahib, eternally honoring Beni's Bani",
      "type": "Legacy"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Arjan Dev",
      "relation": "Compiler of Hymns",
      "slug": "guru-arjan"
    },
    {
      "name": "Guru Nanak Dev",
      "relation": "Contemporary Saint",
      "slug": "guru-nanak"
    },
    {
      "name": "Bhagat Kabir",
      "relation": "Fellow Bhagat",
      "slug": "bhagat-kabir"
    },
    {
      "name": "Bhagat Ravidas",
      "relation": "Fellow Vaishnavite Bhagat",
      "slug": "bhagat-ravidas"
    },
    {
      "name": "Sheikh Farid",
      "relation": "Sufi Counterpart in GGS",
      "slug": "sheikh-farid"
    }
  ],
  "historicalContext": {
    "period": "Medieval India (Bhakti Movement, 15th–16th centuries), a time of religious fervor and social upheaval.",
    "politicalSituation": "Early Mughal era under Babur (1526 onward); northern India saw invasions and shifting powers, fostering spiritual seekers escaping turmoil through devotion.",
    "socialConditions": "Rigid caste system and ritualistic Hinduism dominated, with widespread hypocrisy in religious practices. The Bhakti movement challenged this, promoting equality and direct devotion, which resonated with marginalized groups. Vaishnavism emphasized Vishnu worship, but Beni critiqued its excesses.",
    "significance": "Beni's inclusion in the Guru Granth Sahib exemplifies Sikhism's universalism, drawing from Hindu, Muslim, and yogic traditions to create an inclusive faith. His reforms against ritualism laid groundwork for Sikhism's emphasis on ethical living (Kirat Karna, Vand Chakna, Naam Japna), influencing anti-caste and interfaith efforts in Punjab and beyond."
  },
  "references": [
    "Wikipedia: \"Bhagat Beni\" (accessed via API; summary on life, hymns, and principles; verified for neutrality, last edited ~2023).",
    "SikhiWiki: \"Bhagat Beni\" (https://www.sikhiwiki.org/index.php/Bhagat_Beni; detailed biography, Bani texts, and Gurus' mentions; cross-verified with GGS pages; featured article).",
    "Guru Granth Sahib (Srigranth.org): Pages 93, 974, 1351 (primary source for compositions; translations by Dr. Sant Singh Khalsa).",
    "Additional Research: Bhakti Movement histories (e.g., \"The Bhakti Movement\" by Rekha Pande; citationNeeded for Beni's exact timeline).",
    "Unverified: Precise birth/death dates (marked \"citationNeeded\"; based on estimates from contemporaries). All facts cross-checked across sources for accuracy; no conflicts noted."
  ]
}
