{
  "already_exist": false,
  "name": "Bhagat Trilochan",
  "slug": "bhagat-trilochan",
  "category": "Scholars",
  "birth": "1267-01-01",
  "death": "N/A",
  "birthPlace": "Barsi, Solapur District, Maharashtra, India",
  "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Trilochan.jpg/250px-Trilochan.jpg",
  "excerpt": "Bhagat Trilochan was a revered medieval Indian saint-poet of the Vaishya caste, known for his devotional hymns included in the Guru Granth Sahib. A contemporary of Bhagat Namdev, he emphasized inner purity over external rituals and monotheistic devotion to one God.",
  "designation": "Saint, Poet, Devotee (Bhagat)",
  "quickStats": [
    {
      "label": "Lifespan",
      "value": "Mid-13th century (born ~1267)"
    },
    {
      "label": "Hymns in Guru Granth Sahib",
      "value": "4 Shabads"
    },
    {
      "label": "Primary Themes",
      "value": "Detachment from Maya, fear of death, inner holiness"
    }
  ],
  "quickFacts": [
    {
      "label": "Contemporary of Namdev and associated with Pandharpur devotional tradition",
      "value": "True"
    },
    {
      "label": "Belonged to Vaishya (merchant) caste",
      "value": "True"
    },
    {
      "label": "Hymns found on pages 92, 525-526, and 695 of the Guru Granth Sahib",
      "value": "True"
    },
    {
      "label": "Acknowledged in Ravidassia traditions alongside other Bhagats like Kabir and Namdev",
      "value": "True"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-05",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Bhagat Trilochan, whose name signifies \"three-eyed\" (seer of past, present, and future), was born around 1267 into a Vaishya (merchant) family in Barsi, located in the Solapur District of present-day Maharashtra, India (source: Mahankosh and Sikh traditions). Little is documented about his childhood, but he is believed to have been influenced by the Bhakti movement prevalent in medieval India. He either resided in or frequently visited Pandharpur, a major center of devotion to Lord Vitthal, and was a contemporary of the poet-saint Namdev, who referenced him in his hymns. Trilochan's early life was marked by a deep spiritual inclination, leading him to prioritize devotion over worldly pursuits, which later affected his domestic circumstances."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "Trilochan's primary contributions were through his poetic compositions that promoted monotheism and ethical living. He hosted numerous saints and devotees at his home, fostering a community of spiritual seekers. Legends describe him as exceptionally hospitable, even engaging a mysterious servant named Antarjami (the \"knower of hearts,\" interpreted as a divine figure) to serve holy men, highlighting his service-oriented life. His teachings influenced the Bhakti tradition and were later immortalized in Sikh scripture. Among Ravidassia communities, he is revered as \"Satgur Trilochan,\" with his bani (compositions) propagated alongside those of Ravidas, Kabir, Namdev, Sain, and Sadhna (source: Dera Sach Khand Ballan declaration, 2010)."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "Trilochan critiqued superficial religious practices, such as ritualistic renunciation, pilgrimages without inner transformation, and caste-based hypocrisies. In one famous hymn, he challenged ascetics (Sannyasi, Jogi, etc.) for their outward appearances without cleansing the \"filth\" of the heart, advocating recognition of God within the self-lotus (source: Raag Gujari, p. 525). He emphasized karma's inescapable role in suffering and the need for devotion to the one Creator to transcend it, aligning with Sikh principles of equality and inner devotion over external forms."
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "Trilochan contributed four shabads (hymns) to the Guru Granth Sahib, reflecting his monotheistic devotion and warnings against attachment to Maya (illusion). Key works include: - **Sri Raag, p. 92:** Admonishes mortals for forgetting death amid family attachments and calls for divine embrace. - **Raag Gujari, p. 525-526:** A dialogue satirizing hypocritical ascetics, stressing meditation on the Creator over empty rituals. - **Raag Dhanasari, p. 695:** Consoles his wife on worldly hardships by explaining karma through mythological examples (e.g., moon's stains despite divine associations, Shiva's enduring sin). These hymns, composed in medieval Hindi/Punjabi, total around 20-25 stanzas and focus on themes of transience, divine grace, and ethical living (cross-verified via SikhiToTheMax and Macauliffe's translations)."
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "Historical records on Trilochan's later life are sparse, with no confirmed death date. Legends suggest that after the disappearance of his divine servant Antarjami—due to his wife's inadvertent complaint—Trilochan immersed himself deeper in contemplation and praise of God, dispelling his sorrow through devotion. He likely passed away in the late 13th or early 14th century, continuing his life of piety in Maharashtra's devotional circles (citationNeeded: exact details from oral traditions)."
    }
  ],
  "spiritualLegacy": {
    "description": "Bhagat Trilochan's legacy lies in his integration into Sikhism via the Guru Granth Sahib, where his bani serves as a testament to universal devotion beyond caste or ritual. His emphasis on heart purity and monotheism resonates with Sikh Gurus' teachings, promoting a formless, accessible God.",
    "keyContributions": [
      "Condemnation of ritualism: Hymns like the one in Raag Gujari expose the futility of external piety without inner reform.",
      "Promotion of Bhakti: Encouraged meditation on the Creator amid daily life, influencing later saints like Kabir and Ravidas.",
      "Karmic wisdom: Used myths (e.g., Krishna, Shiva) to illustrate karma's persistence, urging reliance on divine Name (source: p. 695 shabad)."
    ]
  },
  "modernRelevance": {
    "description": "In contemporary times, Trilochan's teachings inspire interfaith harmony, particularly in Bhakti-influenced regions like Maharashtra and Punjab. His inclusion in the Guru Granth Sahib underscores Sikhism's eclectic roots.",
    "contemporaryImpact": [
      "Revered in Ravidassia and other Bhakti sects: His bani is studied and recited in temples, as announced by Dera Sach Khand Ballan in 2010.",
      "Educational value: Used in Sikh studies to highlight anti-ritual reforms and monotheism, relevant in discussions on secular spirituality.",
      "Cultural festivals: Commemorated during Bhagat Purabs and Namdev-related events in Pandharpur (citationNeeded: modern observances)."
    ]
  },
  "achievements": [
    {
      "title": "Inclusion in Adi Granth",
      "year": "~1604",
      "description": "Hymns compiled into the Guru Granth Sahib by Guru Arjan Dev, eternalizing his spiritual voice.",
      "icon": "📖"
    },
    {
      "title": "Recognition as Bhagat",
      "year": "Medieval",
      "description": "Honored as one of 15 Bhagats in Sikh tradition for devotional poetry.",
      "icon": "🕊️"
    },
    {
      "title": "Influence on Bhakti",
      "year": "13th-14th C.",
      "description": "Contemporary association with Namdev; hymns propagate monotheistic ideals.",
      "icon": "✍️"
    }
  ],
  "quotes": [
    {
      "original": "ਮਾਇਆ ਮੋਹੁ ਮਨਿ ਆਗਲਾ ਪ੍ਰਾਣੀ ਜਰਾ ਮਰਣੁ ਭਉ ਵਿਸਰਿ ਗਇਆ ॥ (Sri Raag, p. 92)",
      "transliteration": "Maya moh man agla prani jara maran bhav visri gaya.",
      "translation": "The mind is totally attached to Maya; the mortal has forgotten his fear of old age and death.",
      "context": "This line warns against worldly attachments, urging remembrance of mortality and divine protection.",
      "source": "Guru Granth Sahib, p. 92 (verified via SikhiToTheMax)."
    }
  ],
  "timeline": [
    {
      "year": "~1267",
      "date": "N/A",
      "event": "Birth in Barsi, Maharashtra, into a Vaishya family.",
      "type": "Birth"
    },
    {
      "year": "Mid-13th C.",
      "date": "N/A",
      "event": "Association with Namdev; composition of devotional hymns.",
      "type": "Spiritual"
    },
    {
      "year": "Late 13th C.",
      "date": "N/A",
      "event": "Legend of divine servant Antarjami; deepened devotion post-incident.",
      "type": "Personal"
    },
    {
      "year": "~1604",
      "date": "N/A",
      "event": "Hymns included in the Adi Granth by Guru Arjan Dev.",
      "type": "Legacy"
    },
    {
      "year": "2010",
      "date": "Jan 30",
      "event": "Ravidassia recognition of his teachings in new religious objectives.",
      "type": "Modern"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Namdev",
      "relation": "Contemporary Poet-Saint",
      "slug": "bhagat-namdev"
    },
    {
      "name": "Kabir",
      "relation": "Fellow Bhagat in Guru Granth Sahib",
      "slug": "bhagat-kabir"
    },
    {
      "name": "Ravidas",
      "relation": "Acknowledged in Ravidassia traditions",
      "slug": "bhagat-ravidas"
    }
  ],
  "historicalContext": {
    "period": "Medieval India (13th century), during the Bhakti movement's rise against rigid caste systems and ritualism in Hinduism.",
    "politicalSituation": "Northern India under Delhi Sultanate (Islamic rule), with regional Hindu kingdoms in the Deccan; religious syncretism emerging amid socio-political tensions.",
    "socialConditions": "Caste divisions prevalent; Vaishya class like Trilochan's faced economic pressures. Bhakti saints challenged orthodoxy, promoting egalitarian devotion accessible to all, including merchants and low castes.",
    "significance": "Trilochan's life exemplifies Bhakti's democratizing force, bridging Hindu and emerging Sikh traditions. His hymns in the Guru Granth Sahib highlight Sikhism's roots in inclusive monotheism, influencing anti-colonial and reform movements in Punjab and Maharashtra (source: Macauliffe, 1909)."
  },
  "references": [
    "Macauliffe, M.A. (1909). *The Sikh Religion: Its Gurus, Sacred Writings, and Authors*. Low Price Publications. ISBN 81-7536-132-8. (Primary translation and historical account).",
    "SikhiWiki.org. \"Bhagat Trilochan.\" Accessed via tool extraction; includes legends and hymn texts (verified for accuracy against Guru Granth Sahib).",
    "Research_For_Personality tool output: Summary of life, hymns, and Ravidassia context (cross-checked with Macauliffe).",
    "Guru Granth Sahib (pages 92, 525-526, 695): Original bani; translations via SikhiToTheMax.org.",
    "Dera Sach Khand Ballan (2010): Announcement on Ravidassia objectives including Trilochan's teachings.",
    "citationNeeded: Precise death date and some legendary details (e.g., Antarjami) from oral traditions in Pandharpur."
  ]
}
