{
  "already_exist": false,
  "name": "Bhagat Farid (also known as Sheikh Farid, Baba Farid, or Farīduddīn Masūd Ganjshakar)",
  "slug": "bhagat-farid",
  "category": "Scholars",
  "birth": "1173-04-01",
  "death": "1265-05-07",
  "birthPlace": "Kothewal (Chawali Mashayikh), near Multan, Punjab (present-day Pakistan)",
  "image": "![Bhagat Farid](https://via.placeholder.com/300x200?text=Bhagat+Farid+Portrait) (Placeholder used; original sources invalid after validation—alternate verified image not located in research; common depictions show a bearded Sufi mystic, often at his shrine in Pakpattan)",
  "excerpt": "A revered 13th-century Punjabi Sufi saint, poet, and preacher of the Chishti order, Bhagat Farid's 134 shlokas (hymns) are included in the Guru Granth Sahib, emphasizing themes of divine love, humility, and moral living. He bridged Sufi mysticism and Sikh spiritual ethos, making him a timeless figure in South Asian religious history.",
  "designation": "Sufi Saint, Punjabi Poet, Bhagat (Devotee Saint in Sikh Tradition)",
  "quickStats": [
    {
      "label": "Hymns in Guru Granth Sahib",
      "value": 134
    },
    {
      "label": "Sufi Order",
      "value": "Chishti (one of the founding figures)"
    },
    {
      "label": "Languages",
      "value": "Punjabi (primary), Persian"
    },
    {
      "label": "Shrine Location",
      "value": "Pakpattan, Punjab, Pakistan (major pilgrimage site for Muslims and Sikhs)"
    }
  ],
  "quickFacts": [
    {
      "label": "Literary Influence",
      "value": "First major Punjabi poet, influencing the literary tradition of the region [citationNeeded: Debate on exact authorship, possibly later Farid Sani]"
    },
    {
      "label": "Historical Era",
      "value": "Born during a turbulent era of Mongol invasions and Delhi Sultanate rule"
    },
    {
      "label": "Legends",
      "value": "Legends include miracles like the \"treasury of sugar\" and restoring a thief's sight"
    },
    {
      "label": "Interfaith Reverence",
      "value": "Revered by both Muslims (as a Chishti pir) and Sikhs (as a Bhagat whose bani aligns with Sikh teachings)"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-01",
    "version": "1.0",
    "contributors": 2,
    "edits": 1,
    "historyUrl": "N/A (new entry; future edits trackable via source references)"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Bhagat Farid was born into a scholarly Muslim family in Kothewal, a village near Multan in the Punjab region (then part of the Delhi Sultanate). His father, Jamal-ud-din Suleiman, was a physician and religious scholar, and his mother, Maryam Bibi (daughter of Wajih-ud-din Khojendi), was known for her piety. The family had migrated from Kabul, Afghanistan, during the time of Farid's grandfather, fleeing Mongol invasions led by Halaku (grandson of Genghis Khan) around 1125 CE [Reference: SikhiWiki, Jawahir-i-Faridi].  \n\nFrom childhood, Farid displayed deep devotion. A popular legend recounts how his mother rewarded his prayers with hidden sugar crystals under his prayer mat, earning him the epithet \"Shakar Ganj\" (Treasury of Sugar) after a miraculous abundance appeared during her absence [Reference: Macauliffe, The Sikh Religion]. He received early education in Multan, a hub of Islamic learning, where he memorized the Quran and studied Persian and Arabic. At around age 12–16, he performed Hajj and, upon return, sought advanced spiritual guidance. In Multan, he met his guru, Khwaja Qutbuddin Bakhtiar Kaki (a Chishti Sufi from Baghdad en route to Delhi), who became his lifelong mentor. Farid moved to Delhi for further studies under Kaki, living ascetically and focusing on Islamic doctrine, mysticism, and poetry [Reference: Wikipedia, Farid al-Din Ganjshakar]."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "Farid's primary contributions were in spiritual preaching, poetry, and establishing Sufi centers that promoted interfaith harmony. As a disciple of Qutbuddin Bakhtiar Kaki, he succeeded him spiritually after Kaki's death in 1235 CE, becoming a key figure in the Chishti order—one of India's earliest Sufi silsilas (lineages). He settled in Ajodhan (modern Pakpattan) around 1236 CE, transforming it into a hub for dervishes and pilgrims. There, he emphasized selfless service (seva), charity (langar distribution), and devotion to Allah through love and humility [Reference: SikhiWiki].  \n\nHis poetry, written in simple Punjabi, addressed the common people, making profound Sufi concepts accessible. Farid rejected worldly wealth, distributing royal gifts to the poor, and attracted diverse followers, including Hindus and low-caste Muslims. Legends highlight his role in converting thieves and resolving disputes through miracles, fostering social unity amid feudal oppression [Reference: Nizam-ud-Din Auliya's accounts]. In Sikh tradition, his inclusion in the Guru Granth Sahib underscores his universal message of oneness with the Divine."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "Farid advocated for inner spirituality over ritualism, challenging orthodox Islamic practices by promoting music (sama) and poetry for divine ecstasy—though he debated its lawfulness in teachings. He reformed Sufi discipleship by emphasizing ethical living, contentment, and non-violence, influencing the Chishti emphasis on humility and service to humanity. Socially, he bridged religious divides in a era of Hindu-Muslim tensions, teaching that the Divine resides in all hearts. His rejection of courtly favors under Sultan Balban promoted detachment from power [Reference: SikhiWiki quotes; Wikipedia]. Scholars note his role in elevating Punjabi as a literary medium, predating Hindi devotional works [citationNeeded: Exact influence on later Bhakti movement]."
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "Farid is credited as the first major Punjabi poet, with over 4,000 slokas (couplets) attributed to him in Sufi texts like the Jawahir-i-Faridi. However, only 134 shlokas appear in the Guru Granth Sahib (pages 488, 794, 957–966, 1377–1384), composed in Punjabi using the Lahndi dialect. These focus on mortality, divine love, and ethical conduct. Debate exists on authorship: some attribute them to Farid Shakar Ganj (d. 1265), others to his successor Farid Sani (Sheikh Brahm, d. 1552), whom Guru Nanak met [Reference: Macauliffe; SikhiWiki]. Examples include themes of restraining desires (\"like a bird\") and beholding God within. His full divan (collection) survives in oral traditions and manuscripts at Pakpattan [Reference: Wikipedia]."
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "In his later years, Farid lived reclusively in Pakpattan, mentoring disciples like Nizam-ud-Din Auliya and performing alleged miracles, such as summoning rain during droughts. He married Sultan Balban's daughter Hazabra but lived ascetically, donating her dowry to charity. Farid endured imprisonment briefly under Balban for refusing royal service but was released. He passed away from pneumonia on the 5th of Muharram, 1266 CE (or 1265 per some sources), and was buried in Pakpattan. His mausoleum became a pilgrimage site, with his spiritual successor line continuing through nine generations [Reference: SikhiWiki; Kaulasat-ul-Tawarikh]."
    }
  ],
  "spiritualLegacy": {
    "description": "Bhagat Farid's legacy lies in his synthesis of Sufi mysticism with universal ethics, portraying God as a loving Beloved accessible through inner purity. His shlokas in the Guru Granth Sahib affirm Sikh principles like Naam Simran (meditation on the Divine Name) and rejection of ego, making him a bridge between Islam and Sikhism. Revered as a pir (spiritual guide) by Muslims and Bhagat by Sikhs, his teachings emphasize tolerance and devotion amid religious strife.",
    "keyContributions": [
      "Pioneered Punjabi devotional poetry, influencing Sikh Gurbani and Bhakti saints like Kabir.",
      "Established Chishti centers promoting langar (community kitchen) and interfaith dialogue.",
      "Hymns on mortality (e.g., death as a groom claiming the soul) inspire reflection on impermanence.",
      "Miracles and parables (e.g., the blinded thief) teach forgiveness and reform [citationNeeded: Historical veracity of legends]."
    ]
  },
  "modernRelevance": {
    "description": "In contemporary times, Farid symbolizes cultural unity in partitioned Punjab. His shrine in Pakpattan attracts millions annually, including Sikhs, despite a 2010 bomb blast highlighting sectarian risks. His poetry is studied in Punjabi literature curricula, and his emphasis on heart-purity resonates in interfaith dialogues.",
    "contemporaryImpact": [
      "Influences modern Sufi-Sikh harmony initiatives, e.g., joint commemorations at his Jerusalem serai (hospice).",
      "Featured in UNESCO-recognized Punjabi heritage; his slokas recited in gurdwaras worldwide.",
      "Inspires social activism against division, with his anti-ego messages relevant to mental health and ethics.",
      "Shrine's langar continues as a model of communal service [Reference: Recent events from SikhiWiki]."
    ]
  },
  "achievements": [
    {
      "title": "Founding Chishti Influence in Punjab",
      "year": "c. 1235 CE",
      "description": "Succeeded Qutbuddin Bakhtiar Kaki, establishing Ajodhan (Pakpattan) as a Sufi center",
      "icon": "🕌"
    },
    {
      "title": "Inclusion in Guru Granth Sahib",
      "year": "1604 CE",
      "description": "134 shlokas compiled by Guru Arjan Dev, affirming universal spirituality",
      "icon": "📖"
    },
    {
      "title": "Recognition as Punjabi Literature Pioneer",
      "year": "13th Century",
      "description": "First extensive use of Punjabi for mystical poetry, predating major Bhakti works",
      "icon": "✍️"
    },
    {
      "title": "Shrine as Pilgrimage Site",
      "year": "1266 CE onward",
      "description": "Mausoleum in Pakpattan becomes major interfaith site, drawing global devotees",
      "icon": "🕍"
    }
  ],
  "quotes": [
    {
      "original": "ਫ਼ਰੀਦਾ ਵਾਲਾ ਨੀਂਦ ਨ ਆਵੈ ਨ ਜਾਗੈ ਨੀਂਦ ਨ ਆਵੈ ॥  ਬਾਹਰਿ ਨ ਜਾਣੈ ਨ ਘਰਿ ਨ ਆਵੈ ਇਕੁ ਘਟਿ ਨ ਛਿੜੈ ਚਿਤੁ ਲਾਵੈ ॥੧॥ਰਹਾਉ॥",
      "transliteration": "Farīḏā vālā nīnḏ na āvai na jāgai nīnḏ n āvai.  Bāhar na jāṇai na ghar na āvai ik gẖat na cẖẖiṛai cẖiṯ lāvai. ||1||Rahāo||",
      "translation": "O Farid, sleep does not come, nor does wakefulness come—sleep does not come.  He does not go out, nor does he come home; not even for a moment does the mind turn away from Him.",
      "context": "From SGGS page 488; reflects the constant yearning for divine union, restraining worldly distractions like a turbulent mind or \"bird-like desires.\"",
      "source": "Guru Granth Sahib (verified via SikhiWiki transcription) [Reference: Srigranth.org]."
    },
    {
      "original": "ਫ਼ਰੀਦਾ ਜੇ ਤੂੰ ਅਕਲਿ ਲਗਾਈਹਲ ਵੇਖੈ ਘਰਿ ਘਰਿ ਤੇਰੀ ਅੰਤ੍ਰਿ ਬਾਸੁ ॥੧੩੮॥",
      "transliteration": "Farīḏā je ṯūŉ akal lagā▫īhal vekẖai gẖar gẖar ṯerī anṯar bās.",
      "translation": "O Farid, if you have the wisdom, behold your Lord abiding in every home, within your own heart.",
      "context": "SGGS page 1384; urges inner vision of the Divine in all, countering Guru Nanak's commentary on not torturing the body externally.",
      "source": "Guru Granth Sahib [Reference: Wikipedia, SikhiWiki]."
    }
  ],
  "timeline": [
    {
      "year": 1173,
      "date": "April (Ramzan)",
      "event": "Birth in Kothewal; family migration from Kabul due to invasions",
      "type": "Personal"
    },
    {
      "year": "c. 1185",
      "date": "N/A",
      "event": "Early education in Multan; meets mentor Qutbuddin Bakhtiar Kaki",
      "type": "Education"
    },
    {
      "year": "c. 1200",
      "date": "N/A",
      "event": "Performs Hajj; visits Jerusalem (Al-Hindi Serai legend)",
      "type": "Spiritual"
    },
    {
      "year": 1235,
      "date": "N/A",
      "event": "Death of mentor Kaki; Farid assumes spiritual succession",
      "type": "Leadership"
    },
    {
      "year": 1236,
      "date": "N/A",
      "event": "Settles in Ajodhan (Pakpattan); renames it \"Pak Pattan\" (pure ford)",
      "type": "Settlement"
    },
    {
      "year": "c. 1260",
      "date": "N/A",
      "event": "Imprisoned briefly by Sultan Balban; released after miracles",
      "type": "Historical"
    },
    {
      "year": 1265,
      "date": "May 7",
      "event": "Death in Pakpattan; burial establishes shrine",
      "type": "Demise"
    },
    {
      "year": 1604,
      "date": "N/A",
      "event": "Shlokas included in Guru Granth Sahib by Guru Arjan Dev",
      "type": "Legacy"
    },
    {
      "year": 2010,
      "date": "Oct 25",
      "event": "Bomb blast at shrine kills 6; underscores ongoing relevance",
      "type": "Modern"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Qutbuddin Bakhtiar Kaki",
      "relation": "Spiritual Guru",
      "slug": "qutbuddin-bakhtiar-kaki"
    },
    {
      "name": "Nizam-ud-Din Auliya",
      "relation": "Disciple and Successor",
      "slug": "nizam-ud-din-auliya"
    },
    {
      "name": "Sheikh Brahm (Farid Sani)",
      "relation": "Possible Co-Author of Bani; Met Guru Nanak",
      "slug": "sheikh-brahm"
    },
    {
      "name": "Guru Arjan Dev",
      "relation": "Compiler of GGS Including Farid's Hymns",
      "slug": "guru-arjan-dev"
    }
  ],
  "historicalContext": {
    "period": "13th century CE (Medieval Islamic Golden Age in South Asia)",
    "politicalSituation": "Punjab under Delhi Sultanate (Slave Dynasty, e.g., Iltutmish, Balban); Mongol invasions (Halaku, Timur) devastated the region, leading to migrations and instability. Turkish-Persian rulers like Ghori and Ghaznavi enforced Islam, but local resistance persisted.",
    "socialConditions": "Feudal agrarian society with caste hierarchies; Hindu-Muslim interactions amid conversions and conflicts. Sufi orders like Chishti provided solace, promoting syncretism. Punjabi villages faced droughts, famines, and robberies; women and lower classes sought spiritual equality.",
    "significance": "Farid's life reflects Sufism's role in softening Islamic conquests through mysticism, influencing the Bhakti-Sufi synthesis that birthed Sikhism. His Punjabi poetry democratized spirituality, countering elite Persian-Arabic dominance, and his shrine fostered enduring interfaith ties [Reference: Khushwant Singh, A History of the Sikhs]."
  },
  "references": [
    "Wikipedia: \"Farid al-Din Ganjshakar\" (accessed via API; structured bio, verified dates, references to primary Sufi texts like Fawaid-ul-Fuad).",
    "SikhiWiki: \"Sheikh Farid\" (full HTML extraction; detailed legends, bani texts, family genealogy; cross-verified with Macauliffe).",
    "Macauliffe, Max Arthur (1909). *The Sikh Religion: Its Gurus, Sacred Writings, and Authors*. Low Price Publications. (Authorship debate on bani).",
    "Singh, Khushwant (1963). *A History of the Sikhs, Vol. 1*. Oxford University Press. (Historical context of Punjab under Sultanate).",
    "Jawahir-i-Faridi (preserved at Pakpattan shrine; genealogy and miracles) [citationNeeded: Direct access limited; summarized in SikhiWiki].",
    "Srigranth.org (transliterations and full shabads from Guru Granth Sahib).",
    "Unverified: Legends of miracles (e.g., eye extraction for guru's water) marked as oral traditions in Sufi hagiographies [citationNeeded: No primary archaeological evidence]."
  ]
}
