{
  "already_exist": false,
  "name": "Bhai Roop Chand",
  "slug": "bhai-roop-chand",
  "category": "Leaders",
  "birth": "circa 1620s–1630s",
  "death": "N/A",
  "birthPlace": "Tuklani (ancestral), later associated with Bhai Roopa village, Punjab",
  "image": "https://www.sikhiwiki.org/images/6/69/Bhai_Sahib_of_Bagrian.jpg",
  "excerpt": "Bhai Roop Chand was a devoted Sikh preacher and Masand (representative) appointed by Guru Hargobind Sahib Ji to oversee the spiritual welfare and dasvandh collection in the Malwa region south of the Sutlej River. Renowned for his selfless service, langar organization, and deep devotion, he exemplified Sikh principles of humility and community service during the early expansion of Sikhism under Mughal rule.",
  "designation": "Masand and Preacher",
  "quickStats": [
    {
      "label": "Title Conferred",
      "value": "Bhai (by Guru Hargobind Sahib Ji)"
    },
    {
      "label": "Region of Influence",
      "value": "Malwa (south of Sutlej River)"
    },
    {
      "label": "Key Service",
      "value": "Langar (community kitchen) establishment and propagation of Sikh teachings"
    }
  ],
  "quickFacts": [
    {
      "label": "Devotion Incident",
      "value": "Offered water to Guru Hargobind despite extreme thirst, leading to the Guru's personal visit."
    },
    {
      "label": "Family Legacy",
      "value": "Descendants hold the title \"Bhai Sahib\" and preserve Guru relics at Bagrian village."
    },
    {
      "label": "Historical Role",
      "value": "One of the five families honored with the \"Bhai\" title by the Sikh Gurus."
    }
  ],
  "version": {
    "lastUpdated": "2023-09-21",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "https://www.sikhiwiki.org/index.php?title=Bhai_Roop_Chand&action=history"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Bhai Roop Chand was born into a Khokharwa Rajput family that traced its ancestry to the Sidhu branch, originally settled in Tuklani (near modern-day Afghanistan influence). His grandfather Raja Sultan, father Sidhu, and family were initially followers of the Muslim pir Sakhi Server. However, a pivotal shift occurred when Sidhu's wife, Bibi Surti (daughter of Bhai Aqal, a disciple of Gurus Ram Das and Arjan Dev), influenced the family toward Sikhism. On 16th Jyeth 1670 Bikrami (circa 1613 AD), during her wedding procession, Bibi Surti met Guru Hargobind Sahib Ji and sought blessings for her husband's conversion. The Guru prophesied the birth of a son who would be honored by all. Bhai Roop Chand was born on 3rd Baisakh, and Guru Hargobind personally named him. A famous incident of devotion marked his early life: While supervising harvest, father and son offered cool water from a goat-skin container to the Guru in their hearts, abstaining despite intense heat and thirst. Guru Hargobind, aware through divine omniscience, traveled 32 miles on horseback to drink it, rewarding their faith with his robe, sword, and horse. This event occurred under a Jand tree, commemorated to this day. In 1687 Bikrami (1630 AD), Guru Hargobind founded the village of Bhai Roopa in his honor."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "In 1630 AD, Guru Hargobind honored Bhai Roop Chand with the title \"Bhai\" (brother) and appointed him as Masand for the Malwa region, marking his forehead with tilak (saffron leadership mark) and entrusting him with a karchha (long spoon) symbolizing langar service. His primary role involved collecting dasvandh (one-tenth offerings), preaching Guru Nanak's teachings, and feeding the poor and needy. He established langars across villages, including Bhai Roopa, where fresh wood miraculously burned like dry wood in the kitchen fires—a blessing from the Guru. Bhai Roop Chand expanded Sikh influence south of the Sutlej, mediating community disputes and promoting ethical living. During Guru Har Rai's 1652 visit to Daroli and Bhai Roopa, he facilitated blessings for the Phulkian family (ancestors of Patiala, Nabha, Jind rulers). He served Guru Tegh Bahadur from 1665, accompanying him on travels, and his sons Dharam Chand and Param Chand joined the Guru's entourage to Assam and Patna, aiding in diffusing enmities among local rulers."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "Bhai Roop Chand's appointment as Masand institutionalized the collection and distribution of offerings for Sikh community welfare, a reform that strengthened the decentralized Sikh sangats during Guru Hargobind's militarized era. He promoted interfaith harmony by converting his family from pir worship to Sikhism and emphasized selfless service (seva) through langar, influencing the Phulkian states' loyalty to Sikh Gurus. His efforts helped establish Sikh presence in Malwa amid Mughal pressures (citationNeeded for specific reform decrees)."
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "N/A. Bhai Roop Chand was primarily a preacher and administrator rather than a scholar-author, though his family later preserved handwritten pothis and a signed pothi from Guru Gobind Singh."
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "Bhai Roop Chand remained in service until at least 1665, participating in Guru Tegh Bahadur's court and ceremonies. He officiated the Anand Karaj (marriage) of young Guru Gobind Singh to Bibi Jeeto Ji at Guru ka Lahore. After the martyrdom of Guru Tegh Bahadur, he supported Guru Gobind Singh during crises, including post-Chamkaur recovery at Deena village, where his family returned Guru Hargobind's gifts and received a personal kirpan. His sons served until Guru Gobind Singh's time at Nanded (1708 AD). Bhai Roop Chand passed away (exact date N/A), but his samadh (memorial) is at Samadh Bhai village, where he was cremated. His seven sons—Dharam Singh, Param Singh, Karam Singh, Mahanand, Sadanand, Surtia, and Sukhia—continued the legacy, populating villages like Dialpura Bhai and Bagrian."
    }
  ],
  "spiritualLegacy": {
    "description": "Bhai Roop Chand's legacy embodies unwavering devotion (bhakti) and seva, transforming a Rajput family into lifelong Sikh stewards. Honored as one of five \"Bhai\" families (alongside Bhagtu, Behlo, Ganga Ram, and Daroli), his lineage preserved over 101 Guru relics, including a signed pothi, gatra kirpan, chariot of Guru Arjan Dev, and hukamnamas, displayed monthly at Bagrian. The family's title \"Bhai Sahib\" signifies spiritual authority, with descendants baptizing thousands, including Phulkian rulers.",
    "keyContributions": [
      "Institutionalized Masand system in Malwa, ensuring equitable dasvandh distribution for gurdwaras and langars.",
      "Exemplified Guru-Sikh bond through the water-offering miracle, inspiring the kirpan tradition (small knife as symbol of trust).",
      "Family's langars fed communities during wars; descendants like Bhai Arjun Singh baptized 25,000 during World War I."
    ]
  },
  "modernRelevance": {
    "description": "The Bagrian family, direct descendants, maintains Bhai Roop Chand's traditions at their fort in Bagrian village (Malerkotla district). They oversee langars, preserve relics, and promote Sikh education, influencing Malwa Sikhs. In contemporary times, they support Panthic organizations like Shiromani Gurdwara Parbandhak Committee.",
    "contemporaryImpact": [
      "Bhai Jujhar Singh (current scion) serves from Bagrian, upholding monthly relic darshan.",
      "Family members like Bhai Hardayal Singh and descendants engage in education, engineering, and Congress politics, blending heritage with modernity.",
      "Relics (e.g., \"flying chariot\" from Ram Rai's era) attract pilgrims, reinforcing Sikh historical continuity (citationNeeded for recent visitor stats)."
    ]
  },
  "achievements": [
    {
      "title": "Title \"Bhai\" Conferred",
      "year": "1630 AD",
      "description": "Honored by Guru Hargobind as spiritual leader of Malwa; foundation of Bhai Roopa village laid.",
      "icon": "👑"
    },
    {
      "title": "Appointment as Masand",
      "year": "1630 AD",
      "description": "Entrusted with karchha for langar; established community kitchens across region.",
      "icon": "🥘"
    },
    {
      "title": "Officiated Anand Karaj",
      "year": "Circa 1669 AD",
      "description": "Performed marriage of Guru Gobind Singh to Bibi Jeeto Ji at Guru ka Lahore.",
      "icon": "💒"
    },
    {
      "title": "Family Relic Preservation",
      "year": "Ongoing (post-1708)",
      "description": "Descendants safeguarded 101+ Guru artifacts, including signed pothi and kirpan from Guru Gobind Singh.",
      "icon": "📜"
    },
    {
      "title": "Influence on Phulkian States",
      "year": "1652–1750s",
      "description": "Mediated blessings leading to Patiala, Nabha, Jind principalities' formation and loyalty.",
      "icon": "🏰"
    }
  ],
  "quotes": [
    {
      "original": "N/A",
      "transliteration": "N/A",
      "translation": "N/A",
      "context": "N/A",
      "source": "No direct quotes attributed; Guru Hargobind's blessing: \"Their word would be more potent than sword\" (paraphrased from devotion incident; SikhiWiki)."
    }
  ],
  "timeline": [
    {
      "year": "~1613",
      "date": "16th Jyeth 1670 Bikrami",
      "event": "Family influenced toward Sikhism via Bibi Surti's meeting with Guru Hargobind.",
      "type": "Personal"
    },
    {
      "year": "~1620s",
      "date": "3rd Baisakh",
      "event": "Birth; named by Guru Hargobind.",
      "type": "Birth"
    },
    {
      "year": "1630",
      "date": "16th Baisakh 1687 Bikrami",
      "event": "Water-offering devotion; Guru's visit; village Bhai Roopa founded; titled \"Bhai\" and appointed Masand.",
      "type": "Milestone"
    },
    {
      "year": "1631",
      "date": "August",
      "event": "Guru Hargobind's three-month stay at Bhai Roopa with 3,000 warriors.",
      "type": "Service"
    },
    {
      "year": "1644",
      "date": "February",
      "event": "Participated in Guru Hargobind's funeral ceremonies at Kiratpur.",
      "type": "Service"
    },
    {
      "year": "1652",
      "date": "",
      "event": "Guru Har Rai's visit; blessings for Phulkian family via mediation.",
      "type": "Service"
    },
    {
      "year": "1665",
      "date": "February",
      "event": "Served Guru Tegh Bahadur; sons accompanied to Assam/Patna.",
      "type": "Service"
    },
    {
      "year": "~1669",
      "date": "",
      "event": "Officiated Guru Gobind Singh's marriage.",
      "type": "Service"
    },
    {
      "year": "~1704–1708",
      "date": "Post-Chamkaur to Nanded",
      "event": "Sons served Guru Gobind Singh; family baptized at Damdama Sahib; returned Guru gifts, received kirpan.",
      "type": "Service"
    },
    {
      "year": "Post-1708",
      "date": "",
      "event": "Sons joined Banda Singh Bahadur against Sirhind; established villages like Dialpura Bhai.",
      "type": "Legacy"
    },
    {
      "year": "1717",
      "date": "",
      "event": "Son Bhai Dharam Singh's death; lineage continues via Bagrian house.",
      "type": "Family"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Hargobind Sahib",
      "relation": "Guru and Appointer",
      "slug": "guru-hargobind"
    },
    {
      "name": "Guru Har Rai",
      "relation": "Guru Served",
      "slug": "guru-har-rai"
    },
    {
      "name": "Guru Tegh Bahadur",
      "relation": "Guru Served",
      "slug": "guru-tegh-bahadur"
    },
    {
      "name": "Guru Gobind Singh",
      "relation": "Guru Served",
      "slug": "guru-gobind-singh"
    },
    {
      "name": "Bhai Dharam Singh",
      "relation": "Son",
      "slug": "bhai-dharam-singh"
    },
    {
      "name": "Baba Banda Singh Bahadur",
      "relation": "Contemporary Ally",
      "slug": "baba-banda-singh-bahadur"
    }
  ],
  "historicalContext": {
    "period": "Early Sikh Gurmukhi era (1590s–1670s), during Guru Hargobind's time amid rising Mughal-Sikh tensions post-Guru Arjan's martyrdom (1606).",
    "politicalSituation": "Mughal Empire under Jahangir and Shah Jahan; Guru Hargobind militarized Sikhs (Miri-Piri doctrine) with akal takht and armies, facing battles like Amritsar (1628). Masands like Bhai Roop Chand countered centralized Islamic rule by fostering autonomous Sikh networks.",
    "socialConditions": "Punjab's Malwa region saw Rajput migrations, interfaith syncretism (e.g., pir worship), and agrarian hardships. Sikhism's emphasis on equality appealed to Jats and Rajputs, but conversions faced resistance.",
    "significance": "Bhai Roop Chand's role expanded Sikhism beyond Punjab heartland, laying groundwork for Malwa's Sikh-majority and Phulkian states' support during later persecutions (e.g., Banda Bahadur's campaigns, 1709–1715)."
  },
  "references": [
    "SikhiWiki: \"Bhai Roop Chand\" (https://www.sikhiwiki.org/index.php/Bhai_Roop_Chand) – Primary source for biography and family history.",
    "Panth Prakash by Rattan Singh Bhangu – Mentions family services.",
    "Guru Bilas Patshahi 6th and 10th – Details Guru interactions.",
    "Twarikh Khalsa by Giani Gian Singh – Historical accounts of Masands.",
    "Brahm Giani Bhai Roop Chand Ji by Pritam Singh Khokhar – Dedicated family history.",
    "Itihas Bagrian by Giani Gian Singh – Bagrian lineage.",
    "Chiefs and Families of Note in the Punjab by Sir Lepel H. Griffin (Vol. I, 1910) – Colonial record of Bagrian house (cross-verified for post-1700s).",
    "Sikh-Heritage.co.uk: \"Bhai Roop Chand\" (http://www.sikh-heritage.co.uk/personalities/Bhai%20Roop%20chand/BRcj.htm) – Additional anecdotes.",
    "Banda Singh Bahadur by Dr. Ganda Singh – References sons' participation.",
    "Unverified: Specific birth/death dates and some relic counts (citationNeeded; based on oral traditions in SikhiWiki). Wikipedia search yielded no dedicated page; cross-checked with Bhai Mani Singh (unrelated)."
  ]
}
