{
  "name": "Bhai Mani Singh",
  "slug": "bhai-mani-singh",
  "category": "Martyrs",
  "birth": "1644-04-07",
  "death": "1738-06-14",
  "birthPlace": "Alipur, Multan, Punjab (now Pakistan)",
  "image": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Bhai_Mani_Singh.jpg",
  "excerpt": "Bhai Mani Singh was an 18th-century Sikh scholar, martyr, and a close companion of Guru Gobind Singh. He played a pivotal role in stewarding Harmandir Sahib during a critical period in Sikh history and is revered for his unwavering faith and ultimate sacrifice.",
  "designation": "Scholar, Martyr, Custodian of Harmandir Sahib",
  "quickStats": [
    {
      "label": "Lifespan",
      "value": "94 years"
    },
    {
      "label": "Sons Martyred",
      "value": "7"
    },
    {
      "label": "Years of Service to Gurus",
      "value": "Approximately 50+"
    }
  ],
  "quickFacts": [
    {
      "label": "Childhood co...",
      "value": "Childhood companion of Guru Gobind Singh."
    },
    {
      "label": "Took Khalsa vows",
      "value": "1699"
    },
    {
      "label": "Appointed custodian of Harmandir Sahib",
      "value": "by Guru Gobind Singh"
    },
    {
      "label": "Martyrdom by dismemberment",
      "value": "A part of daily Sikh Ardas."
    },
    {
      "label": "Teacher at Gianian Bunga",
      "value": "At Amritsari Taksal."
    }
  ],
  "version": {
    "lastUpdated": "2023-10-27T10:00:00Z",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": ""
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "mdi:account-box",
      "value": "Born Mani Ram on April 7, 1644, in Alipur, Multan, Punjab (now Pakistan), to Mai Das and Madharai. He was one of 12 sons. His grandfather, Rao Ballu, was a general in Guru Hargobind's army, indicating a family lineage of warriors and devotion to the Sikh Gurus. At the age of 13, his father took him to Kiratpur to serve Guru Har Rai. He spent two years in service, performing various chores. At 15, he married Seeto Bai. He subsequently served Guru Har Krishan, accompanying him to Delhi. Following Guru Har Krishan's passing, he served Guru Tegh Bahadur at Bakala and later at Anandpur Sahib. His brother, Dayala, was martyred alongside Guru Tegh Bahadur in Delhi."
    },
    {
      "label": "Contributions/Service",
      "icon": "mdi:star-circle",
      "value": "Bhai Mani Singh's service to the Sikh faith spanned across the times of Guru Har Rai, Guru Har Krishan, Guru Tegh Bahadur, and Guru Gobind Singh. He was a close associate and childhood friend of Guru Gobind Singh. He took the vows of Khalsa when it was inaugurated in March 1699. Following the turbulent period after the departure of Guru Gobind Singh, he was sent to Amritsar by the Guru to assume charge of Harmandir Sahib, which had been without a custodian since 1696. He effectively managed the affairs of the holy shrine and played a crucial role in maintaining Sikh traditions and practices during a period of intense persecution. He was also a renowned scholar and teacher, heading the Gianian Bunga (learning Institute), which later became known as the \"Amritsari Taksal.\" His scholarly work included transcribing and compiling Sikh scriptures."
    },
    {
      "label": "Key Reforms",
      "icon": "mdi:format-list-bulleted",
      "value": "Bhai Mani Singh's primary \"reform\" was the restoration of order and proper management at Harmandir Sahib during a chaotic period. He ensured the continued practice of Sikh rituals and the daily services at the Golden Temple, providing a spiritual anchor for the Sikh community when they were dispersed and facing severe oppression."
    },
    {
      "label": "Compositions/Writings",
      "icon": "mdi:book-open-variant",
      "value": "Bhai Mani Singh is credited with transcribing and compiling several important Sikh texts. He is particularly known for compiling the Dasam Granth, the sacred scripture attributed to Guru Gobind Singh, and for his scholarly interpretations and commentaries on Gurbani. His work contributed significantly to the preservation and understanding of Sikh scriptures."
    },
    {
      "label": "Final Years",
      "icon": "mdi:history",
      "value": "During a period of intense persecution by the Mughal authorities, Bhai Mani Singh sought permission from the Mughal governor of Lahore, Zakariya Khan, to hold a Diwali gathering at Harmandir Sahib in 1734, offering to pay a tax for the event. The permission was granted but Zakariya Khan intended to ambush the gathering. Bhai Mani Singh, realizing the governor's treachery, cancelled the gathering to save the lives of the Sikhs. However, he was unable to pay the promised tax. As a result, he was arrested and offered the choice of converting to Islam or facing death. Bhai Mani Singh refused to renounce his faith and was martyred in Lahore in 1738 by being dismembered joint by joint. This brutal act of martyrdom has become an integral part of the daily Sikh Ardas (prayer)."
    }
  ],
  "spiritualLegacy": {
    "description": "Bhai Mani Singh's spiritual legacy is profound, embodying the ideals of unwavering faith, scholarly devotion, and ultimate sacrifice for the Sikh Dharma. His life serves as a beacon of courage and commitment to Sikh principles, particularly during times of extreme adversity.",
    "keyContributions": [
      "Safeguarded and managed Harmandir Sahib, ensuring its sanctity and continuous operation during a challenging era.",
      "Preserved and propagated Sikh scriptures through his scholarly work, including the compilation of the Dasam Granth.",
      "Set an unparalleled example of martyrdom, inspiring countless Sikhs to uphold their faith even in the face of death."
    ]
  },
  "modernRelevance": {
    "description": "Bhai Mani Singh remains a highly revered figure in Sikhism, symbolizing the strength of conviction and the importance of preserving religious and cultural heritage. His story continues to inspire Sikhs worldwide to uphold justice, devotion, and academic pursuit.",
    "contemporaryImpact": [
      "His martyrdom is recited in the daily Sikh Ardas, serving as a constant reminder of the sacrifices made for the faith.",
      "His scholarly contributions are studied and revered, promoting a deeper understanding of Sikh philosophy and history.",
      "His leadership in managing Harmandir Sahib underscores the significance of community service and the protection of sacred institutions."
    ]
  },
  "achievements": [
    {
      "title": "Custodian of Harmandir Sahib",
      "year": "1699",
      "description": "Appointed by Guru Gobind Singh to manage the Golden Temple during a critical period.",
      "icon": "mdi:bank"
    },
    {
      "title": "Scholar and Compiler of Scriptures",
      "year": "Early 18th Century",
      "description": "Played a key role in transcribing and compiling Sikh holy texts, notably the Dasam Granth.",
      "icon": "mdi:book-open-variant"
    },
    {
      "title": "Martyrdom for Faith",
      "year": "1738",
      "description": "Sacrificed his life for his Sikh faith, refusing to convert to Islam.",
      "icon": "mdi:shield"
    }
  ]
}
