{
  "already_exist": false,
  "name": "Bhai Mati Das",
  "slug": "bhai-mati-das",
  "category": "Martyrs",
  "birth": "N/A",
  "death": "1675-11-11",
  "birthPlace": "Karyala, Jhelum District, Punjab region (present-day Pakistan)",
  "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Sikh_martyr_Bhai_Mati_Das_being_executed_by_sawed_in_half_while_alive%2C_detail_of_a_painting_by_the_court_painter_of_the_Maharaja_of_Nabha%2C_circa_19th_century.jpg/800px-Sikh_martyr_Bhai_Mati_Das_being_executed_by_sawed_in_half_while_alive%2C_detail_of_a_painting_by_the_court_painter_of_the_Maharaja_of_Nabha%2C_circa_19th_century.jpg",
  "excerpt": "Bhai Mati Das, a devoted Sikh disciple and Mohyal Brahmin, served as the financial administrator (Diwan) to Guru Tegh Bahadur. He is renowned as one of the earliest Sikh martyrs, executed by being sawn in half in Delhi in 1675 for refusing to convert to Islam under Emperor Aurangzeb's orders, symbolizing unwavering commitment to faith and religious freedom.",
  "designation": "Martyr and Companion of Guru Tegh Bahadur",
  "quickStats": [
    {
      "label": "Family",
      "value": "Mohyal Brahmin (Chhibber clan)"
    },
    {
      "label": "Relation to Guru",
      "value": "Lifelong disciple and administrator"
    },
    {
      "label": "Martyrdom Method",
      "value": "Sawn in half while reciting Japji Sahib"
    },
    {
      "label": "Accompaniments",
      "value": "Executed with brothers Bhai Sati Das and Bhai Dyal Das"
    }
  ],
  "quickFacts": [
    {
      "label": "Ethnic Background",
      "value": "Mohyal Brahmin, converted to Sikhism through family lineage"
    },
    {
      "label": "Key Role",
      "value": "Managed Guru Tegh Bahadur's finances and household during eastern travels"
    },
    {
      "label": "Significance",
      "value": "First of four Sikhs martyred before Guru Tegh Bahadur's execution"
    },
    {
      "label": "Commemoration",
      "value": "Observed annually on Shaheedi Divas (24 November in Sikh calendar)"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-01",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Bhai Mati Das was born into a Mohyal Brahmin family of the Chhibber clan in the village of Karyala, approximately 10 km from Chakwal in the Jhelum District of present-day Pakistan. His family had a long tradition of Sikh devotion: his grandfather, Bhai Praga, was a martyr and Jathedar (leader) under Guru Hargobind, participating in early Sikh-Mughal battles. His father, Hira Nand, was a warrior-disciple of Guru Hargobind and fought in several conflicts before entrusting his sons, Mati Das and his younger brother Sati Das, to Guru Har Rai's care on his deathbed. Raised in a spiritually rich environment near Kiratpur, Mati Das received training in Sikh principles, Persian language, administration, and martial skills. By his youth, he was assisting his uncle Dargah Mall in managing Guru Har Rai's household, demonstrating early administrative acumen. Historical context places his birth in the early 1620s, amid the militarization of Sikhism under Guru Hargobind's leadership in response to Mughal pressures (Reference: Wikipedia; SikhiWiki)."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "Bhai Mati Das's service to the Sikh Gurus spanned multiple generations. Under Guru Har Rai and Guru Har Krishan, he managed household affairs and accompanied Guru Har Krishan to Delhi during his final illness in 1664. After Guru Tegh Bahadur's ascension, Mati Das was appointed Diwan (finance and home minister), handling the Guru's estates, travels, and community welfare. He and his brother Sati Das (who served as cook) joined Guru Tegh Bahadur on extensive eastern tours from 1665–1670, including stops in Saifabad, Dhamtan, Dhaka, and Assam, where they established community kitchens (langars) and wells for the underprivileged. During a 1665 arrest in Dhamtan (possibly influenced by rival claimants like Dhir Mal), Mati Das helped secure their release through diplomatic intervention by Raja Ram Singh of Amber. His role was crucial in founding Chakk Nanaki (later Anandpur Sahib) in 1665, providing administrative stability during the Guru's missions to propagate Sikh teachings amid growing Mughal intolerance (Reference: SikhiWiki; Macauliffe's *The Sikh Religion*)."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "N/A (As a lay disciple rather than a Guru, Bhai Mati Das did not initiate formal reforms; his life exemplified Sikh principles of selfless service (seva) and resistance to tyranny, influencing community organization under Guru Tegh Bahadur)."
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "N/A (No known independent writings; however, during his martyrdom, he recited Japji Sahib, Guru Nanak's foundational composition, underscoring its centrality to Sikh practice)."
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "In 1675, amid Aurangzeb's campaign of forced conversions targeting Kashmiri Pandits and other non-Muslims, Guru Tegh Bahadur traveled to Delhi to protest these atrocities. Bhai Mati Das volunteered to accompany him, along with Bhai Sati Das, Bhai Dyal Das, and Bhai Uday Singh. Arrested en route at Malikpur Rangharan near Ropar, they were imprisoned in Delhi's Kotwali near Chandni Chowk. Interrogated in the Red Fort's council chamber, Mati Das boldly defended the Guru's mission, citing Sikh egalitarianism beyond caste. Refusing conversion, he was the first executed on orders of the Qazi, sawn in half between two pillars while facing the Guru and reciting prayers. His brothers followed: Bhai Sati Das was burned alive, and Bhai Dyal Das boiled. These events preceded Guru Tegh Bahadur's beheading on 11 November 1675, galvanizing Sikh resolve (Reference: Wikipedia; Trilochan Singh's *Guru Tegh Bahadur: Prophet and Martyr*)."
    }
  ],
  "spiritualLegacy": {
    "description": "Bhai Mati Das's martyrdom epitomizes Sikh ideals of dharma yudh (righteous struggle) and sarb dharm (protection of all faiths). His calm recitation of Japji Sahib during torture highlighted the transformative power of Naam Simran (meditation on the Divine Name), inspiring generations to prioritize spiritual integrity over worldly comforts.",
    "keyContributions": [
      "Exemplified unwavering loyalty to the Guru, reinforcing the Sikh doctrine of Guru-Shishya (teacher-disciple) bond.",
      "His sacrifice for the Kashmiri Pandits' religious freedom underscored Sikhism's role as a defender of human rights, influencing later concepts like Miri-Piri (temporal-spiritual balance).",
      "Legacy in Sikh literature: Immortalized in texts like *Sri Gur Panth Prakash* and *Guru Tegh Bahadur: Prophet and Martyr*, where his dialogue with executioners emphasizes faith over fear."
    ]
  },
  "modernRelevance": {
    "description": "In contemporary times, Bhai Mati Das's story resonates as a symbol of resistance against religious persecution and the defense of human rights. His martyrdom is invoked in discussions on secularism, interfaith harmony, and courage in the face of oppression, particularly in India and the Sikh diaspora.",
    "contemporaryImpact": [
      "Inspires Sikh activism in human rights advocacy, such as protests against religious discrimination.",
      "Featured in modern Sikh educational programs to teach resilience and faith-based ethics.",
      "Commemorated in global Sikh events, reinforcing cultural identity and historical pride."
    ]
  },
  "achievements": [
    {
      "title": "Appointment as Diwan",
      "year": "1664",
      "description": "Served as financial administrator under Guru Tegh Bahadur, managing estates and welfare.",
      "icon": ""
    },
    {
      "title": "Eastern Tours and Community Service",
      "year": "1665-1670",
      "description": "Accompanied Guru on tours, establishing langars and wells for the needy.",
      "icon": ""
    },
    {
      "title": "Martyrdom for Faith",
      "year": "1675",
      "description": "Sacrificed life refusing conversion, upholding Sikh principles of religious freedom.",
      "icon": ""
    }
  ],
  "quotes": [
    {
      "original": "ਜਪੁ ਜੀ ਸਾਹਿਬ ਦੀ ਪਾਠ ਕਰਦੇ ਹੋਏ ਸ਼ਹੀਦੀ",
      "transliteration": "Japu Ji Sahib di paath karde hoye shaheedi",
      "translation": "Attained martyrdom while reciting Japji Sahib",
      "context": "During execution, reciting the prayer calmly.",
      "source": "Sikh historical texts"
    },
    {
      "original": "ਮੈਂ ਸਿੱਖ ਹਾਂ, ਧਰਮ ਬਦਲਾਂਗਾ ਨਹੀਂ",
      "transliteration": "Main Sikh haan, dharam badalanga nahin",
      "translation": "I am a Sikh, I will not change my faith",
      "context": "Response to interrogators in Red Fort.",
      "source": "Accounts in *Guru Tegh Bahadur: Prophet and Martyr*"
    }
  ],
  "timeline": [
    {
      "year": "1620s",
      "date": "",
      "event": "Born in Karyala to Mohyal Brahmin family.",
      "type": "Birth"
    },
    {
      "year": "1664",
      "date": "",
      "event": "Appointed Diwan under Guru Tegh Bahadur.",
      "type": "Appointment"
    },
    {
      "year": "1665",
      "date": "",
      "event": "Joined eastern tours and founded Chakk Nanaki.",
      "type": "Service"
    },
    {
      "year": "1675",
      "date": "11-11",
      "event": "Martyred in Delhi by being sawn in half.",
      "type": "Martyrdom"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Tegh Bahadur",
      "relation": "Guru and Companion",
      "slug": "guru-tegh-bahadur"
    },
    {
      "name": "Bhai Sati Das",
      "relation": "Brother",
      "slug": "bhai-sati-das"
    },
    {
      "name": "Bhai Dyal Das",
      "relation": "Brother",
      "slug": "bhai-dyal-das"
    }
  ],
  "historicalContext": {
    "period": "Mughal Empire under Aurangzeb",
    "politicalSituation": "Intensifying religious persecution and forced conversions.",
    "socialConditions": "Oppression of non-Muslims, including Sikhs and Hindus.",
    "significance": "Acts as catalyst for Sikh militarization and resistance movements."
  },
  "references": [
    "Wikipedia: Bhai Mati Das",
    "SikhiWiki: Bhai Mati Das",
    "Macauliffe, Max Arthur. The Sikh Religion.",
    "Trilochan Singh. Guru Tegh Bahadur: Prophet and Martyr."
  ]
}
