{
  "name": "Bhai Taru Singh",
  "slug": "bhai-taru-singh",
  "category": "Martyrs",
  "birth": "c. 1720",
  "death": "1745-07-01",
  "birthPlace": "Poolha, Kasur, Lahore District (now in Amritsar district of Punjab), Mughal Empire",
  "image": "A well-known painting depicting Bhai Taru Singh's martyrdom exists by Kirpal Singh.",
  "excerpt": "Bhai Taru Singh was a revered Sikh martyr from the 18th century, renowned for his unwavering faith and supreme sacrifice. He famously chose to have his scalp removed rather than convert to Islam and cut his hair (keshas), a fundamental tenet of Sikhism. His martyrdom serves as a powerful symbol of resistance against religious persecution and adherence to Sikh principles.",
  "designation": "Sikh Martyr",
  "quickStats": [
    {
      "label": "Martyrdom Age",
      "value": "Approximately 25 years"
    },
    {
      "label": "Significance",
      "value": "Exemplary devotion to Sikh faith"
    },
    {
      "label": "Mughal Governor during Martyrdom",
      "value": "Zakaria Khan"
    }
  ],
  "quickFacts": [
    {
      "label": "Refused to cut his hair",
      "value": "Leading to his scalping"
    },
    {
      "label": "Prophesied Zakaria Khan's death",
      "value": "Which came true"
    },
    {
      "label": "Remembered in Sikh prayers",
      "value": "(Ardas)"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-27",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": ""
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "👶",
      "value": "Bhai Taru Singh was born around 1720 in the village of Poolha, Kasur, Lahore District, during the Mughal Empire. He was raised in a Sandhu Jatt family by his widowed mother, Bibi Dharam Kaur, and had one sister, Tar Kaur. He engaged in agriculture, cultivating a small farm of maize. His upbringing instilled in him strong Sikh values and devotion."
    },
    {
      "label": "Contributions/Service",
      "icon": "🛠️",
      "value": "Bhai Taru Singh dedicated himself to serving the Sikh community. He and his sister provided food and aid to the Gursikhs (devout Sikhs of the Guru), particularly the Sikh revolutionaries who were actively resisting the oppressive rule of the Mughal governor of Punjab, Zakaria Khan. His actions demonstrated immense courage and commitment to supporting his fellow Sikhs in a time of severe persecution."
    },
    {
      "label": "Final Years",
      "icon": "⏳",
      "value": "Bhai Taru Singh's final years were marked by his unwavering stand against Mughal tyranny. He was arrested on charges of treason after an informant (Aqil Das or a mahant, as per different sources) reported his activities to Zakaria Khan. Despite his sister's freedom being secured through a bribe by villagers, Bhai Taru Singh staunchly refused any pardon or compromise on his faith. He endured imprisonment and torture. When brought before Zakaria Khan, he attributed his strength and resilience to his uncut hair (keshas), blessed by Guru Gobind Singh. Enraged, Zakaria Khan ordered his hair to be cut, but when the barber attempted, it reportedly became as strong as iron. Consequently, the emperor commanded that his scalp be removed. Bhai Taru Singh endured this horrific ordeal, famously stating that he rejoiced his hair remained intact. According to Sikh tradition, he cursed Zakaria Khan, predicting his death by his shoes. Khan was subsequently afflicted with unbearable pain and a severe medical condition. Following the advice to hit himself with Bhai Taru Singh's shoes, his condition temporarily improved, but he died 22 days later, fulfilling Bhai Taru Singh's prophecy. Upon hearing of Khan's death, Bhai Taru Singh consciously left his body on July 1, 1745."
    },
    {
      "label": "Spiritual Legacy",
      "icon": "🕉️",
      "value": "Bhai Taru Singh's spiritual legacy is profound, serving as an eternal symbol of unyielding faith, sacrifice, and the sanctity of Sikh identity. His martyrdom underscored the importance of Kesh (unshorn hair) as an inseparable part of a Sikh's spiritual and physical being. His sacrifice inspired countless Sikhs to uphold their religious distinctiveness. Became a revered figure whose name is invoked in the daily Sikh prayer (Ardas), reminding Sikhs of the sacrifices made for their faith."
    },
    {
      "label": "Modern Relevance",
      "icon": "🌍",
      "value": "In the modern era, Bhai Taru Singh's story continues to resonate as a powerful message of religious freedom, human rights, and the strength of conviction in the face of oppression. Inspires Sikhs globally to maintain their distinct identity and stand against injustice. His story is a vital part of Sikh education and heritage, promoting courage and devotion. Has been immortalized in various art forms, including a notable painting by Kirpal Singh and a 3D-animated film (2018), ensuring his legacy endures for future generations."
    }
  ],
  "achievements": [
    {
      "title": "Supreme Martyrdom",
      "year": "1745",
      "description": "Sacrificed his life by having his scalp removed rather than compromising his Sikh faith by cutting his hair, setting an unparalleled example of devotion.",
      "icon": "🙏"
    },
    {
      "title": "Prophetic Vision",
      "year": "1745",
      "description": "Prophesied the demise of the tyrannical Mughal governor Zakaria Khan, which came to pass, highlighting divine justice and his spiritual power.",
      "icon": "✨"
    },
    {
      "title": "Inspiration for Khalsa",
      "year": "18th Century",
      "description": "Became a beacon of courage and resilience for the Khalsa, strengthening their resolve during a period of intense persecution and contributing to the sustained fight for Sikh sovereignty.",
      "icon": "💪"
    },
    {
      "title": "Immortalized in Ardas",
      "year": "Ongoing",
      "description": "His sacrifice is eternally commemorated in the daily Sikh prayer (Ardas), ensuring his memory and the principles he stood for are passed down through generations and remain central to Sikh collective consciousness.",
      "icon": "📜"
    }
  ],
  "quotes": [
    {
      "original": "\"My keshas are a blessing from my Guru, Guru Gobind Singh. You can cut my scalp, but you cannot take away my faith.\"",
      "context": "Spoken to Zakaria Khan when ordered to cut his hair.",
      "source": "Sikh historical accounts (citationNeeded)"
    }
  ],
  "timeline": [
    {
      "year": "c. 1720",
      "date": "",
      "event": "Birth of Bhai Taru Singh in Poolha, Kasur, Lahore District.",
      "type": "Birth"
    },
    {
      "year": "",
      "date": "",
      "event": "Began providing aid and shelter to Sikh revolutionaries during the persecution by Zakaria Khan.",
      "type": "Service"
    },
    {
      "year": "1745",
      "date": "",
      "event": "Arrested by Mughal authorities for treason after being reported by an informant.",
      "type": "Arrest"
    },
    {
      "year": "1745",
      "date": "",
      "event": "Endured torture and refused to convert to Islam or cut his hair.",
      "type": "Persecution"
    },
    {
      "year": "1745",
      "date": "",
      "event": "Had his scalp removed under the orders of Zakaria Khan, choosing death over apostasy.",
      "type": "Martyrdom"
    },
    {
      "year": "1745",
      "date": "July 1st",
      "event": "Passed away voluntarily after outliving Zakaria Khan, who also died on this date due to a divine curse attributed to Bhai Taru Singh.",
      "type": "Death"
    },
    {
      "year": "1762",
      "date": "",
      "event": "The Bhangi Sikh Sardar army conquered Lahore and converted the Abdullah Khan Mosque (adjacent to the site of his martyrdom) into Shaheed Ganj Gurdwara.",
      "type": "Legacy"
    },
    {
      "year": "2018",
      "date": "April 27th",
      "event": "A 3D-animated film about Bhai Taru Singh, directed by Vismaad Singh, was released globally.",
      "type": "Legacy"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Zakaria Khan",
      "relation": "Mughal Governor who ordered Bhai Taru Singh's martyrdom",
      "slug": "zakaria-khan"
    },
    {
      "name": "Bibi Dharam Kaur",
      "relation": "Mother of Bhai Taru Singh",
      "slug": "bibi-dharam-kaur"
    },
    {
      "name": "Tar Kaur",
      "relation": "Sister of Bhai Taru Singh",
      "slug": "tar-kaur"
    },
    {
      "name": "Guru Gobind Singh",
      "relation": "Sikh Guru whose teachings inspired Bhai Taru Singh",
      "slug": "guru-gobind-singh"
    },
    {
      "name": "Kirpal Singh",
      "relation": "Artist known for depicting Bhai Taru Singh's martyrdom",
      "slug": "kirpal-singh"
    }
  ],
  "historicalContext": {
    "period": "Mid-18th Century (approximately 1720-1745)",
    "politicalSituation": "Intense persecution of Sikhs by the Mughal Empire, especially under Zakaria Khan in Punjab. The Mughals aimed to eradicate Sikhism, leading to widespread arrests, torture, and executions of Sikhs who refused to abandon their faith.",
    "socialConditions": "Sikhs faced severe social and religious discrimination. Practices like maintaining uncut hair were met with brutal repression, but the Sikh resistance movement grew strong, often operating in hiding or in bands challenging Mughal authority.",
    "significance": "Bhai Taru Singh's martyrdom is a pivotal event in Sikh history, symbolizing the ultimate sacrifice for religious freedom and identity. His unwavering commitment inspired the Sikh community, contributing to the rise of Sikh sovereignty in Punjab."
  },
  "references": [
    "SikhiWiki: Bhai Taru Singh",
    "Wikipedia: Bhai Taru Singh",
    "SikhNet: Shaheed Bhai Taru Singh ~ in Memoriam",
    "SikhNet: Time to Help Vismaad",
    "Wikipedia: Gurdwara Shaheed Bhai Taru Singh",
    "Ratan Singh Bhangu, *Prachin Panth Prakash*"
  ]
}
