{
  "already_exist": false,
  "name": "Bhai Mati Das",
  "slug": "bhai-mai-das",
  "category": "Martyrs",
  "birth": "Circa 1620",
  "death": "1675-11-09",
  "birthPlace": "Karyala, Jhelum District (present-day Punjab, Pakistan)",
  "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Mati_Das.jpg/220px-Mati_Das.jpg",
  "excerpt": "Bhai Mati Das was a devoted Sikh companion of Guru Tegh Bahadur, renowned for his unwavering loyalty and martyrdom. He was executed by being sawn in half while reciting Sikh scriptures, symbolizing supreme sacrifice for faith.",
  "designation": "Diwan (financial administrator) to Guru Tegh Bahadur; member of the Chhibber Brahmin clan.",
  "quickStats": [
    {
      "label": "Role",
      "value": "Devoted Sikh and administrator"
    },
    {
      "label": "Affiliation",
      "value": "Ninth Sikh Guru, Guru Tegh Bahadur"
    },
    {
      "label": "Notable For",
      "value": "Martyrdom alongside Guru Tegh Bahadur in 1675"
    },
    {
      "label": "Family",
      "value": "Son of Hira Nand; brother to Bhai Sati Das; uncle/relative connections to other Sikh figures"
    }
  ],
  "quickFacts": [
    {
      "label": "Ethnicity",
      "value": "Mohyal Brahmin (Chhibber clan)"
    },
    {
      "label": "Key Event",
      "value": "Sawn alive between two pillars in Delhi for refusing to convert to Islam"
    },
    {
      "label": "Legacy",
      "value": "One of the Panj Pyare-like companions; his sacrifice inspired Sikh resistance against Mughal persecution"
    },
    {
      "label": "Associated Gurdwaras",
      "value": "Gurdwara Sis Ganj Sahib, Delhi (site of martyrdom)"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-01",
    "version": "1.0",
    "contributors": 3,
    "edits": 1,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Bhai Mati Das was born into a Mohyal Brahmin family of the Chhibber clan in the village of Karyala, near Chakwal in the Jhelum District (now in Pakistan). His grandfather, Bhai Praga, was a devoted Sikh who fought alongside Guru Hargobind in early Sikh-Mughal conflicts and attained martyrdom. His father, Hira Nand, was a warrior-disciple under Guru Hargobind and participated in several battles before entrusting his sons, Mati Das and Sati Das, to the care of Guru Har Rai shortly before his death. From a young age, Bhai Mati Das served in the Guru's household, performing menial tasks and imbibing Sikh principles of equality, devotion, and courage. He and his brother accompanied Guru Har Krishan to Delhi during the emperor's summons, demonstrating early loyalty amid political tensions under Mughal rule."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "Bhai Mati Das served as the Diwan (chief financial officer) for Guru Tegh Bahadur, managing the Guru's resources and administration after the Guru's ascension in 1664. He accompanied the Guru on extensive preaching tours across eastern India, including Assam, from 1665 to 1670. During these journeys, he assisted in establishing Sikh centers and providing aid to communities facing famine and Mughal oppression. In 1670, after Guru Tegh Bahadur founded Anandpur Sahib (then Chakk Nanaki), Bhai Mati Das helped in its development as a Sikh stronghold. His role extended to diplomatic and logistical support, ensuring the Guru's message of religious freedom reached persecuted groups, particularly Kashmiri Pandits threatened with forced conversion to Islam by Emperor Aurangzeb. Cross-verified from SikhiWiki and Wikipedia: He was imprisoned briefly in 1665 at Dhamtan due to local opposition but was released through intervention."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "As Diwan, Bhai Mati Das implemented equitable resource distribution in line with Sikh ideals, breaking caste barriers by serving all equally. He supported Guru Tegh Bahadur's advocacy for human rights, particularly defending non-Muslims against religious coercion. His life exemplified the rejection of caste hierarchy, as a Brahmin serving a Sikh Guru without regard for traditional distinctions."
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "N/A (No known independent writings; however, he is remembered for reciting Japji Sahib during his execution, embodying oral Sikh tradition)."
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "In 1675, Guru Tegh Bahadur traveled to Delhi at the request of Kashmiri Pandits facing forced conversions. Bhai Mati Das, along with Bhai Sati Das, Bhai Dayala, and others, volunteered to accompany him, knowing the risks under Aurangzeb's reign. Arrested en route at Malikpur Rangharan, they were imprisoned in Delhi's Red Fort. Despite torture, Bhai Mati Das refused to renounce Sikhism, leading to his execution on November 9, 1675 (two days before the Guru's martyrdom)."
    }
  ],
  "spiritualLegacy": {
    "description": "Bhai Mati Das's life and death underscore the Sikh commitment to dharam yudh (righteous struggle) against tyranny. His calm recitation of Gurbani amid brutality highlighted the power of Naam Simran (meditation on God's name) in facing adversity, influencing Sikh theology on martyrdom (shaheedi) as a path to spiritual elevation.",
    "keyContributions": [
      "Exemplified loyalty by prioritizing Sikh faith over personal comfort, inspiring generations of Sikhs in times of persecution.",
      "Supported the establishment of Anandpur Sahib as a center for Sikh learning and resistance.",
      "His family's legacy, including relatives like Bhai Mani Singh (a later scholar-martyr), perpetuated Sikh scholarship and activism.]},",
      "modernRelevance={",
      "description",
      "In contemporary times, Bhai Mati Das symbolizes resilience against religious intolerance, relevant in discussions on human rights and minority protections. His story is invoked in Sikh commemorations like Shaheedi Week, emphasizing non-violent resistance.",
      "contemporaryImpact",
      "- Influences Sikh activism in global diaspora communities advocating for freedom of religion.",
      "- Featured in educational curricula and media to highlight historical injustices under Mughal rule and parallels to modern oppression.",
      "- Gurdwaras worldwide, such as Sis Ganj Sahib in Delhi, host annual events honoring his sacrifice, fostering community unity."
    ]
  },
  "achievements": [
    {
      "title": "Appointment as Diwan",
      "year": "1664",
      "description": "Trusted financial administrator under Guru Tegh Bahadur for eastern tours.",
      "icon": "🏛️"
    },
    {
      "title": "Martyrdom for Faith",
      "year": "1675",
      "description": "Executed by sawing; refused conversion, reciting Japji Sahib to the end.",
      "icon": "⚔️"
    },
    {
      "title": "Family Legacy Builder",
      "year": "N/A",
      "description": "Fathered or related to prominent Sikhs, contributing to 18th-century revival.",
      "icon": "👨‍👩‍👧‍👦"
    }
  ],
  "quotes": [
    {
      "original": "Sir jaave ta jaave, par meri Sikhi sidq na jaave",
      "transliteration": "Sir jāve tā jāve, par merī Sikhī sidak nā jāve.",
      "translation": "Though my head may be severed, my faith in Sikhism shall remain unshaken.",
      "context": "Spoken during interrogation by Mughal authorities, refusing to convert to Islam despite threats of torture.",
      "source": "Oral tradition in Sikh historical accounts; referenced in Bhai Santokh Singh's *Sri Gur Pratap Suraj Granth* [citation needed]."
    },
    {
      "original": "Ek Onkar, Sat Naam... (recitation of Japji Sahib during execution).",
      "transliteration": "Ek ōṅkār, sat nāma...",
      "translation": "One Universal Creator God, Truth is His Name...",
      "context": "Uttered calmly as he was sawn in half, facing Guru Tegh Bahadur, demonstrating spiritual equanimity.",
      "source": "Guru Granth Sahib (Japji Sahib); historical narratives in Macauliffe's *The Sikh Religion*."
    }
  ],
  "timeline": [
    {
      "year": "1620",
      "date": "N/A",
      "event": "Born in Karyala to Hira Nand, a warrior-disciple of Guru Hargobind.",
      "type": "Personal"
    },
    {
      "year": "1661",
      "date": "N/A",
      "event": "Accompanies Guru Har Krishan to Delhi; early service amid Mughal tensions.",
      "type": "Service"
    },
    {
      "year": "1664",
      "date": "30-Mar",
      "event": "Serves Guru Tegh Bahadur post-Guru Har Krishan's passing; appointed Diwan.",
      "type": "Leadership"
    },
    {
      "year": "1665",
      "date": "Aug-Dec",
      "event": "Joins eastern preaching tours; arrested at Dhamtan but released.",
      "type": "Travel"
    },
    {
      "year": "1670",
      "date": "N/A",
      "event": "Assists in founding Anandpur Sahib (Chakk Nanaki).",
      "type": "Establishment"
    },
    {
      "year": "1675",
      "date": "Jul",
      "event": "Accompanies Guru to Delhi for Kashmiri Pandits' cause; arrested.",
      "type": "Martyrdom"
    },
    {
      "year": "1675",
      "date": "9-Nov",
      "event": "Executed by being sawn alive in Chandni Chowk, Delhi.",
      "type": "Martyrdom"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Tegh Bahadur",
      "relation": "Guru and Companion",
      "slug": "guru-tegh-bahadur"
    },
    {
      "name": "Bhai Sati Das",
      "relation": "Brother",
      "slug": "bhai-sati-das"
    },
    {
      "name": "Bhai Dayala",
      "relation": "Companion Martyr",
      "slug": "bhai-dayala"
    },
    {
      "name": "Bhai Mani Singh",
      "relation": "Relative (nephew or distant kin via family)",
      "slug": "bhai-mani-singh"
    },
    {
      "name": "Hira Nand",
      "relation": "Father",
      "slug": "N/A"
    }
  ],
  "historicalContext": {
    "period": "Late 17th century Mughal Empire under Aurangzeb (1658–1707), marked by aggressive Islamization policies.",
    "politicalSituation": "Aurangzeb's reign saw intensified persecution of non-Muslims, including forced conversions, jizya tax, and temple destructions. Kashmiri Pandits sought Guru Tegh Bahadur's intervention, leading to the group's arrest.",
    "socialConditions": "Caste rigidities persisted, but Sikhism promoted equality via langar and seva. Mohyal Brahmins like Mati Das's clan balanced Vedic traditions with Sikh egalitarianism, facing dual pressures from society and state.",
    "significance": "The martyrdoms of Bhai Mati Das and companions galvanized Sikh identity, paving the way for militarization under Guru Gobind Singh and the Khalsa formation in 1699. It highlighted Sikhism's role as a defender of all faiths against tyranny."
  },
  "references": [
    "Wikipedia: \"Bhai Mati Das\" (accessed via API, 2023) - Primary biographical details and timeline.",
    "SikhiWiki: \"Bhai Mati Das\" (https://www.sikhiwiki.org/index.php/Bhai_Mati_Das) - Detailed account of early life, service, and martyrdom; cross-verified with family history.",
    "Macauliffe, Max Arthur. *The Sikh Religion: Its Gurus, Sacred Writings and Authors* (Oxford, 1909) - Historical context and quotes.",
    "Trilochan Singh. *Guru Tegh Bahadur: Prophet and Martyr* (Delhi, 1967) - Analysis of loyalty and reforms.",
    "Harbans Singh. *Guru Tegh Bahadur* (Delhi, 1989) - Contributions during eastern tours.",
    "Bhai Santokh Singh. *Sri Gur Pratap Suraj Granth* (Amritsar, 1927–35) - Oral traditions and dialogues [citation needed for specific variants].",
    "Giani Gian Singh. *Sri Gur Panth Prakash* (Patiala, 1970) - Martyrdom sequence.",
    "Research_For_Personality tool (queried 2023) - Supplementary family connections (e.g., to Bhai Mani Singh)."
  ]
}
