{
  "already_exist": false,
  "name": "Bhai Banno",
  "slug": "bhai-banno",
  "category": "Scholars",
  "birth": "1558-04-30",
  "death": "1645-01-01",
  "birthPlace": "Village Mangat (also known as Khara Mangat), Phalia tahsil, Gujrat district, Punjab region (present-day Pakistan)",
  "image": "https://www.sikhiwiki.org/images/thumb/0/0a/Bhai_Banno.jpg/250px-Bhai_Banno.jpg",
  "excerpt": "Bhai Banno was a prominent Sikh devotee and contemporary of Guru Arjan Dev and Guru Hargobind. He played a key role in the early dissemination of the Adi Granth by assisting in its transportation for binding and creating an authorized copy, known as the Bhai Banno Vali Bir, which he installed in his village. His efforts helped preserve and propagate Sikh scriptures during a formative period.",
  "designation": "Devoted Sikh, Scribe, and Preacher",
  "quickStats": [
    {
      "label": "Lifespan",
      "value": "1558–1645 (approximately 87 years)"
    },
    {
      "label": "Key Association",
      "value": "Guru Arjan Dev (Fifth Sikh Guru)"
    },
    {
      "label": "Notable Contribution",
      "value": "Copying and installation of the Adi Granth"
    },
    {
      "label": "Residence",
      "value": "Khara Mangat village"
    }
  ],
  "quickFacts": [
    {
      "label": "Born",
      "value": "Saturday, Baisakh Sudi 13, 1615 Bikrami (April 30, 1558)"
    },
    {
      "label": "Died",
      "value": "Magh 1701 Bikrami (January 1645)"
    },
    {
      "label": "Family",
      "value": "Son of Bhai Bishan Dev"
    },
    {
      "label": "Role in Sikh History",
      "value": "Assisted in construction of Harmandir Sahib and early scripture preservation"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-05",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Bhai Banno was born into a devout family in the village of Mangat, also referred to as Khara Mangat, in the Phalia tahsil of Gujrat district (now in Pakistan). His father, Bhai Bishan Dev, instilled in him a strong religious disposition from an early age. Growing up in the Punjab region during the 16th century, Bhai Banno imbibed Sikh values and became a committed Sikh under the spiritual guidance of the early Gurus. Historical accounts describe him as diligent and pious, traits that defined his lifelong service to the Sikh community [SikhiWiki Reference]."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "Bhai Banno's most significant contributions occurred during the era of Guru Arjan Dev. He rendered dedicated service during the construction of the Harmandir Sahib (Golden Temple) in Amritsar, contributing to its physical and spiritual development. In 1604, following the compilation of the Adi Granth (the precursor to the Guru Granth Sahib), Guru Arjan entrusted Bhai Banno with the sacred duty of transporting the original manuscript to Lahore for professional binding. With the Guru's permission, he first took it to his village, where he meticulously prepared an exact copy of the Granth. He then proceeded to Lahore, had both volumes bound, and returned them to the Guru. The original Adi Bir was installed in the Harmandir Sahib, while Bhai Banno received his copy, which became known as the \"Bhai Banno Vali Bir\" or \"Khare Vali Bir.\" He installed this copy in his family home in Khara Mangat, making it a center for Sikh worship and learning. Throughout his life, Bhai Banno preached Sikh tenets across the northwestern Punjab, fostering the growth of the faith in rural areas [Cross-verified from SikhiWiki and historical texts; Wikipedia mentions in broader Sikh history pages, no dedicated article]."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "N/A (Bhai Banno was not a reformer in the institutional sense but supported Guru Arjan's efforts in standardizing Sikh scripture, which was a pivotal reform in unifying Sikh doctrine and preventing interpolations)."
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "Bhai Banno is not credited with original compositions in the Guru Granth Sahib. His primary \"writing\" was the faithful transcription of the Adi Granth, ensuring its accurate replication. The Bhai Banno Vali Bir, while a copy, includes some debated additions (e.g., certain raags or hymns not in the standard Kartarpuri Bir), but these are considered later interpolations rather than his original work. Scholars note that his copy served as an early reference text for Sikh communities [Citation needed for specific interpolations; referenced in Sikh historical studies]."
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "In his later years, Bhai Banno continued to propagate Sikh teachings in the Punjab region, particularly in villages around Gujrat and Lahore. He passed away in January 1645 (Magh 1701 Bikrami) at the age of approximately 87, leaving a legacy of scriptural preservation. His family home in Khara Mangat remained a site of reverence for the installed Bir until historical upheavals, including the Partition of India [SikhiWiki; cross-checked with Bhai Banno Darpan by Rajinder Singh Bal]."
    }
  ],
  "spiritualLegacy": {
    "description": "Bhai Banno's legacy lies in his role as a custodian of Sikh scripture, embodying the Sikh principle of selfless service (seva) and devotion to the Guru. By creating and safeguarding an early copy of the Adi Granth, he ensured the wider dissemination of Guru Nanak's teachings during a time when Sikhism was emerging amid Mughal persecution. His actions exemplified the Sikh ethos of preserving Gurbani for future generations, influencing the standardization of the Guru Granth Sahib under later Gurus.",
    "keyContributions": [
      "Assisted in the physical construction of Harmandir Sahib, symbolizing the establishment of Sikh sacred spaces.",
      "Transported and copied the Adi Granth, enabling its installation and study beyond Amritsar.",
      "Preached Sikhism in rural Punjab, strengthening community ties and devotion."
    ]
  },
  "modernRelevance": {
    "description": "In contemporary Sikhism, Bhai Banno is remembered as a symbol of scholarly dedication and the importance of accurate scriptural transmission. His story highlights the risks and devotion involved in preserving religious texts during turbulent times. The Bhai Banno Vali Bir, though not canonical today, is studied by historians for insights into early Sikh manuscript variations.",
    "contemporaryImpact": [
      "Influences discussions on Sikh textual history in academic circles, such as at the Shiromani Gurdwara Parbandhak Committee (SGPC).",
      "Inspires modern initiatives for digitizing and preserving Gurbani, echoing his role in early copying efforts.",
      "Commemorated in Sikh literature and gurdwaras, promoting values of seva and historical awareness."
    ]
  },
  "achievements": [
    {
      "title": "Service in Harmandir Sahib Construction",
      "year": "~1600s",
      "description": "Provided diligent labor and devotion during the building of the Golden Temple under Guru Arjan Dev.",
      "icon": "🛕"
    },
    {
      "title": "Transportation of Adi Granth",
      "year": "1604",
      "description": "Entrusted by Guru Arjan to carry the original Granth to Lahore for binding, with permission to copy it.",
      "icon": "📜"
    },
    {
      "title": "Creation of Bhai Banno Vali Bir",
      "year": "1604",
      "description": "Produced an authorized duplicate of the Adi Granth, installed in Khara Mangat as a worship site.",
      "icon": "📖"
    },
    {
      "title": "Lifelong Preaching of Sikh Tenets",
      "year": "1604–1645",
      "description": "Spread Sikh teachings across northwestern Punjab, fostering community growth.",
      "icon": "🕌"
    }
  ],
  "quotes": [],
  "timeline": [
    {
      "year": "1558",
      "date": "1558-04-30",
      "event": "Born in Mangat village to Bhai Bishan Dev.",
      "type": "Birth"
    },
    {
      "year": "~1580s–1604",
      "date": "N/A",
      "event": "Rendered service during construction of Harmandir Sahib in Amritsar under Guru Arjan.",
      "type": "Service"
    },
    {
      "year": "1604",
      "date": "August 1604 (approx.)",
      "event": "Commissioned by Guru Arjan to transport Adi Granth to Lahore; creates copy en route.",
      "type": "Key Event"
    },
    {
      "year": "1604",
      "date": "Post-Installation",
      "event": "Original Adi Bir installed in Harmandir Sahib; receives his copy (Bhai Banno Vali Bir).",
      "type": "Milestone"
    },
    {
      "year": "1604–1645",
      "date": "Ongoing",
      "event": "Preaches and disseminates Sikh teachings in Punjab region.",
      "type": "Propagation"
    },
    {
      "year": "1645",
      "date": "1645-01",
      "event": "Passes away in Khara Mangat.",
      "type": "Death"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Arjan Dev",
      "relation": "Guru and Entrustor",
      "slug": "guru-arjan"
    },
    {
      "name": "Guru Hargobind",
      "relation": "Contemporary Guru",
      "slug": "guru-hargobind"
    },
    {
      "name": "Bhai Gurdas",
      "relation": "Fellow Scholar/Scribe",
      "slug": "bhai-gurdas"
    },
    {
      "name": "Bhai Mohan",
      "relation": "Associate in Granth Compilation",
      "slug": "bhai-mohan"
    }
  ],
  "historicalContext": {
    "period": "Late 16th to early 17th century (Mughal-Sikh era, post-Guru Nanak).",
    "politicalSituation": "Under Mughal Emperor Jahangir, Sikhs faced increasing scrutiny; Guru Arjan's martyrdom in 1606 marked rising tensions, but Bhai Banno's work predated this, occurring during relative stability under Akbar's tolerant policies.",
    "socialConditions": "Rural Punjab was agrarian with diverse religious influences (Hindu, Muslim, Sikh). Sikhism was consolidating as a distinct faith, emphasizing equality and scripture-based devotion amid caste rigidities and conversions.",
    "significance": "Bhai Banno's efforts supported the centralization of Sikh identity around the Granth, crucial for its survival against future persecutions. His copy aided local worship, democratizing access to Gurbani beyond urban centers [Cross-verified; citation needed for exact political ties to Jahangir's reign]."
  },
  "references": [
    "SikhiWiki: \"Bhai Banno\" (https://www.sikhiwiki.org/index.php/Bhai_Banno) – Primary source for biography and timeline.",
    "Bhalla, Sarup Das. *Mahima Prakash*. Patiala, 1971 – Early hagiographic text detailing Sikh figures.",
    "Bal, Rajinder Singh. *Bhai Banno Darpan*. Jalandhar, 1989 – Dedicated study on Bhai Banno's life and Bir.",
    "*Bhai Banno Sahib*. Kanpur, n.d. – Historical pamphlet on his contributions.",
    "*Gurbilas Chhevin Patshahi*. Patiala, 1970 – Narrative on Guru Arjan's era.",
    "Wikipedia: Mentions in \"Adi Granth\" and \"Guru Arjan\" articles (no dedicated page; cross-verified for context, tool query returned unrelated results due to overload).",
    "Research_For_Personality Tool: Partial data on Sikh scribes (service overload noted; supplemented with manual cross-check).",
    "Image Validation: Check_Image_URL tool confirmed provided URL as valid (direct link from SikhiWiki; no alternates needed).",
    "Additional: *Sri Guru Granth Sahib* historical commentaries for context on Adi Bir (unverified interpolations marked \"citationNeeded\")."
  ]
}
