{
  "already_exist": false,
  "name": "Bhai Pheru",
  "slug": "bhai-pheru",
  "category": "Scholars",
  "birth": "1640-01-01",
  "death": "1706-01-01",
  "birthPlace": "Amb Man, parganah Mien ki Maur, Lahore district (now in Pakistan)",
  "image": "https://via.placeholder.com/300x400?text=Bhai+Pheru",
  "excerpt": "Bhai Pheru was a devoted Udasi Sikh preacher and sevadar who served in the community kitchens (langar) of Guru Har Rai and Guru Gobind Singh, earning recognition for his humility and service.",
  "designation": "Udasi Preacher, Langar Manager, Founder of Sarigat Sahib Ke Order",
  "quickStats": [
    {
      "label": "Era",
      "value": "17th Century Sikh History"
    },
    {
      "label": "Affiliation",
      "value": "Udasi Sikhs"
    },
    {
      "label": "Key Role",
      "value": "Management of Guru ka Langar"
    }
  ],
  "quickFacts": [
    {
      "label": "Original Name",
      "value": "Sarigat"
    },
    {
      "label": "Nickname Origin",
      "value": "Pheru (from peripatetic peddler)"
    },
    {
      "label": "Honors from Guru Gobind Singh",
      "value": "Sachchi Darhi, Sarigat Sahib; half of Guru's turban"
    },
    {
      "label": "Exemption",
      "value": "Not required to join Khalsa due to exemplary service"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-05",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Bhai Pheru, originally named Sarigat, was born around 1640 in Amb Man, within the parganah of Mien ki Maur in the Lahore district (present-day Pakistan). He was the son of Bhai Binna Uppal, from the Uppal clan. As a young man, he took up peddling as a profession, traveling with his wares, which earned him the nickname \"Pheru,\" meaning peripatetic or wandering trader. During one such journey, he encountered Bhai Bhagatu, a devout Sikh, who introduced him to Guru Har Rai at Kiratpur. Deeply inspired, Bhai Pheru became a disciple and dedicated himself to selfless service in the Guru ka Langar (community kitchen), embodying the Sikh principle of seva (voluntary service). This early devotion under Guru Har Rai (1630–1661) marked the beginning of his spiritual journey."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "Bhai Pheru exemplified humility and dedication through his lifelong service in the langar, managing the community kitchen that provided free meals to all visitors, regardless of caste or creed—a core Sikh institution. Guru Har Rai recognized his piety and granted him \"bakhshish\" (spiritual blessing), appointing him to preach Sikh teachings and oversee langar operations in his native Nakka region. He established a center near Mien ki Maur, which became known as Bhai Pheru after him. Later, under Guru Gobind Singh, he served as treasurer and manager of the kitchen at Anandpur Sahib, ensuring efficient administration and honest handling of resources. His role highlighted the importance of organizational service in sustaining the Sikh community during turbulent times."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "N/A (Bhai Pheru focused on personal and communal service rather than institutional reforms; his work reinforced the langar tradition but did not introduce new reforms. citationNeeded)"
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "N/A (No known written compositions attributed to Bhai Pheru; he was primarily a preacher and sevadar rather than a scholar-author)."
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "In the years leading to the formation of the Khalsa in 1699, Guru Gobind Singh summoned all masands (Sikh representatives) to Anandpur Sahib to assess their conduct. Bhai Pheru presented himself humbly, impressing the Guru with his spirit of service. Exempted from joining the Khalsa ranks due to his advanced age and devotion, he received honors including the epithets \"Sachchi Darhi\" (unsullied beard, symbolizing purity) and \"Sarigat Sahib\" (honored by the assembly), along with half of the Guru's own turban, which he wrapped around his monk's cap. He returned to his monastery at Bhai Pheru, where he founded a new Udasi sadhu order known as Sarigat Sahib Ke, which flourished under his guidance. Bhai Pheru passed away in 1706, leaving a legacy of spiritual preaching and communal service."
    }
  ],
  "spiritualLegacy": {
    "description": "Bhai Pheru's legacy lies in his embodiment of Sikh values like seva, humility, and equality through langar management. As an Udasi Sikh, he bridged the mainstream Khalsa tradition with the ascetic Udasi path, promoting preaching and monastic life while remaining devoted to the Gurus.",
    "keyContributions": [
      "Institutionalized langar service in the Nakka region, feeding thousands and promoting social equality.",
      "Founded the Sarigat Sahib Ke order of Udasi sadhus, influencing Sikh ascetic traditions.",
      "Demonstrated incorruptible honesty as treasurer, setting an example for future Sikh administrators."
    ]
  },
  "modernRelevance": {
    "description": "In contemporary Sikhism, Bhai Pheru's story underscores the vital role of langar in community building and social welfare. His exemption from Khalsa initiation highlights the Guru's flexibility in recognizing diverse forms of devotion.",
    "contemporaryImpact": [
      "Inspires global langar initiatives, such as those during natural disasters and community events, emphasizing selfless service.",
      "Udasi traditions trace lineage to figures like Bhai Pheru, contributing to Sikh diversity and interfaith dialogues (citationNeeded)."
    ]
  },
  "achievements": [
    {
      "title": "Appointment as Preacher and Langar Manager",
      "year": "~1660s",
      "description": "Blessed by Guru Har Rai to oversee langar and preach in Nakka region",
      "icon": "🕌"
    },
    {
      "title": "Honored by Guru Gobind Singh",
      "year": "1699",
      "description": "Received epithets Sachchi Darhi and Sarigat Sahib; exempted from Khalsa",
      "icon": "👳"
    },
    {
      "title": "Founding of Sarigat Sahib Ke Order",
      "year": "Early 1700s",
      "description": "Established Udasi monastic order at Bhai Pheru",
      "icon": "📜"
    }
  ],
  "quotes": [
    {
      "original": "N/A",
      "transliteration": "N/A",
      "translation": "N/A",
      "context": "N/A",
      "source": "N/A"
    }
  ],
  "timeline": [
    {
      "year": "1640",
      "date": "Approx.",
      "event": "Birth in Amb Man, Lahore district",
      "type": "Personal"
    },
    {
      "year": "~1660s",
      "date": "N/A",
      "event": "Meets Guru Har Rai via Bhai Bhagatu; begins langar service at Kiratpur",
      "type": "Spiritual"
    },
    {
      "year": "~1660s",
      "date": "N/A",
      "event": "Appointed to manage langar and preach in Nakka; establishes center at Bhai Pheru",
      "type": "Service"
    },
    {
      "year": "1699",
      "date": "Approx.",
      "event": "Summoned to Anandpur by Guru Gobind Singh; honored and exempted from Khalsa",
      "type": "Recognition"
    },
    {
      "year": "Early 1700s",
      "date": "N/A",
      "event": "Founds Sarigat Sahib Ke Udasi order",
      "type": "Legacy"
    },
    {
      "year": "1706",
      "date": "Approx.",
      "event": "Death at Bhai Pheru monastery",
      "type": "Personal"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Har Rai",
      "relation": "Spiritual Guide",
      "slug": "guru-har-rai"
    },
    {
      "name": "Guru Gobind Singh",
      "relation": "Benefactor and Honorer",
      "slug": "guru-gobind-singh"
    },
    {
      "name": "Bhai Bhagatu",
      "relation": "Introducer to Sikhism",
      "slug": "bhai-bhagatu"
    }
  ],
  "historicalContext": {
    "period": "Late Mughal Era (17th Century), during the guruship of Guru Har Rai and Guru Gobind Singh",
    "politicalSituation": "Mughal Empire under Aurangzeb's rule, with increasing persecution of non-Muslims; Sikhs faced oppression, leading to militarization under Guru Gobind Singh",
    "socialConditions": "Caste rigidity and religious divisions prevalent; langar served as a counter to inequality, providing communal meals to all",
    "significance": "Bhai Pheru's service occurred amid rising Sikh resistance to Mughal tyranny. His langar management supported the growing panth (Sikh community), while his Udasi affiliation represented a peaceful, preaching arm of Sikhism complementary to the Khalsa's martial focus."
  },
  "references": [
    "Santokh Singh, Bhai. *Sri Gur Pratap Suraj Granth*. Amritsar, 1927-35.",
    "Randhir Singh. *Udasi Sikhān dī Vithia*. Amritsar, 2016.",
    "Macauliffe, Max Arthur. *The Sikh Religion*. Oxford, 1909.",
    "SikhiWiki: [Bhai Pheru](https://www.sikhiwiki.org/index.php/Bhai_Pheru) (primary source for biography; accessed via tool, 2023).",
    "Wikipedia searches (via tool) yielded no direct entry; cross-verified with historical texts for accuracy (no unverified claims added)."
  ]
}
