{
  "already_exist": false,
  "name": "Bibi Amro",
  "slug": "bibi-amro",
  "category": "Guru Family",
  "birth": "1532",
  "death": "",
  "birthPlace": "Khadur, Punjab, India",
  "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/No_image_available.svg/200px-No_image_available.svg.png",
  "excerpt": "Bibi Amro, daughter of Guru Angad Dev and Mata Khivi, played a pivotal role in the early development of Sikhism by introducing her uncle-by-marriage, Amar Das, to the teachings of Guru Nanak through her recitation of Gurbani. She later served as a preacher heading one of the 22 Manjis established by Guru Amar Das, contributing significantly to the spread of Sikh teachings in the Punjab region.",
  "designation": "Sikh Preacher and Educator",
  "quickStats": [
    {
      "label": "Born",
      "value": "1532, Khadur Sahib"
    },
    {
      "label": "Family",
      "value": "Daughter of Guru Angad Dev (2nd Sikh Guru) and Mata Khivi"
    },
    {
      "label": "Spouse",
      "value": "Bhai Jaso (son of Bhai Manak Chand)"
    },
    {
      "label": "Notable Role",
      "value": "Head of a Manji under Guru Amar Das"
    }
  ],
  "quickFacts": [
    {
      "label": "Influence",
      "value": "Influenced Guru Amar Das's conversion to Sikhism through singing shabads"
    },
    {
      "label": "Education",
      "value": "Educated in Gurmukhi script and sacred hymns by her father"
    },
    {
      "label": "Residence",
      "value": "Lived in Basarke village after marriage"
    },
    {
      "label": "Memorial",
      "value": "Bibi Amro da Talab (pond) near Basarke"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-01",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Bibi Amro was born in 1532 in the village of Khadur Sahib, near present-day Amritsar, Punjab, India. She was the daughter of Guru Angad Dev, the second Sikh Guru, and Mata Khivi, a prominent figure known for her contributions to the langar (community kitchen) tradition. Bibi Amro had two brothers, Baba Dasu and Baba Datu, and a younger sister, Bibi Anokhi. From a young age, she received direct education from her parents. Guru Angad taught her to read and write in the revised Gurmukhi script, which he had simplified to promote literacy among Sikhs. She also memorized sacred hymns, including complex compositions like Sidh Gosht by Guru Nanak. Described as talented and gifted with a sweet voice, Bibi Amro was raised in a spiritually rich environment, imbibing the core Sikh principles of equality, devotion, and service."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "Bibi Amro's most significant contribution was her role in introducing Amar Das (later Guru Amar Das) to Sikhism. Living with her in-laws in Basarke village after marriage, she would sing Gurbani shabads while performing household duties. Amar Das, her husband's uncle and a devout Hindu on pilgrimages to Haridwar, overheard her reciting a hymn by Guru Nanak (from page 990 of the Guru Granth Sahib: Bhaeiaa munoor ku(n)chun fir hovai jae gur milai thinaehaa...). Deeply moved, he sought her out, and through her encouragement, she accompanied him to meet Guru Angad in Khadur Sahib around 1539. This encounter transformed Amar Das into a devoted Sikh, leading to his eventual appointment as the third Guru in 1552. Later, under Guru Amar Das's organizational reforms, Bibi Amro was appointed head of one of the 22 Manjis (preaching districts), covering areas including Basarke. In this role, she preached Sikh teachings, led kirtan (devotional singing), and organized congregations, helping institutionalize Sikhism's structure."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "As head of a Manji, Bibi Amro supported Guru Amar Das's Manji system, which divided the Sikh Panth into administrative preaching zones to ensure equitable dissemination of teachings. This innovation promoted gender equality in religious leadership, as women like Bibi Amro were entrusted with significant responsibilities akin to bishops in other faiths. Her efforts helped expand Sikhism in rural Punjab, fostering community welfare and challenging prevailing social hierarchies."
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "N/A (Bibi Amro is not credited with original compositions in the Guru Granth Sahib or other Sikh texts; her legacy lies in oral transmission and recitation of Gurbani)."
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "Details on Bibi Amro's later life and death are not well-documented in historical sources. She continued her preaching duties in Basarke until her passing, the exact date of which remains unknown. A sarovar (sacred pond) named Bibi Amro da Talab near Basarke commemorates her enduring legacy in the region."
    }
  ],
  "spiritualLegacy": {
    "description": "Bibi Amro's life exemplifies the Sikh ideals of seva (selfless service), kirtan (devotional music), and gurbani propagation. As a bridge between Hinduism and emerging Sikhism, she facilitated the spiritual journey of key figures, ensuring the continuity of Guru Nanak's teachings. Her appointment as a Manji head highlights women's integral role in Sikh spirituality from its formative years.",
    "keyContributions": [
      "Instrumental in Guru Amar Das's initiation into Sikhism, paving the way for his guruship and reforms like the Manji system.",
      "Promoted Gurmukhi education and Gurbani recitation among women and rural communities.",
      "Strengthened the Sikh Panth's organizational framework through dedicated preaching."
    ]
  },
  "modernRelevance": {
    "description": "In contemporary Sikhism, Bibi Amro is revered as a symbol of female empowerment and the power of devotion. Her story inspires initiatives promoting women's leadership in religious and community roles, aligning with Sikhism's emphasis on gender equality.",
    "contemporaryImpact": [
      "Influences modern Sikh women's organizations and educational programs teaching Gurbani.",
      "The Bibi Amro da Talab serves as a pilgrimage site, drawing devotees for reflection on her contributions.",
      "Highlighted in Sikh historiography to counter narratives marginalizing women's roles in early Sikh history."
    ]
  },
  "achievements": [
    {
      "title": "Introduction of Amar Das to Sikhism",
      "year": "c. 1539",
      "description": "Recited Gurbani that profoundly impacted Amar Das, leading to his conversion and rise as Guru Amar Das.",
      "icon": "🕊️"
    },
    {
      "title": "Appointment as Manji Head",
      "year": "c. 1552–1574",
      "description": "Led one of 22 preaching districts under Guru Amar Das, expanding Sikh teachings in Punjab.",
      "icon": "📜"
    },
    {
      "title": "Promotion of Gurmukhi Literacy",
      "year": "1530s–?",
      "description": "Educated in and propagated the simplified Gurmukhi script among family and community.",
      "icon": "✏️"
    }
  ],
  "quotes": [
    {
      "original": "Bhaeiaa munoor ku(n)chun fir hovai jae gur milai thinaehaa || Eaek naam a(n)mrith ouhu dhaevai tho naanuk thrisuttas dhaehaa ||",
      "transliteration": "Bhaeiaa muneer kunchun fir hovai jae gur milai thinaehu || Eek naam amrit ohu dhaevae tho Nanak trisuttas dhaehaa ||",
      "translation": "The mind, turned into rusted iron, is again transformed into gold if it meets the Guru (philosopher’s stone). He blesses the mortal with the Ambrosial Name of the One Lord, and then, O Nanak, the mind's wanderings cease.",
      "context": "Sung by Bibi Amro while churning curd in Basarke; this shabad by Guru Nanak moved Amar Das to seek spiritual guidance.",
      "source": "Guru Granth Sahib (verified via SikhiWiki and Wikipedia references to traditional accounts)."
    }
  ],
  "timeline": [
    {
      "year": 1532,
      "date": "N/A",
      "event": "Born in Khadur Sahib to Guru Angad and Mata Khivi.",
      "type": "Birth"
    },
    {
      "year": "1530s",
      "date": "N/A",
      "event": "Educated in Gurmukhi and Gurbani by her father.",
      "type": "Education"
    },
    {
      "year": "c. 1540s",
      "date": "N/A",
      "event": "Married to Bhai Jaso in Basarke village.",
      "type": "Marriage"
    },
    {
      "year": 1539,
      "date": "N/A",
      "event": "Recites Gurbani to Amar Das, inspiring his visit to Guru Angad in Khadur.",
      "type": "Spiritual Influence"
    },
    {
      "year": 1552,
      "date": "N/A",
      "event": "Guru Angad appoints Amar Das as successor; Bibi Amro supports early Sikh organization.",
      "type": "Historical Milestone"
    },
    {
      "year": "c. 1552–1574",
      "date": "N/A",
      "event": "Appointed head of a Manji by Guru Amar Das, preaching in Basarke region.",
      "type": "Leadership Role"
    },
    {
      "year": "Post-1574",
      "date": "N/A",
      "event": "Legacy commemorated with Bibi Amro da Talab near Basarke.",
      "type": "Memorial"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Angad Dev",
      "relation": "Father",
      "slug": "guru-angad"
    },
    {
      "name": "Mata Khivi",
      "relation": "Mother",
      "slug": "mata-khivi"
    },
    {
      "name": "Baba Dasu",
      "relation": "Brother",
      "slug": "baba-dasu"
    },
    {
      "name": "Baba Datu",
      "relation": "Brother",
      "slug": "baba-datu"
    },
    {
      "name": "Bibi Anokhi",
      "relation": "Sister",
      "slug": "bibi-anokhi"
    },
    {
      "name": "Guru Amar Das",
      "relation": "Uncle-by-marriage, Influenced Disciple",
      "slug": "guru-amar-das"
    },
    {
      "name": "Bhai Jaso",
      "relation": "Husband",
      "slug": ""
    }
  ],
  "historicalContext": {
    "period": "Early Sikhism (16th century), during the transition from Guru Nanak's foundational teachings to institutional growth under subsequent Gurus.",
    "politicalSituation": "Mughal Empire under Humayun and Akbar; Punjab under regional chieftains with religious pluralism, but tensions between Hindus, Muslims, and emerging Sikh communities.",
    "socialConditions": "Patriarchal society with caste rigidities; women had limited public roles. Sikhism's emphasis on equality challenged this, allowing figures like Bibi Amro to preach. Pilgrimages and oral traditions were common for spiritual dissemination.",
    "significance": "Bibi Amro's actions bridged familial Hindu practices with Sikh devotion, aiding Sikhism's expansion amid syncretic religious landscapes. Her role underscores women's contributions in countering social exclusion and promoting egalitarian ideals."
  },
  "references": [
    "SikhiWiki: \"Bibi Amro\" (https://www.sikhiwiki.org/index.php/Bibi_Amro) – Primary source for biography, family details, and Manji role (verified HTML content).",
    "Wikipedia: \"Guru Amar Das\" (https://en.wikipedia.org/wiki/Guru_Amar_Das) – Cross-verified introduction story and historical context; references traditional Sikh janamsakhis.",
    "Giani Gian Singh, Panth Prakash (Page 84) – Describes her as a virtuous preacher (cited in SikhiWiki). citationNeeded for exact edition.",
    "Bansawali Namma – Mentions her memorization of hymns like Sidh Gosht (traditional account via SikhiWiki).",
    "Suraj Prakash – Certifies her devotion (cited in SikhiWiki). citationNeeded for direct quote.",
    "'Champion of Women' by Alice Basarke – Biographical reference (listed in SikhiWiki).",
    "Guru Granth Sahib (p. 990) – Source of the shabad she recited (verified text)."
  ]
}
