{
  "name": "Guru Gobind Singh Ji",
  "slug": "guru-gobind-singh-ji",
  "category": "gurus",
  "birth": "1666-12-22",
  "death": "1708-10-07",
  "birthPlace": "Patna Sahib, Bihar, India",
  "image": "https://srichants.in/wp-content/uploads/2024/12/Guru-Gobind-Singh-Ji.jpg",
  "excerpt": "Guru Gobind Singh Ji, the tenth Sikh Guru, redefined Sikhism with his unmatched courage, visionary leadership, and prolific poetry. Founder of the Khalsa, compiler of the Dasam Granth, and sanctifier of the Guru Granth Sahib as the eternal Guru, he led Sikhs through persecution and loss. His legacy unites valor, sacrifice, equality, and spiritual resolve.",
  "designation": "10th Sikh Guru",
  "quickStats": [
    {
      "label": "Guruship (years)",
      "value": 33
    },
    {
      "label": "Years Lived",
      "value": 41
    },
    {
      "label": "Key Battles Fought",
      "value": "Bhangani, Nadaun, Chamkaur, Muktsar"
    },
    {
      "label": "Hymns in Guru Granth Sahib",
      "value": 0
    },
    {
      "label": "Compositions in Dasam Granth",
      "value": "Jap Sahib, Akal Ustat, Bachittar Natak, Chandi di Vaar"
    }
  ],
  "quickFacts": [
    {
      "label": "Birth Name",
      "value": "Gobind Rai"
    },
    {
      "label": "Father",
      "value": "Guru Tegh Bahadur Ji"
    },
    {
      "label": "Mother",
      "value": "Mata Gujri Ji"
    },
    {
      "label": "Spouse",
      "value": "Mata Jito Ji, Mata Sundari Ji, Mata Sahib Kaur Ji"
    },
    {
      "label": "Appointed Guru Age",
      "value": "9 years old"
    },
    {
      "label": "Date of Passing",
      "value": "7 October 1708"
    },
    {
      "label": "Place of Martyrdom",
      "value": "Nanded, Maharashtra"
    }
  ],
  "version": {
    "lastUpdated": "2025-07-28T00:15:00+05:30",
    "version": "1.0.0",
    "contributors": 6,
    "edits": 25,
    "historyUrl": "https://en.wikipedia.org/wiki/Guru_Gobind_Singh"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "Child",
      "value": "Born as Gobind Rai on 22 December 1666 in Patna Sahib, Bihar, Guru Gobind Singh Ji spent his early years immersed in spiritual learning and martial training. After his father Guru Tegh Bahadur Ji's martyrdom, he was installed as the tenth Guru at age nine, shaping him for a life of leadership and sacrifice.[1][3][20]"
    },
    {
      "label": "Founding of Khalsa",
      "icon": "Shield",
      "value": "On Vaisakhi 1699 at Anandpur Sahib, Guru Gobind Singh Ji dramatically created the Khalsa, baptizing the Panj Pyare and initiating men and women of all castes into a new spiritual order dedicated to righteousness, equality, and defense of the oppressed.[1][6][9]"
    },
    {
      "label": "Scripture and Literary Contributions",
      "icon": "BookOpen",
      "value": "A philosopher and poet, Guru Gobind Singh Ji composed the Dasam Granth and sanctified the Guru Granth Sahib as the Sikhs’ eternal Guru, binding the community to a spiritual anchor for all time. His works—Jap Sahib, Jaap, Akal Ustat—embody devotion, valor, and oneness with the Divine.[2][13]"
    },
    {
      "label": "Family Sacrifice and Battles",
      "icon": "CrossedSwords",
      "value": "Guru Ji’s life was marked by immense personal sacrifice. All his four sons attained martyrdom—two in battle at Chamkaur, two bricked alive at Sirhind. He personally led Sikhs in major battles at Bhangani, Anandpur, Chamkaur, and Muktsar; always upholding the principles of just war (dharamyudh) and faith against tyranny.[2][5][9]"
    },
    {
      "label": "Final Years and Legacy",
      "icon": "HourglassEnd",
      "value": "In his last years, Guru Gobind Singh Ji survived many assassination attempts and finally attained martyrdom on 7 October 1708 at Nanded. Before passing, he declared that henceforth the Guru Granth Sahib would be the eternal Guru, abolishing the tradition of personal Gurus and inaugurating a new era for the Sikh faith.[1][9]"
    }
  ],
  "spiritualLegacy": {
    "description": "Guru Gobind Singh Ji’s divine inspiration set Sikhism on its path of valor, spiritual sovereignty, and the defense of justice. His creation of the Khalsa established the Sikh identity as inseparably linked to equality, sacrifice, compassion, and devotion.",
    "keyContributions": [
      "Instituted the Khalsa Panth and the Five Ks",
      "Sanctified Guru Granth Sahib as the eternal Guru",
      "Composed the Dasam Granth, inspiring prayer, chivalry, and resilience",
      "Elevated Sikh martial and spiritual disciplines",
      "Unified Sikhs beyond distinctions, empowering women and lower castes"
    ]
  },
  "modernRelevance": {
    "description": "Guru Gobind Singh Ji’s message stands for universal human rights, social justice, and resistance to tyranny. The Khalsa remains a living example of fearlessness, service, and global humanitarianism.",
    "contemporaryImpact": [
      "Khalsa tradition inspires humanitarian, anti-oppression, and equality movements",
      "His poetry and codes guide modern Sikh ritual and philosophy",
      "Gurdwaras and Sikh diaspora model his ideals of seva (service) and courage in times of crisis"
    ]
  },
  "achievements": [
    {
      "title": "Founded Khalsa Panth",
      "year": "1699",
      "description": "Created a new order bound by a distinctive spiritual and martial identity, dedicated to justice and faith.",
      "icon": "Shield"
    },
    {
      "title": "Sanctified Eternal Guru",
      "year": "1708",
      "description": "Declared Guru Granth Sahib as the perpetual spiritual guide for all Sikhs.",
      "icon": "BookOpen"
    },
    {
      "title": "Composed the Dasam Granth",
      "year": "1695–1708",
      "description": "Compiled poems, prayers, and philosophical works still foundational to Sikh liturgy and practice.",
      "icon": "Feather"
    },
    {
      "title": "Led Major Defensive Battles",
      "year": "1688–1705",
      "description": "Fought at Bhangani, Anandpur, Chamkaur, Muktsar; symbolizing righteous resistance to cruelty.",
      "icon": "CrossedSwords"
    },
    {
      "title": "Personal Sacrifice",
      "year": "1705",
      "description": "Endured loss of all four sons (Chaar Sahibzaade) who were martyred for faith and justice.",
      "icon": "Crown"
    }
  ],
  "quotes": [
    {
      "original": "ਦੇਹ ਸਿਵਾ ਬਰ ਮੋਹਿ ਇਹੈ। ਸੁਭ ਕਰਮਨ ਤੇ ਕਬਹੂੰ ਨ ਟਰੋ। ਨਾ ਡਰੋ ਅਰਿ ਸੋ ਜਬ ਜਾਇ ਲਰੋ। ਨਿਸਚੈ ਕਰਿ ਅਪਨੀ ਜੀਤ ਕਰੋ।",
      "transliteration": "Deh Siva bar mohe ihai, shubh karman te kabhoon na taro. Na daro ar so jab jae laro, nischai kar apni jeet karo.",
      "translation": "Grant me this boon, O Lord, may I never refrain from righteous acts. Never may I fear when I go into battle, and with determination, may I claim victory.",
      "context": "Guru Gobind Singh Ji’s prayer for courage, righteousness, and fearlessness in the pursuit of justice.",
      "source": "Dasam Granth, Jaap Sahib"
    },
    {
      "original": "ਚੁ ਕਾਰ ਅਜ਼ ਹਮਹ ਹੀਲਤੇ ਦਰਗੁਜ਼ਸ਼ਤ। ਹਲਾਲ ਅਸਤ ਬੁਰਦਨ ਬ-ਸ਼ਮਸ਼ੀਰ ਦਸਤ।",
      "transliteration": "Chun kar az hama heelate dar guzashat, halal ast burdan ba shamsheer dast.",
      "translation": "When all other means have failed, it is just to take up the sword.",
      "context": "Guru Gobind Singh Ji’s principle for just warfare, proclaimed in a letter to Aurangzeb.",
      "source": "Dasam Granth, Zafarnama"
    },
    {
      "original": "ਕਬਹੁ ਨਿਵਾਸੀ ਧਰਤਿ ਕੇ ਕਬਹੁ ਹਿਰਾਨ ਪਰਬਤ ਮਹਿ। ਕਬਹੁ ਨਿਵਾਸੀ ਮਸਕਨੋ ਕਬਹੁ ਉਦਾਸੀ ਬਨ ਮਹਿ।",
      "transliteration": "Kabhu nivasi dharat ke, kabhu hiran parbat mahi. Kabhu nivasi maskano, kabhu udasi ban mahi.",
      "translation": "Sometimes You dwell on earth, sometimes amongst the mountains. Sometimes You reside in homes, sometimes You wander in forests.",
      "context": "Describing the omnipresence of the Divine.",
      "source": "Dasam Granth, Akal Ustat"
    },
    {
      "original": "ਮਿਤ੍ਰਤਾ ਕਰਿ ਕੈ ਹਿਤ ਹਰਿ ਲੀਨੋ। ਸੈ ਭਰਮ ਜਨਮ ਕੇ ਪਾਪ ਹਰੀਨੋ।",
      "transliteration": "Mitarta kar kai hit har leeno. Sai bharam janam ke paap hareerino.",
      "translation": "By making friendship (devotion) with the Lord, one’s countless sins from past lives are erased.",
      "context": "On the benefit of loving devotion and friendship towards the Divine.",
      "source": "Dasam Granth, Bachittar Natak"
    }
  ],
  "timeline": [
    {
      "year": "1666",
      "date": "22 Dec 1666",
      "event": "Birth of Guru Gobind Singh Ji as Gobind Rai in Patna Sahib",
      "type": "birth"
    },
    {
      "year": "1675",
      "event": "Became Tenth Sikh Guru at age 9 after martyrdom of Guru Tegh Bahadur Ji",
      "type": "appointment"
    },
    {
      "year": "1699",
      "event": "Creation of Khalsa Panth at Anandpur Sahib (Vaisakhi)",
      "type": "milestone"
    },
    {
      "year": "1704–1705",
      "event": "Battles of Anandpur, Chamkaur, Muktsar; martyrdom of his four sons",
      "type": "martyrdom"
    },
    {
      "year": "1708",
      "date": "7 Oct 1708",
      "event": "Passing of Guru Gobind Singh Ji at Nanded; Declares Guru Granth Sahib as eternal Guru",
      "type": "death"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Tegh Bahadur Ji",
      "relation": "Father (9th Sikh Guru)",
      "slug": "guru-tegh-bahadur-ji",
      "category": "gurus",
      "image": "https://dvncorestorageprod.blob.core.windows.net/files/page/61/Image/GuruTeghBahadurSahibbySobhaSinghArt-webistemaindropshadow_1135x_20231101071233682.jpg",
      "exists": true
    },
    {
      "name": "Mata Gujri Ji",
      "relation": "Mother",
      "slug": "mata-gujri-ji",
      "category": "Martyrs",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Newborn_Guru_Gobind_Rai_cradled_by_Mata_Gujari.jpg/800px-Newborn_Guru_Gobind_Rai_cradled_by_Mata_Gujari.jpg",
      "exists": true
    },
    {
      "name": "Baba Ajit Singh Ji, Baba Jujhar Singh Ji, Baba Zorawar Singh Ji, Baba Fateh Singh Ji",
      "relation": "Sons (Chaar Sahibzaade)",
      "slug": "chaar-sahibzaade",
      "category": "unknown",
      "image": "/placeholder.png",
      "exists": false
    },
    {
      "name": "Panj Pyare",
      "relation": "First initiates of Khalsa",
      "slug": "panj-pyare",
      "category": "unknown",
      "image": "/placeholder.png",
      "exists": false
    }
  ],
  "historicalContext": {
    "period": "Late 17th–early 18th century (Mughal Empire; Aurangzeb)",
    "politicalSituation": "Widespread persecution of non-Muslims in the Mughal Empire, intense repression of the Sikh and Hindu communities, and centralization of power under Aurangzeb.",
    "socialConditions": "Rigid caste divides, religious intolerance, and institutional violence necessitated a powerful, unified Sikh community ready to defend dharma and equality.",
    "significance": "Guru Gobind Singh Ji’s leadership transformed Sikhism into a distinctly sovereign, martial, and egalitarian faith with enduring identity and resilience."
  },
  "references": [
    "Wikipedia: Guru Gobind Singh[1]",
    "Britannica: Guru Gobind Singh[2]",
    "Vajiram and Ravi: Guru Gobind Singh, Biography, Early Life, Contributions, Legacy[3]",
    "Khan Global Studies: Guru Gobind Singh Jayanti: Contribution and Sacrifice[9]",
    "StudyIQ: Guru Gobind Singh Jayanti 2025, Biography, Legacy, Military ...[5]",
    "DVNetwork: Guru Gobind Singh Ji: The Warrior Poet[6]"
  ]
}