{
  "name": "Guru Amar Das Ji",
  "slug": "guru-amar-das-ji",
  "category": "gurus",
  "birth": "1479-05-05",
  "death": "1574-09-01",
  "birthPlace": "Basarke, Amritsar district, Punjab",
  "image": "https://4.bp.blogspot.com/-HPt0MXWvqr8/Uu0-IfObjFI/AAAAAAAABPQ/ywO5U28v84k/s1600/Guru+Amar+Das.jpg",
  "excerpt": "Guru Amar Das Ji became the third Sikh Guru in 1552 at the age of 73. Revered for his humility, he greatly expanded Sikhism through the Manji system, established the first Sikh pilgrimage center at Goindwal, championed social reforms like gender and caste equality, and composed many hymns including Anand Sahib. His leadership solidified Sikh institutions, elevated the practice of langar, and advanced the Sikh faith’s message of service, inclusion, and spiritual discipline.",
  "designation": "3rd Sikh Guru",

  "quickStats": [
    { "label": "Guruship (years)", "value": 22 },
    { "label": "Years Lived", "value": 95 },
    { "label": "Hymns in Guru Granth Sahib", "value": 907 },
    { "label": "Children", "value": 4 },
    { "label": "Major Contributions", "value": "Manji system, Goindwal Baoli, Anand Sahib, social reforms" }
  ],

  "quickFacts": [
    { "label": "Birth Name", "value": "Amar Das" },
    { "label": "Father", "value": "Tej Bhan" },
    { "label": "Mother", "value": "Mata Bakht (Lachmi)" },
    { "label": "Spouse", "value": "Mata Mansa Devi" },
    { "label": "Birth Place", "value": "Basarke, Amritsar district, Punjab" },
    { "label": "Appointed Guru Age", "value": "73 years old" },
    { "label": "Date of Passing", "value": "1 September 1574" },
    { "label": "Samadhi Place", "value": "Goindwal Sahib, Punjab" }
  ],

  "version": {
    "lastUpdated": "2025-07-27T23:30:00+05:30",
    "version": "1.0.0",
    "contributors": 5,
    "edits": 20,
    "historyUrl": "https://en.wikipedia.org/wiki/Guru_Amar_Das"
  },

  "biographySections": [
    {
      "label": "Early Life",
      "icon": "Child",
      "value": "Amar Das was born on 5 May 1479 in Basarke, Punjab. Raised in a devout Hindu family, he was deeply religious and became a follower of Vaishnavism early in life. Married to Mata Mansa Devi, he had two sons, Mohan and Mohri, and two daughters, Dani and Bhani."
    },
    {
      "label": "Meeting Guru Angad and Spiritual Transformation",
      "icon": "Lightbulb",
      "value": "In his early 60s, Amar Das met Guru Angad Dev Ji, having been inspired by the hymns recited by Bibi Amro (Guru Angad’s daughter). Drawn by Guru Angad’s teachings, he devoted himself to humble service (seva), becoming a symbol of selfless devotion."
    },
    {
      "label": "Appointment as Guru",
      "icon": "Crown",
      "value": "Recognizing his devotion and integrity, Guru Angad Dev Ji appointed Amar Das as the third Sikh Guru in 1552, at age 73, superseding his own sons."
    },
    {
      "label": "Spiritual and Social Reforms",
      "icon": "BalanceScale",
      "value": "Guru Amar Das Ji worked to end social disparities by abolishing practices such as sati and purdah, promoting widow remarriage, and opposing the caste system. He established the Sikh principle of Langar (community kitchen) as compulsory for all visitors, including Emperor Akbar."
    },
    {
      "label": "The Manji System and Expansion of Sikhism",
      "icon": "UsersCog",
      "value": "To organize and spread Sikh teachings, he created the Manji system, dividing the Sikh community into 22 regions, each led by a representative preacher. He also appointed women to positions of spiritual leadership."
    },
    {
      "label": "Goindwal Baoli and Pilgrimage",
      "icon": "Landmark",
      "value": "Guru Amar Das Ji founded the town of Goindwal Sahib and built Baoli Sahib, an 84-step well that became Sikhism’s first major pilgrimage site. He instituted the practice of visiting Goindwal for festivals and gatherings."
    },
    {
      "label": "Compositions and Literary Legacy",
      "icon": "BookOpen",
      "value": "He composed 907 hymns, including the Anand Sahib, emphasizing bliss through devotional worship, ethical living, and remembrance of God. His bani forms a major portion of the Guru Granth Sahib."
    },
    {
      "label": "Final Years and Succession",
      "icon": "HourglassEnd",
      "value": "Spending his last years at Goindwal in devotional service, Guru Amar Das Ji appointed his son-in-law Bhai Jetha (Guru Ram Das Ji) as his successor, continuing the merit-based tradition of Guruship."
    }
  ],

  "spiritualLegacy": {
    "description": "Guru Amar Das Ji’s legacy is defined by social equality and spiritual discipline. He reinforced ‘seva’ (service) as a spiritual path and expanded Sikh practice with new institutions and liturgical compositions.",
    "keyContributions": [
      "Introduced the Manji and Piri system for spiritual administration and women’s leadership",
      "Solidified regular Sikh festivals (Baisakhi, Diwali) and pilgrimages",
      "Composed Anand Sahib and numerous hymns",
      "Expanded Langar and eliminated social barriers in Sikh worship"
    ]
  },

  "modernRelevance": {
    "description": "Guru Amar Das Ji’s teachings on equality, dignity of women, and universal service remain pillars of Sikh faith and social work globally.",
    "contemporaryImpact": [
      "Manji system model influences Sikh missions and community structure",
      "Langar as a symbol of equality, now global in Sikh Gurdwaras",
      "Women’s empowerment and leadership in Sikh institutions",
      "Anand Sahib integral to all major Sikh ceremonies"
    ]
  },

  "achievements": [
    {
      "title": "Established Manji System",
      "year": "1552–1574",
      "description": "Divided the Sikh sphere into 22 manjis and appointed preachers, including women, to spread Sikh teaching.",
      "icon": "Users"
    },
    {
      "title": "Abolished Sati and Promoted Widow Remarriage",
      "year": "1552–1574",
      "description": "Issued edicts abolishing the practice of sati and supported widow remarriage.",
      "icon": "Gavel"
    },
    {
      "title": "Built Baoli Sahib at Goindwal",
      "year": "1559",
      "description": "Constructed an 84-step stepwell at Goindwal, establishing the first Sikh pilgrimage center.",
      "icon": "Landmark"
    },
    {
      "title": "Composed Anand Sahib",
      "year": "1552–1574",
      "description": "Authored the Anand Sahib and 907 hymns included in Guru Granth Sahib.",
      "icon": "BookOpen"
    },
    {
      "title": "Strengthened Langar Institution",
      "year": "1552–1574",
      "description": "Made Langar compulsory and a symbol of casteless equality in Sikhism.",
      "icon": "Utensils"
    }
  ],

  "quotes": [
    {
      "original": "ਜੇਸਾ ਸੇਵੇ ਸੁ ਤੈਸੋ ਹੋਇ ॥",
      "transliteration": "Jesā seve so taiso hoi.",
      "translation": "As one serves, so does one become.",
      "context": "On the importance of selfless service (seva)",
      "source": "ਗੁਰੂ ਗ੍ਰੰਥ ਸਾਹਿਬ (Guru Granth Sahib), Ang 474"
    },
    {
      "original": "ਸਭੁ ਕੋ ਵਟਾ ਵੇਖਿਆ ਆਪੇ ਵਡਿਆਈ ਦੇਇ ॥",
      "transliteration": "Sabh ko vaḍā vekhiā āpe vaḍiāī dei.",
      "translation": "Everyone seeks greatness, but only the Divine bestows it.",
      "context": "Humility and grace",
      "source": "ਗੁਰੂ ਗ੍ਰੰਥ ਸਾਹਿਬ (Guru Granth Sahib), Ang 1331"
    },
    {
      "original": "ਦੁਨੀਆ ਸੁਤਿਆ ਆਖਿ ਵੀਚਾਰੇ ॥",
      "transliteration": "Duniā sutia ākh vīchāre.",
      "translation": "The world is asleep, only a rare one reflects.",
      "context": "Urging spiritual awakening",
      "source": "ਗੁਰੂ ਗ੍ਰੰਥ ਸਾਹਿਬ (Guru Granth Sahib), Ang 919"
    }
  ],

  "timeline": [
    {
      "year": "1479",
      "date": "5 May 1479",
      "event": "Birth of Guru Amar Das Ji in Basarke, Punjab",
      "type": "birth"
    },
    {
      "year": "~1539",
      "event": "Becomes disciple of Guru Angad Dev Ji",
      "type": "spiritual"
    },
    {
      "year": "1552",
      "event": "Appointed as the 3rd Sikh Guru at age 73",
      "type": "appointment"
    },
    {
      "year": "1559",
      "event": "Establishes Goindwal and constructs Baoli Sahib",
      "type": "founding"
    },
    {
      "year": "1574",
      "date": "1 Sept 1574",
      "event": "Guru Amar Das Ji passes away at Goindwal Sahib",
      "type": "death"
    }
  ],

  "relatedPersonalities": [
    {
      "name": "Guru Angad Dev Ji",
      "relation": "Predecessor, spiritual teacher",
      "slug": "guru-angad-dev-ji"
    },
    {
      "name": "Guru Ram Das Ji",
      "relation": "Successor (4th Sikh Guru), son-in-law",
      "slug": "guru-ram-das-ji"
    },
    {
      "name": "Bibi Bhani Ji",
      "relation": "Daughter, mother of Guru Arjan Dev Ji",
      "slug": "bibi-bhani-ji"
    },
    {
      "name": "Mata Mansa Devi",
      "relation": "Wife",
      "slug": "mata-mansa-devi"
    }
  ],

  "historicalContext": {
    "period": "Mid-16th century (early Mughal era)",
    "politicalSituation": "Indian subcontinent under early Mughal rule (Babur, Humayun, Akbar); Punjab fragmented with rising Mughal authority.",
    "socialConditions": "Rigid caste system, gender inequality, religious diversity with entrenched ritualism. Socio-religious reform movements gaining ground.",
    "significance": "Guru Amar Das Ji’s institution-building, gender and caste reforms, and spiritual teachings helped shape Sikhism into a distinct faith and unified movement."
  },

  "references": [
    "Encyclopaedia of Sikhism (Punjabi University, Patiala)",
    "Guru Amar Das: Third Sikh Guru by Surjit Singh Gandhi",
    "The Sikhs by Patwant Singh",
    "Oxford Handbook of Sikh Studies",
    "Sri Guru Granth Sahib",
    "https://en.wikipedia.org/wiki/Guru_Amar_Das"
  ]
}
