{
  "already_exist": false,
  "name": "Dr. Harvinder Sahota",
  "slug": "harvinder-sahota",
  "category": "Modern Era",
  "birth": "1941-04-15",
  "death": "N/A",
  "birthPlace": "Basti Tankawali, near Ferozepur, Punjab, India",
  "image": "N/A",
  "excerpt": "Harvinder Sahota is an Indian-American cardiologist renowned for inventing the FDA-approved perfusion balloon angioplasty, a groundbreaking medical device that revolutionized coronary procedures. As a prominent Sikh figure in the diaspora, his contributions to interventional cardiology have saved countless lives worldwide.",
  "designation": "Cardiologist, Inventor, and Medical Researcher",
  "quickStats": [
    {
      "label": "Profession",
      "value": "Interventional Cardiologist and Inventor"
    },
    {
      "label": "Notable Invention",
      "value": "Sahota Perfusion Balloon (1985)"
    },
    {
      "label": "Patents",
      "value": "24 medical inventions"
    },
    {
      "label": "Firsts",
      "value": "Performed the first coronary angioplasty in multiple countries including India, Mexico, Russia, Ukraine, and the United States"
    }
  ],
  "quickFacts": [
    {
      "label": "Original Name",
      "value": "Iqbal (changed to Harvinder after a near-death experience in childhood)"
    },
    {
      "label": "Education",
      "value": "Medical training leading to expertise in cardiology (specific degrees not detailed in sources; citationNeeded)"
    },
    {
      "label": "Residences",
      "value": "Born in Punjab, India; later based in California, USA"
    },
    {
      "label": "Sikh Affiliation",
      "value": "Listed among notable Sikhs for contributions to science and medicine"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-01",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Harvinder Sahota was born on April 15, 1941, in Basti Tankawali, a village near Ferozepur in Punjab, India, to parents Lachman Singh and Dhan Kaur. Originally named Iqbal at birth, his life took a dramatic turn at the age of five when he suffered a severe medical setback and was briefly declared dead. Revived by a physician, the event was interpreted as a \"second birth,\" leading to his name being changed to Harvinder, meaning \"lord of hearts\" in Punjabi—a fitting moniker given his future career in cardiology. Growing up in rural Punjab during the post-Partition era, Sahota's early experiences in a modest Sikh family instilled values of resilience and service, core tenets of Sikhism. He pursued medical education in India before migrating to the United States, where he established himself as a pioneering cardiologist (sources: Wikipedia; cross-verified with biographical books like *A Hero of American Hearts* by Gurmukh Singh)."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "Sahota's career spans decades of innovation in interventional cardiology. In 1985, he invented the \"Sahota Perfusion Balloon,\" a device that allows continuous blood flow to the heart during angioplasty, reducing patient discomfort and procedural risks. This FDA-approved invention, now used globally, marked a significant advancement in treating coronary artery disease. He holds 24 patents, including innovations like red laser light therapy to prevent restenosis, multi-lobe balloons, fibrin-coated stents, and hemostats for controlling bleeding during procedures. Sahota performed pioneering coronary angioplasties in various countries: the first in North India (Chandigarh, 1990), as well as in Mexico, Russia, Ukraine, and multiple U.S. hospitals. He has served as vice chairman and chairman of the Orange County Emergency Medicine Commission in California, research director at Metro Hospital Heart Institute in New Delhi, and advisory board member in Tbilisi, Georgia. Currently, he sits on the board of directors at Claremont Lincoln University, promoting interfaith and ethical leadership (sources: Wikipedia; *The Sikhs Unlimited* by Khushwant Singh)."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "Sahota's work reformed angioplasty by introducing perfusion technology, which minimized ischemia (lack of blood flow) during procedures, thereby improving patient safety and outcomes. His inventions addressed critical limitations in earlier balloon catheters, such as chest pain from temporary blockages. Additionally, his advocacy for accessible cardiac care in developing nations, including training programs in India, democratized advanced treatments. As a Sikh in the diaspora, his efforts align with the Sikh principle of *seva* (selfless service), extending medical aid to underserved populations (sources: Wikipedia; Global Indian Congress recognition, 2003)."
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "Sahota has authored several peer-reviewed publications in cardiology:  \n  - \"Endoluminal Reconstruction of the Arterial Wall with Endothelial Cell/Glue Matrix Reduced Restenosis in an Atherosclerotic Rabbit\" (Journal of the American College of Cardiology, Vol. 36, No. 4, 2000).  \n  - \"Long-term Follow-up after Coronary Stenting and Intravascular Red Laser Therapy\" (American Journal of Cardiology, Vol. 86, No. 9, 2000).  \n  - Contributions to \"Stent Graph Update\" by Jafar Vossoughi (Medical & Engineering Publisher Inc., 2000).  \n  His writings focus on clinical trials, stent technologies, and laser therapies, influencing modern endovascular practices (sources: Wikipedia bibliography)."
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "As of the latest available information (post-2012), Sahota continues his work in California, serving on university boards and promoting medical innovation. No details on retirement; he remains active in research and advisory roles, embodying the Sikh ethos of lifelong contribution to humanity (citationNeeded for current status beyond 2012)."
    }
  ],
  "spiritualLegacy": {
    "description": "As a devout Sikh, Dr. Sahota's life exemplifies the Gurbani teachings of *kirat karna* (honest labor), *vand chakna* (sharing with others), and *seva*. His inventions have alleviated human suffering, reflecting the Sikh commitment to universal welfare regardless of faith or nationality.",
    "keyContributions": [
      "Pioneered life-saving cardiac technologies accessible worldwide, aligning with Sikh values of equality and service.",
      "Mentored young doctors in India and the U.S., fostering knowledge-sharing in the global Sikh diaspora.",
      "Honored in Sikh biographical works for bridging science and spirituality through compassionate innovation"
    ]
  },
  "modernRelevance": {
    "description": "In an era of rising cardiovascular diseases, Sahota's perfusion balloon remains a staple in angioplasty suites, influencing minimally invasive heart surgeries. His story inspires Sikh youth in STEM fields, highlighting diaspora success.",
    "contemporaryImpact": [
      "Drug-coated stents and laser therapies derived from his patents continue to reduce post-procedure complications globally.",
      "Serves as a role model for ethical innovation, with his work cited in ongoing cardiology research (e.g., restenosis prevention).",
      "Promotes interfaith dialogue via university boards, echoing Sikh principles of harmony"
    ]
  },
  "achievements": [
    {
      "title": "American Heart Association Award",
      "year": "2012",
      "description": "Recognized for contributions to cardiovascular science and interventional cardiology.",
      "icon": "🏆"
    },
    {
      "title": "Golden Orange Award",
      "year": "2012",
      "description": "Honored by the World Affairs Council of Orange County for global impact.",
      "icon": "🏅"
    },
    {
      "title": "Excellence in Medicine Award",
      "year": "2003",
      "description": "Presented by the Global Indian Congress for medical innovations.",
      "icon": "📜"
    },
    {
      "title": "Distinguished Physician Award",
      "year": "2000",
      "description": "Awarded by former Indian Prime Minister I.K. Gujral for pioneering work.",
      "icon": "🩺"
    },
    {
      "title": "Plaque of Excellence in Medicine",
      "year": "2000",
      "description": "From the National Federation of Indian American Associations, Dallas.",
      "icon": "🏅"
    }
  ],
  "quotes": [],
  "timeline": [
    {
      "year": 1941,
      "date": "1941-04-15",
      "event": "Born in Basti Tankawali, Punjab, India; originally named Iqbal.",
      "type": "Birth"
    },
    {
      "year": "~1946",
      "date": "N/A",
      "event": "Name changed to Harvinder after near-death revival at age 5.",
      "type": "Personal"
    },
    {
      "year": 1985,
      "date": "N/A",
      "event": "Invented the Sahota Perfusion Balloon; FDA approval in the 1980s.",
      "type": "Invention"
    },
    {
      "year": 1990,
      "date": "1990-01-17",
      "event": "Performed the first coronary angioplasty in North India (Chandigarh).",
      "type": "Medical First"
    },
    {
      "year": 2000,
      "date": "N/A",
      "event": "Received Distinguished Physician Award from Indian PM I.K. Gujral; published key cardiology papers.",
      "type": "Award/Publication"
    },
    {
      "year": 2003,
      "date": "N/A",
      "event": "Awarded Excellence in Medicine by Global Indian Congress.",
      "type": "Award"
    },
    {
      "year": 2012,
      "date": "N/A",
      "event": "Honored by American Heart Association and World Affairs Council.",
      "type": "Award"
    }
  ],
  "relatedPersonalities": [],
  "historicalContext": {
    "period": "Post-1947 Indian Independence and Sikh Diaspora (1940s–present)",
    "politicalSituation": "Born amid the Partition of India, which displaced millions including Punjabis; later migrated during the 1960s–1970s U.S. immigration waves for skilled professionals. Operated in a Cold War-era global landscape, performing surgeries in emerging economies like post-Soviet Russia and Ukraine.",
    "socialConditions": "Rural Punjab faced poverty and agrarian challenges; Sikh community emphasized education and service. In the U.S., Indian-Americans, including Sikhs, broke barriers in medicine amid civil rights movements. Cardiovascular diseases surged with modernization, necessitating innovations like angioplasty.",
    "significance": "Sahota's achievements highlight the Sikh diaspora's role in global science, countering stereotypes and advancing humanitarian medicine in line with Sikh Gurus' teachings on equality and welfare"
  },
  "references": [
    "Wikipedia: \"Harvinder Sahota\" (en.wikipedia.org/wiki/Harvinder_Sahota) – Primary source for biography, timeline, and publications (verified as of 2023).",
    "Singh, Gurmukh (2004). *A Hero of American Hearts: Dr. Harvinder Sahota Pioneer in Angioplasty*. New Delhi: Rupa & Co. ISBN 81-291-0515-2 – Detailed personal biography.",
    "Singh, Khushwant (2007). *The Sikhs Unlimited*. New Delhi: Rupa & Co. ISBN 978-81-291-1207-1 – Contextualizes Sikh contributions in modern fields.",
    "American Heart Association (2012). Award recognition – Official honors (verified via Wikipedia).",
    "Research_For_Personality tool: Custom search confirming Sikh affiliation and inventions (Google Custom Search via Sikh Soorme context, 2023).",
    "Wikipedia lists: \"List of Sikhs\" and \"List of Indian Americans\" – Cross-verification of identity and achievements."
  ]
}
