{
  "already_exist": false,
  "name": "Gurdwara Darbar Sahib Kartarpur (Kartarpur Sahib)",
  "slug": "kartarpur-sahib",
  "category": "Gurus (Associated with Guru Nanak Dev Ji, founder of Sikhism)",
  "birth": "",
  "death": "",
  "birthPlace": "Kartarpur, Shakargarh Tehsil, Narowal District, Punjab, Pakistan",
  "image": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Gurdwara_Darbar_Sahib_Kartarpur.jpg",
  "excerpt": "Kartarpur Sahib is one of the holiest sites in Sikhism, marking the place where Guru Nanak Dev Ji, the founder of the faith, spent his final 18 years establishing the first Sikh community, preaching core principles, and attaining enlightenment in 1539 CE. It symbolizes the foundations of Sikh egalitarian ideals and communal living.",
  "designation": "Holiest Gurdwara in Sikhism (Second after Gurdwara Janam Asthan in Nankana Sahib)",
  "quickStats": [
    {
      "label": "Founded",
      "value": "1504 CE by Guru Nanak Dev Ji"
    },
    {
      "label": "Location",
      "value": "Near India-Pakistan border, visible from Dera Baba Nanak, India"
    },
    {
      "label": "Significance",
      "value": "Site of Guru Nanak's final abode and establishment of Sikh principles"
    },
    {
      "label": "Accessibility",
      "value": "Opened via Kartarpur Corridor in 2019 for visa-free access from India"
    }
  ],
  "quickFacts": [
    {
      "label": "Holiest Sites Rank",
      "value": "2nd in Sikhism"
    },
    {
      "label": "Key Principles Taught",
      "value": "Kirat Karo (honest labor), Naam Japo (meditation on God), Vand Chhako (sharing with others)"
    },
    {
      "label": "Annual Visitors",
      "value": "Millions, especially on Guru Nanak's Gurpurab"
    }
  ],
  "version": {
    "lastUpdated": "2023-11-01",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Kartarpur Sahib was founded around 1504 CE by Guru Nanak Dev Ji near the Ravi River in present-day Pakistan. After his extensive missionary travels (Udasis) across regions like Haridwar, Mecca, Lanka, Baghdad, Kashmir, and Nepal, Guru Nanak settled here, plowing fields and establishing the first Sikh commune. The site served as a model village emphasizing communal harmony, equality, and spiritual practice. (Source: Wikipedia)"
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "The site became the cradle of Sikhism, where Guru Nanak assembled followers, instituted the Langar (community kitchen) for free meals regardless of caste or creed, and promoted ethical living. It fostered a self-sustaining community through farming and honest labor, laying the groundwork for Sikh institutions. Today, the gurdwara preserves relics like original copies of the Guru Granth Sahib and serves as a pilgrimage center. (Source: SikhiWiki, Wikipedia)"
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "Guru Nanak introduced reforms against social inequalities, emphasizing gender equality, rejection of caste systems, and interfaith harmony through the principle of Ik Onkar (One God). The site's establishment challenged prevailing religious and social norms by creating an egalitarian society. (citationNeeded for specific reform dates)"
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "While not a person, the site is linked to Guru Nanak's compositions in the Guru Granth Sahib, including hymns composed during his time here. Key teachings like the three pillars (Kirat Karo, Naam Japo, Vand Chhako) were formalized at Kartarpur. (Source: Research_For_Personality search results)"
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "Guru Nanak resided here until his death (Joti Jot) on September 22, 1539 CE. A legendary dispute arose post-death between Hindus (favoring cremation) and Muslims (favoring burial), resolved by covering his body with flowers that miraculously bloomed, symbolizing unity. His ashes were later moved due to flooding. The gurdwara was built on this sacred spot. (Source: Wikipedia)"
    }
  ],
  "spiritualLegacy": {
    "description": "Kartarpur Sahib embodies the birth of organized Sikhism, representing Guru Nanak's vision of a society based on truth, equality, and devotion. It remains a beacon for Sikhs worldwide, promoting peace and universal brotherhood.",
    "keyContributions": [
      "Establishment of Langar system, promoting communal equality.",
      "Codification of core Sikh ethics: honest work, remembrance of God, and sharing.",
      "Foundation for the Guru Granth Sahib's compilation through preserved teachings."
    ]
  },
  "modernRelevance": {
    "description": "In contemporary times, Kartarpur Sahib symbolizes Sikh resilience and cross-border harmony. The 2019 Kartarpur Corridor allows Indian pilgrims visa-free access, fostering Indo-Pak relations and global Sikh unity.",
    "contemporaryImpact": [
      "Annual Gurpurab gatherings draw millions, reinforcing cultural identity.",
      "Serves as a diplomatic bridge, highlighted during Guru Nanak's 550th birth anniversary celebrations.",
      "Inspires modern Sikh activism for social justice and interfaith dialogue."
    ]
  },
  "achievements": [
    {
      "title": "Founding of First Sikh Commune",
      "year": "1504 CE",
      "description": "Guru Nanak establishes Kartarpur as a model egalitarian village",
      "icon": "🛕"
    },
    {
      "title": "Institution of Langar",
      "year": "Early 1500s",
      "description": "Introduction of community kitchen open to all",
      "icon": "🍲"
    },
    {
      "title": "Opening of Kartarpur Corridor",
      "year": "2019 CE",
      "description": "Visa-free access for pilgrims, enhancing global connectivity",
      "icon": "🌉"
    },
    {
      "title": "Recognition as Holy Site",
      "year": "Ongoing",
      "description": "UNESCO tentative list consideration; largest gurdwara claim",
      "icon": "🏛️"
    }
  ],
  "quotes": [
    {
      "original": "(Associated with Guru Nanak at Kartarpur) \"Kirat karo, naam japo, vand chhako\" (Gurmukhi: ਕਰਤ ਕਰੋ, ਨਾਮ ਜਪੋ, ਵੰਡ ਛਕੋ)",
      "transliteration": "Kirat karō, nām japō, vaṇḍ chhakō",
      "translation": "Earn an honest living, meditate on the divine name, and share with others.",
      "context": "Core principles preached by Guru Nanak while residing in Kartarpur, forming the ethical foundation of Sikhism.",
      "source": "Guru Granth Sahib; referenced in Wikipedia and SikhiWiki."
    }
  ],
  "timeline": [
    {
      "year": "1504",
      "date": "Approx.",
      "event": "Guru Nanak founds Kartarpur village and Sikh commune",
      "type": "Foundation"
    },
    {
      "year": "1521",
      "date": "Ongoing",
      "event": "Guru Nanak resides, farms, and teaches in Kartarpur",
      "type": "Residence"
    },
    {
      "year": "1539",
      "date": "Sep 22",
      "event": "Guru Nanak's passing; legendary flower miracle",
      "type": "Spiritual"
    },
    {
      "year": "1539",
      "date": "Post",
      "event": "Dispute resolution; gurdwara site established",
      "type": "Historical"
    },
    {
      "year": "1947",
      "date": "Partition",
      "event": "Site falls in Pakistan; access restricted",
      "type": "Political"
    },
    {
      "year": "2019",
      "date": "Nov 9",
      "event": "Kartarpur Corridor opens for visa-free pilgrimage",
      "type": "Modern"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Nanak Dev Ji",
      "relation": "Founder",
      "slug": "guru-nanak"
    },
    {
      "name": "Baba Sri Chand",
      "relation": "Son of Guru Nanak",
      "slug": "baba-sri-chand"
    },
    {
      "name": "Guru Angad Dev Ji",
      "relation": "Successor, visited site",
      "slug": "guru-angad"
    },
    {
      "name": "Imran Khan",
      "relation": "Opened Corridor (Modern)",
      "slug": "imran-khan"
    }
  ],
  "historicalContext": {
    "period": "Early Sikhism (15th-16th century CE), during Mughal and Delhi Sultanate influences in Punjab.",
    "politicalSituation": "Under varying Muslim rulers; Guru Nanak's teachings challenged rigid theocracies by promoting spiritual equality over ritualism.",
    "socialConditions": "Prevalent caste discrimination, gender inequality, and religious divisions; Kartarpur offered a revolutionary egalitarian alternative.",
    "significance": "Marked the transition from Guru Nanak's itinerant preaching to institutionalized Sikh community, influencing the formation of the faith amid socio-political turbulence. (Source: Wikipedia History section)"
  },
  "references": [
    "Wikipedia: \"Gurdwara Darbar Sahib Kartarpur\" (Accessed via wikipedia-api tool, comprehensive history and significance).",
    "SikhiWiki: \"Kartarpur\" (Disambiguation page linking to detailed entries on Kartarpur (Ravi); extracted via Read_Website_Content tool).",
    "Research_For_Personality: General search results emphasizing Guru Nanak's association and Sikh reform context.",
    "Additional: \"The Sikhs: History, Religion, and Society\" by Patwant Singh (book reference for broader context; citationNeeded for specific excerpts).",
    "Image Validation: Multiple URLs checked via Check_Image_URL tool; primary image sourced from Wikimedia Commons (public domain)."
  ]
}
