{
  "name": "Kartar Singh Sarabha",
  "slug": "kartar-singh-sarabha",
  "category": "Martyrs",
  "birth": "1896-05-24",
  "death": "1915-11-16",
  "birthPlace": "Sarabha, Ludhiana, Punjab",
  "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Placeholder_Image.svg/1200px-Placeholder_Image.svg.png",
  "excerpt": "Kartar Singh Sarabha was an Indian revolutionary and a prominent member of the Ghadar Party. At the young age of 15, he became deeply involved in the independence movement, advocating for armed struggle against British colonial rule. He played a crucial role in publishing the revolutionary newspaper \"Ghadar\" and actively organized the Ghadar Mutiny. He was executed at the age of 19 for his revolutionary activities.",
  "designation": "Revolutionary, Freedom Fighter, Editor of Ghadar Newspaper",
  "quickStats": [
    {
      "label": "Age at Death",
      "value": "19 years"
    },
    {
      "label": "Party Affiliation",
      "value": "Ghadar Party"
    },
    {
      "label": "Execution Date",
      "value": "16 November 1915"
    }
  ],
  "quickFacts": [
    {
      "label": "Became a member of the Ghadar Party at 15.",
      "value": ""
    },
    {
      "label": "Responsible for printing the Gurmukhi edition of the Ghadar newspaper.",
      "value": ""
    },
    {
      "label": "Regarded as a hero by Bhagat Singh.",
      "value": ""
    }
  ],
  "version": {
    "lastUpdated": "2023-10-27T10:00:00Z",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": ""
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "fa-user",
      "value": "Kartar Singh Sarabha was born on May 24, 1896, in the village of Sarabha, near Ludhiana, Punjab, to Mangal Singh Grewal and Sahib Kaur. He belonged to a Jat Sikh family. His father passed away when he was very young, and he was subsequently raised by his grandfather. He completed his initial education in his village and then attended Malwa Khalsa High School in Ludhiana up to the 8th standard. In July 1912, he sailed to San Francisco, with an intention to enroll at the University of California at Berkeley, though evidence of his enrollment varies. A historical account by Baba Jwala Singh indicates that Kartar Singh was working in a mill factory in Astoria, Oregon, in December 1912. His involvement with the Nalanda club of Indian students at Berkeley ignited his patriotic sentiments, making him aware of the discriminatory treatment faced by Indian immigrants in the United States. He was inspired by Sohan Singh Bhakna, the founder of the Ghadar Party, to actively campaign against British colonial rule. He learned how to handle firearms, make detonating devices, and even took lessons for flying aeroplanes. He frequently engaged in discussions with other Indians about the necessity of India's independence from British rule."
    },
    {
      "label": "Contributions/Service",
      "icon": "fa-briefcase",
      "value": "Kartar Singh Sarabha became a pivotal figure in the Ghadar Party, which was founded in mid-1913. He abandoned his university studies to work closely with Lala Hardyal, the party's secretary, assisting in the publication of the revolutionary newspaper \"Ghadar.\" He took on the significant responsibility of printing the Gurmukhi edition of the paper, contributing patriotic poetry and articles to its content. The Ghadar newspaper, published in multiple languages, played a crucial role in disseminating the party's message of armed struggle for independence among Indians globally. With the outbreak of World War I in 1914, Sarabha and other Ghadar leaders saw an opportunity to intensify their efforts. They published a \"Decision of Declaration of War\" against the British in the Ghadar newspaper and distributed thousands of copies among army cantonments and villages. In October 1914, Sarabha returned to India, reaching Calcutta with other Ghadar members. He, along with Vishnu Ganesh Pingle, met Rash Behari Bose in Banaras to coordinate plans for the impending Ghadar movement."
    },
    {
      "label": "Key Reforms",
      "icon": "fa-cogs",
      "value": "Kartar Singh Sarabha's key \"reforms\" were not in the traditional sense of social or religious reforms, but rather his revolutionary efforts aimed at the fundamental political reform of achieving India's independence from British rule. He advocated for: Armed Revolution: Believed that only an armed struggle could dislodge British colonial power. National Unity: His work with the Ghadar Party aimed to unite Indians from various backgrounds and regions under a common cause for freedom. Dissemination of Revolutionary Ideas: Through the Ghadar newspaper, he played a crucial role in spreading anti-British sentiment and inspiring revolutionary action."
    },
    {
      "label": "Compositions/Writings",
      "icon": "fa-pencil-alt",
      "value": "Kartar Singh Sarabha composed patriotic poetry and wrote articles for the Ghadar newspaper. His writings were instrumental in instilling revolutionary zeal among the Indian diaspora and within India."
    },
    {
      "label": "Final Years",
      "icon": "fa-flag",
      "value": "In November 1915, at the age of 19, Kartar Singh Sarabha was executed by the British authorities at Central Jail, Lahore, for his leading role in the Ghadar movement and the conspiracy to overthrow British rule. He faced his execution with unwavering courage, solidifying his place as a martyr for Indian independence."
    }
  ],
  "spiritualLegacy": {
    "description": "Kartar Singh Sarabha's spiritual legacy is intertwined with his unwavering commitment to justice and freedom, deeply rooted in Sikh values of sacrifice (shahadat) and standing against oppression. Though his direct contributions were political and revolutionary, his actions embodied the spirit of selflessness for the greater good, a core tenet of Sikhism.",
    "keyContributions": [
      "Embodiment of Sikh principles of fearlessness and sacrifice in the face of tyranny.",
      "Inspiration for future generations of freedom fighters, including Bhagat Singh."
    ]
  },
  "modernRelevance": {
    "description": "Kartar Singh Sarabha remains a powerful symbol of youth activism, courage, and ultimate sacrifice for national liberation. His story continues to inspire those fighting for justice and freedom worldwide.",
    "contemporaryImpact": [
      "Celebrated as a national hero in India, particularly in Punjab.",
      "His life story is taught in educational institutions as an example of patriotism.",
      "Continues to be a source of inspiration for revolutionary and activist movements."
    ]
  },
  "achievements": [
    {
      "title": "Founding Member, Ghadar Party",
      "year": "1913",
      "description": "Became a key figure in the formation of the revolutionary Ghadar Party.",
      "icon": "fa-star"
    },
    {
      "title": "Editor, Ghadar Newspaper",
      "year": "1913-1914",
      "description": "Played a vital role in publishing and writing for the influential revolutionary newspaper.",
      "icon": "fa-pen-nib"
    },
    {
      "title": "Martyrdom for Indian Independence",
      "year": "1915",
      "description": "Executed by the British for his revolutionary activities, becoming a symbol of sacrifice.",
      "icon": "fa-flag-checkered"
    }
  ],
  "quotes": []
}
