{
  "already_exist": false,
  "name": "Mata Sulakhni",
  "slug": "mata-sulakhni",
  "category": "Guru Family",
  "birth": "1473-00-00",
  "death": "1545-00-00",
  "birthPlace": "Pakkhoke Randhave (Pakhokhi village), Gurdaspur district, Punjab",
  "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/An_Imaginary_Meeting_between_Guru_Nanak_and_Gobind_Singh_LACMA_M.75.114.2.jpg/800px-An_Imaginary_Meeting_between_Guru_Nanak_and_Gobind_Singh_LACMA_M.75.114.2.jpg",
  "excerpt": "Mata Sulakhni was the revered wife of Guru Nanak Dev Ji, the founder of Sikhism. She played a pivotal role as a devoted spouse and mother, raising their two sons, Sri Chand and Lakhmi Das, and providing steadfast support during Guru Nanak's spiritual journeys and the formative years of the Sikh faith. Her life exemplifies unwavering dedication and serves as an early role model for Sikh women.",
  "designation": "Wife of Guru Nanak Dev Ji",
  "quickStats": [
    {
      "label": "Husband",
      "value": "Guru Nanak Dev Ji"
    },
    {
      "label": "Sons",
      "value": "Sri Chand, Lakhmi Das"
    }
  ],
  "quickFacts": [
    {
      "label": "Supported Guru Nanak's mission",
      "value": "Yes"
    },
    {
      "label": "Mother of the Udasi founder Sri Chand",
      "value": "Yes"
    }
  ],
  "version": {
    "lastUpdated": "2024-08-30T00:00:00Z",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": ""
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "fa-child",
      "value": "Born in 1473 to Mūl Chand, a Chona Khatri, and Chando Rani. Her family resided in the village of Pakkhoke Randhave (Pakhokhi village) in what is now the Gurdaspur district of Punjab. Her father held a minor revenue office. In some traditions, she is also known by the names Choni, Ghummi, and Kulamai."
    },
    {
      "label": "Contributions/Service",
      "icon": "fa-hands-helping",
      "value": "Mata Sulakhni's primary contribution lay in her unwavering support for Guru Nanak Dev Ji. She managed the household and raised their two sons, Sri Chand and Lakhmi Das, allowing Guru Nanak to focus on his spiritual mission. Her steadfast devotion and acceptance of Guru Nanak's unique path, even when it diverged from societal norms, made her a foundational figure and an early role model for Sikh women. She embodied the ideals of a supportive wife and nurturing mother within the nascent Sikh community."
    },
    {
      "label": "Key Reforms",
      "icon": "fa-gift",
      "value": "Mata Sulakhni was not a reformer in the conventional sense, but her life exemplified the values of family, devotion, and steadfastness that were integral to the early Sikh way of life."
    },
    {
      "label": "Contributions/Writings",
      "icon": "fa-pen",
      "value": "N/A"
    },
    {
      "label": "Final Years",
      "icon": "fa-clock",
      "value": "Mata Sulakhni lived an ordinary life as a housewife in Sultanpur Lodhi until Guru Nanak's extensive spiritual journeys (Udasis) began around 1499 or 1502. While she expressed a desire to accompany him, she remained at home to care for and raise their sons. She passed away in 1545."
    }
  ],
  "spiritualLegacy": {
    "description": "Mata Sulakhni Ji's spiritual legacy is intertwined with her role as the wife of Guru Nanak Dev Ji. Her life demonstrated the importance of household responsibilities and family life (\"Gristi Jeevan\") as a path to spiritual fulfillment, a core tenet of Sikhism. She exemplified quiet strength, devotion, and a deep understanding of her husband's divine mission. Her commitment ensured the stability of Guru Nanak's family, allowing him the freedom to travel and spread his teachings.",
    "keyContributions": [
      "Provided essential domestic and emotional support to Guru Nanak Dev Ji.",
      "Nurtured and raised the next generation of Guru Nanak's lineage, Sri Chand and Lakhmi Das.",
      "Set an early example of an ideal Sikh wife and mother, demonstrating devotion, patience, and resilience."
    ]
  },
  "modernRelevance": {
    "description": "Mata Sulakhni's life continues to resonate in modern Sikh society as a symbol of the strength and resilience of women within the Sikh faith. Her story underscores the significance of a supportive family unit in facilitating spiritual endeavors and highlights the often unacknowledged contributions of women in historical movements. She serves as an inspiration for Sikh women to balance family duties with spiritual aspirations.",
    "contemporaryImpact": [
      "Inspires Sikh women in their roles as wives and mothers, emphasizing devotion and commitment.",
      "Reinforces the importance of \"Gristi Jeevan\" (household life) as a spiritual path in Sikhism.",
      "Her narrative encourages appreciation for the foundational contributions of women in Sikh history."
    ]
  },
  "achievements": [
    {
      "title": "Wife of Guru Nanak Dev Ji",
      "year": "1487",
      "description": "Married Guru Nanak Dev Ji, founder of Sikhism, and supported his spiritual mission.",
      "icon": ""
    },
    {
      "title": "Mother of Sri Chand and Lakhmi Das",
      "year": "1494",
      "description": "Gave birth to and raised Sri Chand, who later founded the Udasi sect, and Lakhmi Das.",
      "icon": ""
    },
    {
      "title": "Role Model for Sikh Women",
      "year": "",
      "description": "Exemplified the virtues of a devoted wife and mother, contributing to the establishment of Sikh family values.",
      "icon": ""
    }
  ],
  "quotes": [
    {
      "original": "Be careful, the wall might fall.",
      "transliteration": "",
      "translation": "",
      "context": "While seated beside a frail mud wall during his wedding ceremony, Mata Sulakhni reportedly warned Guru Nanak of the danger, to which he replied that the wall would not fall for centuries.",
      "source": "Sikh lore, particularly relating to Gurdwara Kandh Sahib (citationNeeded)"
    }
  ],
  "timeline": [
    {
      "year": 1473,
      "date": "00-00",
      "event": "Birth of Sulakhni.",
      "type": "Birth"
    },
    {
      "year": 1487,
      "date": "09-24",
      "event": "Marriage to Guru Nanak Dev Ji.",
      "type": "Life Event"
    },
    {
      "year": 1488,
      "date": "00-00",
      "event": "Joined Guru Nanak in Sultanpur Lodhi.",
      "type": "Life Event"
    },
    {
      "year": 1494,
      "date": "00-00",
      "event": "Birth of her first son, Sri Chand.",
      "type": "Family Event"
    },
    {
      "year": 1497,
      "date": "00-00",
      "event": "Birth of her second son, Lakhmi Das.",
      "type": "Family Event"
    },
    {
      "year": 1499,
      "date": "00-00",
      "event": "Guru Nanak Dev Ji's spiritual preaching began.",
      "type": "Historical"
    },
    {
      "year": 1545,
      "date": "00-00",
      "event": "Death of Mata Sulakhni.",
      "type": "Death"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Nanak Dev Ji",
      "relation": "Husband",
      "slug": "guru-nanak-dev-ji",
      "category": "gurus",
      "image": "https://sikhsewak.wordpress.com/wp-content/uploads/2015/06/guru-nanak-dev-ji1.jpg?w=640",
      "exists": true
    },
    {
      "name": "Sri Chand",
      "relation": "Son",
      "slug": "",
      "category": "unknown",
      "image": "/placeholder.png",
      "exists": false
    },
    {
      "name": "Lakhmi Das",
      "relation": "Son",
      "slug": "",
      "category": "unknown",
      "image": "/placeholder.png",
      "exists": false
    },
    {
      "name": "Mool Chand",
      "relation": "Father",
      "slug": "",
      "category": "unknown",
      "image": "/placeholder.png",
      "exists": false
    },
    {
      "name": "Chando Rani",
      "relation": "Mother",
      "slug": "",
      "category": "unknown",
      "image": "/placeholder.png",
      "exists": false
    },
    {
      "name": "Jai Ram",
      "relation": "Brother-in-law (of Guru Nanak)",
      "slug": "",
      "category": "unknown",
      "image": "/placeholder.png",
      "exists": false
    }
  ],
  "historicalContext": {
    "period": "Late 15th to mid-16th century, a transformative era marked by the emergence of the Sikh faith.",
    "politicalSituation": "The region of Punjab was under the influence of various local rulers and the nascent Mughal Empire, leading to periods of instability and changing political landscapes.",
    "socialConditions": "Society was predominantly Hindu with a strong caste system and prevailing patriarchal norms. Guru Nanak's teachings challenged many of these social hierarchies.",
    "significance": "Mata Sulakhni lived during a crucial time when Sikhism was being founded. Her role as the wife of Guru Nanak and the mother of his children was vital for the establishment and continuity of the Guru's lineage and the early Sikh community. She provided a stable domestic environment that allowed Guru Nanak to embark on his spiritual journeys and propagate his message, thereby contributing indirectly but significantly to the early development of Sikhism."
  },
  "references": [
    "https://en.wikipedia.org/wiki/Mata_Sulakhni",
    "https://www.sikhiwiki.org/index.php/Mata_Sulakhni",
    "https://www.sikhnet.com/news/wife-khalsa-third-role-woman",
    "citationNeeded"
  ]
}