{
  "name": "Mata Gujri Ji",
  "slug": "mata-gujri-ji",
  "category": "Martyrs",
  "birth": "1624-00-00",
  "death": "1705-12-26",
  "birthPlace": "Kartarpur, Kapurthala district, Punjab, India",
  "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Newborn_Guru_Gobind_Rai_cradled_by_Mata_Gujari.jpg/800px-Newborn_Guru_Gobind_Rai_cradled_by_Mata_Gujari.jpg",
  "excerpt": "Mata Gujri Ji, revered as the wife of Guru Tegh Bahadur Ji and the mother of Guru Gobind Singh Ji, stands as an iconic figure of courage, resilience, and supreme sacrifice in Sikh history. Her unwavering faith and spiritual strength guided her through profound personal losses, culminating in her martyrdom alongside her youngest grandsons, Sahibzada Zorawar Singh Ji and Sahibzada Fateh Singh Ji, making her an eternal symbol of devotion and a protector of Sikh principles.",
  "designation": "Mother of the Tenth Sikh Guru, Guru Gobind Singh Ji; Wife of the Ninth Sikh Guru, Guru Tegh Bahadur Ji.",
  "quickStats": [
    {
      "label": "Spouse",
      "value": "Guru Tegh Bahadur Ji"
    },
    {
      "label": "Son",
      "value": "Guru Gobind Singh Ji"
    },
    {
      "label": "Grandsons",
      "value": "Sahibzada Ajit Singh Ji, Sahibzada Jujhar Singh Ji, Sahibzada Zorawar Singh Ji, Sahibzada Fateh Singh Ji"
    },
    {
      "label": "Martyrdom",
      "value": "Imprisoned and martyred with her two youngest grandsons"
    }
  ],
  "quickFacts": [
    {
      "label": "Title Honors",
      "value": "One of the four consorts honored with the title of Guru-Mahal"
    },
    {
      "label": "Leadership Role",
      "value": "Managed affairs of Anandpur Sahib during Guru Gobind Singh Ji's youth"
    },
    {
      "label": "Inspiration",
      "value": "Inspired her grandsons to face martyrdom with unwavering faith"
    }
  ],
  "version": {
    "lastUpdated": "2024-08-30T12:00:00Z",
    "version": "1.0",
    "contributors": 0,
    "edits": 0,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "fas fa-child",
      "value": "Mata Gujri Ji was born in 1624 to Bhai Lal Chand Subhikkī and Mata Bishan Devi, a pious couple from Kartarpur, located in the present-day Kapurthala district of Punjab. Her father, Lal Chand, had originally migrated from Lakhnaur in Ambala district. In 1629, she was betrothed to Guru Tegh Bahadur Ji, who had visited Kartarpur for his elder brother Suraj Mal's marriage. Their wedding solemnized on February 4, 1633, in Kartarpur. Following her marriage, she moved with her husband to Amritsar. In 1635, the holy family relocated to Kiratpur, and after the passing of Guru Hargobind Ji (the sixth Sikh Guru) in 1644, Mata Gujri Ji, along with Guru Tegh Bahadur Ji and Mata Nanaki Ji, settled in Bakala, near Amritsar, where her husband engaged in deep meditation."
    },
    {
      "label": "Contributions/Service",
      "icon": "fas fa-hands-helping",
      "value": "Mata Gujri Ji played a profoundly significant role throughout her life, not only as a devoted wife and mother but also as a resilient leader. When Guru Tegh Bahadur Ji embarked on a long missionary tour, he left Mata Gujri Ji and Mata Nanaki Ji in Patna. It was there, on December 22, 1666, that she gave birth to Gobind Rai, who would later become Guru Gobind Singh Ji. During Guru Tegh Bahadur Ji's extensive travels, Mata Gujri Ji ensured the proper upbringing and education of young Gobind Rai, instilling in him the core values of the Sikh faith, courage, and spiritual awareness. Following Guru Tegh Bahadur Ji's martyrdom in Delhi in 1675, Mata Gujri Ji shouldered the immense responsibility of managing the affairs of Chakk Nanaki (later Anandpur Sahib), guiding the nascent Sikh community during a period of intense political and religious pressure. She was ably assisted by her younger brother, Kirpal Chand. SikhiWiki also notes her role in organizing the 'langar' (community kitchen) and acting as an administrator for the Sikh army, inspiring the Khalsa forces, particularly during the Battle of Bhangani. She also oversaw the marriage arrangements of Guru Gobind Rai to Mata Jito Ji in 1677 and the 'Maklaavaa' ceremony in 1685."
    },
    {
      "label": "Final Years",
      "icon": "fas fa-hourglass-end",
      "value": "Mata Gujri Ji's final days are etched in Sikh history as a testament to unparalleled sacrifice. In December 1705, during the forced evacuation of Anandpur Sahib amidst a prolonged Mughal siege, she became separated from Guru Gobind Singh Ji along with her two youngest grandsons, Sahibzada Zorawar Singh Ji and Sahibzada Fateh Singh Ji, while crossing the swollen Sarsa rivulet. A Brahmin servant named Gangu, to whom they had entrusted their safety, treacherously betrayed them to the Mughal authorities. On December 8, 1705, Mata Gujri Ji and her grandsons were arrested and imprisoned in the 'Thanda Burj' (cold tower) of Sirhind Fort. Despite the severe cold and harsh conditions, Mata Gujri Ji remained a beacon of strength, continuously encouraging her grandsons to remain steadfast in their Sikh faith. She reminded them of the sacrifices made by their grandfather and great-grandfather. On December 12, 1705, after her grandsons were martyred by being bricked alive for refusing to convert to Islam, Mata Gujri Ji also passed away in the cold tower, having fulfilled her mission of upholding righteousness. Seth Todar Mal, a wealthy and compassionate local merchant of Sirhind, courageously purchased land by paying for gold coins placed on their edge to ensure a proper cremation for Mata Gujri Ji and her grandsons."
    }
  ],
  "spiritualLegacy": {
    "description": "Mata Gujri Ji's spiritual legacy is profound, built upon her unwavering faith, exemplary courage, and supreme sacrifice. She embodied the fundamental Sikh principles of devotion, resilience, and an unshakeable commitment to Dharma (righteousness). Her life story continues to inspire countless individuals to live a life of conviction and selflessness.",
    "keyContributions": [
      "Provided the spiritual foundation and upbringing for Guru Gobind Singh Ji, shaping him into the formidable leader and saint-soldier he became.",
      "Demonstrated extraordinary leadership and fortitude in managing the affairs of the Sikh community following the martyrdom of Guru Tegh Bahadur Ji.",
      "Her ultimate sacrifice alongside her young grandsons served as a pivotal moment in Sikh history, solidifying the importance of religious freedom and the principled stand against tyranny."
    ]
  },
  "modernRelevance": {
    "description": "Mata Gujri Ji's life holds immense relevance in the modern world, serving as a powerful emblem of strength, sacrifice, and the unwavering defense of one's beliefs. Her story transcends religious boundaries, inspiring individuals globally to confront injustice and uphold moral values.",
    "contemporaryImpact": [
      "Inspires resilience and courage in the face of political and social oppression.",
      "Her sacrifice underscores the universal value of religious freedom and the right to practice one's faith without fear.",
      "She is revered as a symbol of women's strength and leadership, especially in times of crisis, motivating Sikh women globally."
    ]
  },
  "achievements": [
    {
      "title": "Mother of Guru Gobind Singh Ji",
      "year": "1666",
      "description": "Gave birth to Gobind Rai (later Guru Gobind Singh Ji), the tenth Sikh Guru, and played a crucial role in his early spiritual and martial upbringing.",
      "icon": ""
    },
    {
      "title": "Guardian of the Panth",
      "year": "1675-1705",
      "description": "Took charge of the Sikh community's affairs after Guru Tegh Bahadur Ji's martyrdom, providing guidance and stability during a turbulent period.",
      "icon": ""
    },
    {
      "title": "Inspiration for Sahibzadas",
      "year": "1705",
      "description": "Instilled unwavering faith and courage in her grandsons, Sahibzada Zorawar Singh Ji and Sahibzada Fateh Singh Ji, leading to their steadfast martyrdom for Sikh principles.",
      "icon": ""
    },
    {
      "title": "Martyrdom",
      "year": "1705-12-26",
      "description": "Achieved supreme sacrifice in Sirhind, refusing to abandon her faith, thus becoming a pivotal martyr in Sikh history.",
      "icon": ""
    }
  ],
  "quotes": [
    {
      "original": "ਤੁਸੀਂ ਗੁਰੂ ਗੋਬਿੰਦ ਸਿੰਘ ਦੇ ਪੁੱਤਰ ਹੋ, ਤੁਹਾਨੂੰ ਡਰਨ ਦੀ ਕੋਈ ਲੋੜ ਨਹੀਂ।",
      "transliteration": "Tusi Guru Gobind Singh de puttar ho, tuhanu daran di koi lorh nahin.",
      "translation": "You are the sons of Guru Gobind Singh; you have no need to fear.",
      "context": "Spoken to her grandsons, Sahibzada Zorawar Singh Ji and Sahibzada Fateh Singh Ji, while imprisoned in the 'Thanda Burj' in Sirhind, encouraging them to remain firm in their faith against Mughal demands.",
      "source": "Sikh oral tradition, historical accounts (citationNeeded)"
    }
  ],
  "timeline": [
    {
      "year": 1624,
      "date": "",
      "event": "Birth of Mata Gujri Ji.",
      "type": "Birth"
    },
    {
      "year": 1629,
      "date": "",
      "event": "Betrothal to Guru Tegh Bahadur Ji.",
      "type": "Personal"
    },
    {
      "year": 1633,
      "date": "February 4",
      "event": "Marriage to Guru Tegh Bahadur Ji in Kartarpur.",
      "type": "Personal"
    },
    {
      "year": 1644,
      "date": "",
      "event": "Moved to Bakala with Guru Tegh Bahadur Ji and Mata Nanaki Ji.",
      "type": "Relocation"
    },
    {
      "year": 1666,
      "date": "December 22",
      "event": "Birth of her son, Gobind Rai (Guru Gobind Singh Ji), in Patna.",
      "type": "Personal"
    },
    {
      "year": 1670,
      "date": "September 13",
      "event": "Arrived in Lakhnaur with Mata Nanaki Ji and young Gobind Rai.",
      "type": "Relocation"
    },
    {
      "year": 1675,
      "date": "November 11",
      "event": "Guru Tegh Bahadur Ji's martyrdom in Delhi.",
      "type": "Historical"
    },
    {
      "year": 1675,
      "date": "",
      "event": "Took responsibility for managing affairs at Chakk Nanaki (Anandpur).",
      "type": "Leadership"
    },
    {
      "year": 1677,
      "date": "July",
      "event": "Arranged the marriage of Guru Gobind Singh Ji to Mata Jito Ji.",
      "type": "Personal"
    },
    {
      "year": 1685,
      "date": "May",
      "event": "Arranged the 'Maklaavaa' ceremony for Guru Gobind Singh Ji.",
      "type": "Personal"
    },
    {
      "year": 1700,
      "date": "",
      "event": "Became primary caregiver for younger Sahibzadas after Mata Sundri Ji's passing.",
      "type": "Personal"
    },
    {
      "year": 1705,
      "date": "December 5-6",
      "event": "Evacuation of Anandpur Sahib.",
      "type": "Historical"
    },
    {
      "year": 1705,
      "date": "December 8",
      "event": "Arrested with Sahibzada Zorawar Singh Ji and Sahibzada Fateh Singh Ji.",
      "type": "Historical"
    },
    {
      "year": 1705,
      "date": "December 11",
      "event": "Sahibzadas ordered to be bricked alive.",
      "type": "Historical"
    },
    {
      "year": 1705,
      "date": "December 12",
      "event": "Sahibzadas executed, Mata Gujri Ji attained martyrdom in Sirhind.",
      "type": "Martyrdom"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Tegh Bahadur Ji",
      "relation": "Husband",
      "slug": "guru-tegh-bahadur-ji"
    },
    {
      "name": "Guru Gobind Singh Ji",
      "relation": "Son",
      "slug": "guru-gobind-singh-ji"
    },
    {
      "name": "Sahibzada Zorawar Singh Ji",
      "relation": "Grandson",
      "slug": "baba-zorawar-singh-ji"
    },
    {
      "name": "Sahibzada Fateh Singh Ji",
      "relation": "Grandson",
      "slug": "sahibzada-fateh-singh-ji"
    },
    {
      "name": "Seth Todar Mal",
      "relation": "Benefactor who performed cremation",
      "slug": "seth-todar-mal"
    }
  ],
  "historicalContext": {
    "period": "Late 17th and early 18th century in India, marked by the reign of the Mughal Emperor Aurangzeb.",
    "politicalSituation": "Aurangzeb's rule was characterized by religious intolerance and persecution of non-Muslims, aiming to establish an Islamic state. This led to significant oppression of various religious communities, including Sikhs, Hindus, and others. The execution of Guru Tegh Bahadur Ji was a direct result of this policy, and the subsequent targeting of Guru Gobind Singh Ji and his family continued this pattern of persecution.",
    "socialConditions": "Society was deeply divided along religious lines, with the ruling Mughal class exerting dominance. Non-Muslims faced discrimination, including the imposition of the jizya tax and restrictions on religious practices. The common people, especially in Punjab, lived under constant threat and insecurity, leading to a strong desire for self-defense and religious freedom.",
    "significance": "Mata Gujri Ji's life and martyrdom are central to understanding the sacrifices made by the Sikh Gurus and their families to uphold religious freedom and human dignity. Her unwavering resolve, particularly in nurturing Guru Gobind Singh Ji and inspiring her grandsons, fortified the Sikh spirit during one of its most challenging periods. Her sacrifice, along with that of the Sahibzadas, galvanized the Sikh community, reinforcing their commitment to fighting tyranny and protecting the rights of all. The events in Sirhind remain a powerful symbol of courage and resistance against oppression, profoundly impacting Sikh identity and historical narrative."
  },
  "references": [
    "Wikipedia: https://en.wikipedia.org/wiki/Mata_Gujri",
    "SikhiWiki: https://www.sikhiwiki.org/index.php/Mata_Gujri",
    "Dahiya, Amardeep S. (2014), *Founder of the Khalsa: The Life and Times of Guru Gobind Singh*, Hay House, ISBN 978-93-81398-53-1 (cited by Wikipedia)",
    "SikhNet: https://www.sikhnet.com/news/untold-story-mata-gujri-kaur-and-chhote-sahibzadeh (citationNeeded)",
    "SikhNet: https://www.sikhnet.com/news/art-mata-gujri-ji-and-chote-sahibzade (citationNeeded)",
    "Sikh Oral Tradition and Historical Accounts"
  ]
}
