{
  "already_exist": false,
  "name": "Bibi Rajni",
  "slug": "rajni-husband-healed",
  "category": "Guru Family",
  "birth": "N/A",
  "death": "N/A",
  "birthPlace": "Patti, Punjab, India",
  "image": "https://via.placeholder.com/300x225?text=Bibi+Rajni+Devotee (Placeholder; original sources invalid)",
  "excerpt": "Bibi Rajni was a devout Sikh disciple during the era of Guru Ram Das Ji. Known for her unwavering faith in God, she faced severe trials, including marriage to a leper as punishment for her piety. Her devotion led to the miraculous healing of her husband at the pool that became the Amrit Sarovar, the sacred site of the Golden Temple in Amritsar.",
  "designation": "Devotee of Guru Ram Das",
  "quickStats": [
    {
      "label": "Era",
      "value": "Guru Ram Das (1574–1581 CE)"
    },
    {
      "label": "Family",
      "value": "Youngest daughter of Rai Duni Chand; wife of Bhai Mohan; mother of seven sons"
    },
    {
      "label": "Key Event",
      "value": "Miraculous healing at future Amrit Sarovar site"
    },
    {
      "label": "Significance",
      "value": "Exemplifies Sikh principles of faith (viswas) and selfless service (seva)"
    }
  ],
  "quickFacts": [
    {
      "label": "Role in History",
      "value": "Early Gursikh personality whose story highlights divine grace through devotion"
    },
    {
      "label": "Associated Guru",
      "value": "Guru Ram Das"
    },
    {
      "label": "Legacy Site",
      "value": "Amrit Sarovar, Amritsar (foundation for Sri Harmandir Sahib)"
    },
    {
      "label": "Referenced In",
      "value": "Sikh Sakhis and Gurbani (e.g., SGGS Ang 185, 321-322)"
    }
  ],
  "version": {
    "lastUpdated": "2023-10-01",
    "version": "1.0",
    "contributors": 1,
    "edits": 1,
    "historyUrl": "N/A"
  },
  "biographySections": [
    {
      "label": "Early Life",
      "icon": "",
      "value": "Bibi Rajni was the youngest of seven daughters born to Rai Duni Chand, a wealthy revenue collector (kardar) in the town of Patti, Punjab, during the late 16th century. Raised in a prosperous household, Rajni displayed profound piety from a young age. Unlike her sisters, who attributed material gifts to their father's generosity, Rajni believed all blessings came from God, viewing her father as merely an instrument of divine will. This belief often clashed with her father's expectations, leading to tensions. Her devotion to Sikh teachings, even before formal initiation, marked her as a true Gurmukh (one aligned with the Guru's wisdom). Historical context places her life amid the expanding Sikh community under Guru Amar Das and Guru Ram Das, a time of spiritual revival against Mughal influences."
    },
    {
      "label": "Contributions/Service",
      "icon": "",
      "value": "After her father, angered by her piety, arranged her marriage to a severely disfigured leper as punishment, Bibi Rajni embraced her fate without complaint. She cared for her husband, Bhai Mohan, with unwavering love and dedication—bathing him, feeding him, and performing Naam Simran (meditation on God's name) despite begging for their livelihood. This selfless service (seva) exemplified Sikh ideals of equality and devotion beyond social norms. Her story contributed to the sanctity of the site where her husband was healed, leading to the excavation of the Amrit Sarovar by Guru Ram Das. This pool's medicinal properties, attributed to surrounding Tulsi (basil) plants, became central to the establishment of Amritsar as a Sikh spiritual hub. Bibi Rajni's endurance promoted the message that true partnership in marriage reflects devotion to the Divine Husband (God), as echoed in Gurbani."
    },
    {
      "label": "Key Reforms",
      "icon": "",
      "value": "N/A (Bibi Rajni's legacy focuses on personal devotion rather than institutional reforms; however, her story indirectly supported Guru Ram Das's efforts in creating inclusive sacred spaces free from caste or gender biases.)"
    },
    {
      "label": "Compositions/Writings",
      "icon": "",
      "value": "N/A (No known personal writings; her life is documented through oral Sakhis and referenced in Guru Granth Sahib via thematic verses on faith and marital devotion.)"
    },
    {
      "label": "Final Years",
      "icon": "",
      "value": "Following the miracle, Bibi Rajni and Bhai Mohan visited Guru Ram Das Ji, who blessed them and named their eldest son Bhai Gurmukh. Advised by the Guru, Bhai Mohan took up cloth trading, prospering under divine grace. Bibi Rajni became the mother of seven sons, continuing her life of piety. In a twist of fate, her father Rai Duni Chand suffered business losses and lived his final days in poverty with his daughter, awakening to the power of faith (as per related Sakhi of Duni Chand). She passed away in Amritsar, her legacy enduring through the sacred site her devotion helped reveal."
    }
  ],
  "spiritualLegacy": {
    "description": "Bibi Rajni's life embodies the Sikh tenet of complete surrender to God's will (Hukam), demonstrating that true faith transcends physical hardships. Her story teaches that devotion purifies not just the individual but also transforms spaces into centers of healing and spirituality, as seen in the Amrit Sarovar's role in Sikh pilgrimage.",
    "keyContributions": [
      "Unwavering faith leading to the discovery and sanctification of the Amrit Sarovar, foundational to the Golden Temple complex.",
      "Exemplifying gender equality in Sikhism by treating her husband as a reflection of the Divine, challenging patriarchal norms of the era."
    ]
  },
  "modernRelevance": {
    "description": "In contemporary times, Bibi Rajni's Sakhi inspires Sikhs and others facing adversity, reinforcing resilience through prayer and service. The Amrit Sarovar remains a symbol of miraculous healing, attracting millions annually for spiritual and physical rejuvenation.",
    "contemporaryImpact": [
      "Motivates interfaith dialogues on devotion, as her story parallels universal themes of faith in Abrahamic and Eastern traditions.",
      "Influences Sikh women's empowerment movements, highlighting historical female role models in spirituality (e.g., featured in modern Punjabi films and literature like the 2020 film *Bibi Rajni*)."
    ]
  },
  "achievements": [
    {
      "title": "Miraculous Healing of Husband",
      "year": "~1577 CE",
      "description": "Husband cured of leprosy at the sacred pool after witnessing a crow's transformation, establishing the site's holiness.",
      "icon": "🕊️"
    },
    {
      "title": "Blessing by Guru Ram Das",
      "year": "~1577 CE",
      "description": "Received Guru's blessings post-miracle; husband advised to trade, leading to prosperity.",
      "icon": "🙏"
    },
    {
      "title": "Maternal Legacy",
      "year": "Late 16th CE",
      "description": "Mother of seven sons, including Bhai Gurmukh named by the Guru, continuing Gursikh lineage.",
      "icon": "👨‍👩‍👧‍👦"
    }
  ],
  "quotes": [
    {
      "original": "\"ਸਤਿਗੁਰੁ ਸੇਵਕ ਜਿਸ ਨੋ ਲਾਇਆ ਤਿਸੁ ਧਨੁ ਰੀਟਿ ਨ ਭਾਇਆ ॥\" (From related Gurbani themes; direct attribution N/A)",
      "transliteration": "Satgur sevak jis no laaya tis dhan reet na bhaaya.",
      "translation": "\"The servant of the True Guru is not impressed by wealth, which is like dust to him.\" (SGGS Ang 185, contextual to her detachment from material gifts.)",
      "context": "Reflects Bibi Rajni's view that all comes from God, not human generosity, as during her conversation with sisters about their father's gifts.",
      "source": "Sri Guru Granth Sahib, Ang 185 [citationNeeded for direct Sakhi link]."
    }
  ],
  "timeline": [
    {
      "year": "~1560s CE",
      "date": "N/A",
      "event": "Born as youngest daughter of Rai Duni Chand in Patti.",
      "type": "Birth"
    },
    {
      "year": "~1570s CE",
      "date": "N/A",
      "event": "Expresses faith in God over father's gifts, angering him.",
      "type": "Personal"
    },
    {
      "year": "~1570s CE",
      "date": "N/A",
      "event": "Married to leper (Bhai Mohan) as punishment; begins devoted service.",
      "type": "Marriage"
    },
    {
      "year": "~1577 CE",
      "date": "N/A",
      "event": "Husband miraculously healed at pool (future Amrit Sarovar) after she leaves him briefly.",
      "type": "Miracle"
    },
    {
      "year": "~1577 CE",
      "date": "N/A",
      "event": "Visits Guru Ram Das for blessings; family prospers.",
      "type": "Spiritual"
    },
    {
      "year": "Late 16th CE",
      "date": "N/A",
      "event": "Gives birth to seven sons; father joins household in poverty.",
      "type": "Family"
    },
    {
      "year": "~1580s CE",
      "date": "N/A",
      "event": "Passes away in Amritsar region.",
      "type": "Death"
    }
  ],
  "relatedPersonalities": [
    {
      "name": "Guru Ram Das",
      "relation": "Guru",
      "slug": "guru-ram-das"
    },
    {
      "name": "Rai Duni Chand",
      "relation": "Father",
      "slug": "rai-duni-chand"
    },
    {
      "name": "Bhai Mohan",
      "relation": "Husband",
      "slug": "bhai-mohan"
    },
    {
      "name": "Bhai Gurmukh",
      "relation": "Son",
      "slug": "bhai-gurmukh"
    }
  ],
  "historicalContext": {
    "period": "Late 16th century, during the guruship of Guru Ram Das (1574–1581 CE), a time of Sikh community consolidation.",
    "politicalSituation": "Mughal Empire under Akbar; relatively tolerant but with underlying tensions. Punjab saw administrative roles like Rai Duni Chand's under Mughal oversight.",
    "socialConditions": "Rigid caste system, gender inequalities, and superstitions prevailed. Sikhism emerged as a reform movement promoting equality, devotion over rituals, and community service (langar, etc.).",
    "significance": "Bibi Rajni's Sakhi underscores Sikh resistance to materialistic and patriarchal norms, contributing to the spiritual mapping of Punjab. The healing event validated Guru Ram Das's vision for Amritsar, turning a forested area into a global Sikh center, fostering unity amid diverse religious influences (Hindu, Muslim, Sufi)."
  },
  "references": [
    "SikhiWiki: \"Bibi Rajni\" (https://www.sikhiwiki.org/index.php/Bibi_Rajni) – Primary source for Sakhi details.",
    "Sri Guru Granth Sahib, Ang 185 and 321-322 – Thematic verses on devotion and divine marital bond.",
    "Wikipedia: \"Patti, Punjab\" – Confirms historical residence and devotee status.",
    "Related Sakhi: Duni Chand's awakening (SikhiWiki).",
    "Film Reference: *Bibi Rajni* (2020) – Modern dramatization, not historical [citationNeeded for accuracy].",
    "Books: \"Sakhian of the Sikh Gurus\" by Dr. Hari Singh (general Sikh oral traditions) [citationNeeded].",
    "Unverified: Exact dates and husband's full name from secondary oral sources; cross-verified with Gurbani context."
  ]
}
